[
    {
        "name": "Ancient-Blooded Dwarf",
        "desc": "Dwarven heroes of old could shrug off their enemies' magic, and some of that resistance manifests in you. You gain the Call on Ancient Blood reaction.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "gainActivities": [
            "Call on Ancient Blood"
        ]
    },
    {
        "name": "Death Warden Dwarf",
        "desc": "Your ancestors have been tomb guardians for generations, and the power they cultivated to ward off necromancy has passed on to you. If you roll a success on a saving throw against a necromancy effect, you get a critical success instead.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Death Warden Dwarf",
                        "source": "Death Warden Dwarf",
                        "sourceId": "1-Feat-Death Warden Dwarf-0"
                    }
                ],
                "id": "1-Feat-Death Warden Dwarf-0",
                "level": 0,
                "source": "Death Warden Dwarf"
            }
        ]
    },
    {
        "name": "Forge Dwarf",
        "desc": "You have a remarkable adaptation to hot environments from ancestors who inhabited blazing deserts or volcanic chambers beneath the earth. This grants you fire resistance equal to half your level (minimum 1), and you treat environmental heat effects as if they were one step less extreme (incredible heat becomes extreme, extreme heat becomes severe, and so on).",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Forge Dwarf",
                        "source": "Forge Dwarf",
                        "sourceId": "1-Feat-Forge Dwarf-0"
                    }
                ],
                "id": "1-Feat-Forge Dwarf-0",
                "level": 0,
                "source": "Forge Dwarf"
            }
        ]
    },
    {
        "name": "Rock Dwarf",
        "desc": "Your ancestors lived and worked among the great ancient stones of the mountains or the depths of the earth. This makes you solid as a rock when you plant your feet. You gain a +2 circumstance bonus to your Fortitude or Reflex DC against attempts to Shove or Trip you. This bonus also applies to saving throws against spells or effects that attempt to knock you prone.\n\nIn addition, if any effect would force you to move 10 feet or more, you are moved only half the distance.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Rock Dwarf",
                        "source": "Rock Dwarf",
                        "sourceId": "1-Feat-Rock Dwarf-0"
                    }
                ],
                "id": "1-Feat-Rock Dwarf-0",
                "level": 0,
                "source": "Rock Dwarf"
            }
        ]
    },
    {
        "name": "Strong-Blooded Dwarf",
        "desc": "Your blood runs hearty and strong, and you can shake off toxins. You gain poison resistance equal to half your level (minimum 1), and each of your successful saving throws against a poison affliction reduces its stage by 2, or by 1 for a virulent poison. Each critical success against an ongoing poison reduces its stage by 3, or by 2 for a virulent poison.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Strong-Blooded Dwarf",
                        "source": "Strong-Blooded Dwarf",
                        "sourceId": "1-Feat-Strong-Blooded Dwarf-0"
                    }
                ],
                "id": "1-Feat-Strong-Blooded Dwarf-0",
                "level": 0,
                "source": "Strong-Blooded Dwarf"
            }
        ]
    },
    {
        "name": "Arctic Elf",
        "desc": "You dwell deep in the frozen north and have gained incredible resilience against cold environments, granting you cold resistance equal to half your level (minimum 1). You treat environmental cold effects as if they were one step less extreme (incredible cold becomes extreme, extreme cold becomes severe, and so on).",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Arctic Elf",
                        "source": "Arctic Elf",
                        "sourceId": "1-Feat-Arctic Elf-0"
                    }
                ],
                "id": "1-Feat-Arctic Elf-0",
                "level": 0,
                "source": "Arctic Elf"
            }
        ]
    },
    {
        "name": "Cavern Elf",
        "desc": "You were born or spent many years in underground tunnels or caverns where light is scarce. You gain darkvision.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "senses": [
            "Darkvision"
        ]
    },
    {
        "name": "Seer Elf",
        "desc": "You have an inborn ability to detect and understand magical phenomena. You can cast the detect magic cantrip as an arcane innate spell at will. A cantrip is heightened to a spell level equal to half your level rounded up.\n\nIn addition, you gain a +1 circumstance bonus to checks to Identify Magic and to Decipher Writing of a magical nature. These skill actions typically use the Arcana, Nature, Occultism, or Religion skill.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Seer Elf",
                        "source": "Seer Elf",
                        "sourceId": "1-Feat-Seer Elf-0"
                    }
                ],
                "id": "1-Feat-Seer Elf-0",
                "level": 0,
                "source": "Seer Elf"
            }
        ],
        "spellChoices": [
            {
                "castingType": "Innate",
                "charLevelAvailable": 1,
                "className": "Innate",
                "frequency": "at will",
                "id": "869a7934-9be8-4264-b08a-6540581fdaa8",
                "source": "Seer Elf",
                "spells": [
                    {
                        "frequency": "at will",
                        "locked": true,
                        "name": "Detect Magic"
                    }
                ],
                "tradition": "Arcane"
            }
        ]
    },
    {
        "name": "Whisper Elf",
        "desc": "Your ears are finely tuned, able to detect even the slightest whispers of sound. As long as you can hear normally, you can use the Seek action to sense undetected creatures in a 60-foot cone instead of a 30-foot cone. You also gain a +2 circumstance bonus to locate undetected creatures that you could hear within 30 feet with a Seek action.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Whisper Elf",
                        "source": "Whisper Elf",
                        "sourceId": "1-Feat-Whisper Elf-0"
                    }
                ],
                "id": "1-Feat-Whisper Elf-0",
                "level": 0,
                "source": "Whisper Elf"
            }
        ]
    },
    {
        "name": "Woodland Elf",
        "desc": "You're adapted to life in the forest or the deep jungle, and you know how to climb trees and use foliage to your advantage. When Climbing trees, vines, and other foliage, you move at half your Speed on a success and at full Speed on a critical success (and you move at full Speed on a success if you have Quick Climb). This doesn't affect you if you're using a climb Speed.\n\nYou can always use the Take Cover action when you are within forest terrain to gain cover, even if you're not next to an obstacle you can Take Cover behind.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Woodland Elf Climbing",
                        "source": "Woodland Elf",
                        "sourceId": "1-Feat-Woodland Elf-0"
                    }
                ],
                "id": "1-Feat-Woodland Elf-0",
                "level": 0,
                "source": "Woodland Elf"
            }
        ]
    },
    {
        "name": "Chameleon Gnome",
        "desc": "The color of your hair and skin is mutable, possibly due to latent magic. You can slowly change the vibrancy and the exact color, and the coloration can be different across your body, allowing you to create patterns or other colorful designs. It takes a single action for minor localized shifts and up to an hour for dramatic shifts throughout your body. While you're asleep, the colors shift on their own in tune with your dreams, giving you an unusual coloration each morning. When you're in an area where your coloration is roughly similar to the environment (for instance, forest green in a forest), you can use the single action to make minor localized shifts designed to help you blend into your surroundings. This grants you a +2 circumstance bonus to Stealth checks until your surroundings shift in coloration or pattern.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "gainActivities": [
            "Chameleon Gnome"
        ]
    },
    {
        "name": "Fey-Touched Gnome",
        "desc": "The blood of the fey is so strong within you that you're truly one of them. You gain the fey trait, in addition to the gnome and humanoid traits. Choose one cantrip from the primal spell list. You can cast this spell as a primal innate spell at will. A cantrip is heightened to a spell level equal to half your level rounded up. You can change this cantrip to a different one from the same list once per day by meditating to realign yourself with the First World; this is a 10-minute activity that has the concentrate trait.",
        "traits": [
            "Fey"
        ],
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "gainActivities": [
            "Fey-Touched Gnome"
        ],
        "spellChoices": [
            {
                "available": 1,
                "castingType": "Innate",
                "charLevelAvailable": 1,
                "className": "Innate",
                "frequency": "at will",
                "id": "7b1056c0-028f-421a-88d5-d8dd61a8084c",
                "source": "Fey-Touched Gnome",
                "tradition": "Primal"
            }
        ]
    },
    {
        "name": "Sensate Gnome",
        "desc": "You see all colors as brighter, hear all sounds as richer, and especially smell all scents with incredible detail. You gain a special sense: imprecise scent with a range of 30 feet. This means you can use your sense of smell to determine the exact location of a creature. The GM will usually double the range if you're downwind from the creature or halve the range if you're upwind.\n\nIn addition, you gain a +2 circumstance bonus to Perception checks whenever you're trying to locate an undetected creature that is within the range of your scent.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Sensate Gnome",
                        "source": "Sensate Gnome",
                        "sourceId": "1-Feat-Sensate Gnome-0"
                    }
                ],
                "id": "1-Feat-Sensate Gnome-0",
                "level": 0,
                "source": "Sensate Gnome"
            }
        ],
        "senses": [
            "Scent 30 feet (imprecise)"
        ]
    },
    {
        "name": "Umbral Gnome",
        "desc": "Whether from a connection to dark or shadowy fey, from the underground deep gnomes also known as svirfneblin, or another source, you can see in complete darkness. You gain darkvision.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "senses": [
            "Darkvision"
        ]
    },
    {
        "name": "Wellspring Gnome",
        "desc": "Some other source of magic has a greater hold on you than the primal magic of your fey lineage does. This connection might come from an occult plane or an ancient occult song; a deity, celestial, or fiend; magical effluent left behind by a mage war; or ancient rune magic.\n\nChoose arcane, divine, or occult. You gain one cantrip from that magical tradition's spell list. You can cast this spell as an innate spell at will, as a spell of your chosen tradition. A cantrip is heightened to a spell level equal to half your level rounded up. Whenever you gain a primal innate spell from a gnome ancestry feat, change its tradition from primal to your chosen tradition.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "subTypes": [
            {
                "name": "Wellspring Gnome (Arcane)",
                "spellChoices": [
                    {
                        "available": 1,
                        "castingType": "Innate",
                        "charLevelAvailable": 1,
                        "className": "Innate",
                        "frequency": "at will",
                        "id": "a9fa972e-9c44-11ea-bb37-0242ac130002",
                        "source": "Wellspring Gnome",
                        "tradition": "Arcane"
                    }
                ],
                "subType": "Arcane",
                "superType": "Wellspring Gnome"
            },
            {
                "name": "Wellspring Gnome (Divine)",
                "spellChoices": [
                    {
                        "available": 1,
                        "castingType": "Innate",
                        "charLevelAvailable": 1,
                        "className": "Innate",
                        "frequency": "at will",
                        "id": "a9fa992c-9c44-11ea-bb37-0242ac130002",
                        "source": "Wellspring Gnome",
                        "tradition": "Divine"
                    }
                ],
                "subType": "Divine",
                "superType": "Wellspring Gnome"
            },
            {
                "name": "Wellspring Gnome (Occult)",
                "spellChoices": [
                    {
                        "available": 1,
                        "castingType": "Innate",
                        "charLevelAvailable": 1,
                        "className": "Innate",
                        "frequency": "at will",
                        "id": "a9fa9b98-9c44-11ea-bb37-0242ac130002",
                        "source": "Wellspring Gnome",
                        "tradition": "Occult"
                    }
                ],
                "subType": "Occult",
                "superType": "Wellspring Gnome"
            }
        ]
    },
    {
        "name": "Charhide Goblin",
        "desc": "Your ancestors have always had a connection to fire and a thicker skin, which allows you to resist burning. You gain fire resistance equal to half your level (minimum 1). You can also recover from being on fire more easily. Your flat check to remove persistent fire damage is DC 10 instead of DC 15, which is reduced to DC 5 if another creature uses a particularly appropriate action to help.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Charhide Goblin",
                        "source": "Charhide Goblin",
                        "sourceId": "1-Feat-Charhide Goblin-0"
                    }
                ],
                "id": "1-Feat-Charhide Goblin-0",
                "level": 0,
                "source": "Charhide Goblin"
            }
        ]
    },
    {
        "name": "Irongut Goblin",
        "desc": "You can subsist on food that most folks would consider spoiled. You can keep yourself fed with poor meals in a settlement as long as garbage is readily available, without using the Subsist downtime activity. You can eat and drink things when you are sickened.\n\nYou gain a +2 circumstance bonus to saving throws against afflictions, against gaining the sickened condition, and to remove the sickened condition. When you roll a success on a Fortitude save affected by this bonus, you get a critical success instead. All these benefits apply only when the affliction or condition resulted from something you ingested.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Irongut Goblin",
                        "source": "Irongut Goblin",
                        "sourceId": "1-Feat-Irongut Goblin-0"
                    }
                ],
                "id": "1-Feat-Irongut Goblin-0",
                "level": 0,
                "source": "Irongut Goblin"
            }
        ]
    },
    {
        "name": "Razortooth Goblin",
        "desc": "Your family's teeth are formidable weapons. You gain a jaws unarmed attack that deals 1d6 piercing damage. Your jaws are in the brawling group and have the finesse and unarmed traits.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "gainItems": [
            {
                "name": "Razortooth Goblin Jaws",
                "type": "weapons"
            }
        ]
    },
    {
        "name": "Snow Goblin",
        "desc": "You are acclimated to living in frigid lands and have skin ranging from sky blue to navy in color, as well as blue fur. You gain cold resistance equal to half your level (minimum 1). You treat environmental cold effects as if they were one step less extreme (incredible cold becomes extreme, extreme cold becomes severe, and so on).",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Snow Goblin",
                        "source": "Snow Goblin",
                        "sourceId": "1-Feat-Snow Goblin-0"
                    }
                ],
                "id": "1-Feat-Snow Goblin-0",
                "level": 0,
                "source": "Snow Goblin"
            }
        ]
    },
    {
        "name": "Unbreakable Goblin",
        "desc": "You're able to bounce back from injuries easily due to an exceptionally thick skull, cartilaginous bones, or some other mixed blessing. You gain 10 Hit Points from your ancestry instead of 6. When you fall, reduce the falling damage you take as though you had fallen half the distance.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Unbreakable Goblin",
                        "source": "Unbreakable Goblin",
                        "sourceId": "1-Feat-Unbreakable Goblin-0"
                    }
                ],
                "id": "1-Feat-Unbreakable Goblin-0",
                "level": 0,
                "source": "Unbreakable Goblin"
            }
        ]
    },
    {
        "name": "Gutsy Halfling",
        "desc": "Your family line is known for keeping a level head and staving off fear when the chips were down, making them wise leaders and sometimes even heroes. When you roll a success on a saving throw against an emotion effect, you get a critical success instead.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Gutsy Halfling",
                        "source": "Gutsy Halfling",
                        "sourceId": "1-Feat-Gutsy Halfling-0"
                    }
                ],
                "id": "1-Feat-Gutsy Halfling-0",
                "level": 0,
                "source": "Gutsy Halfling"
            }
        ]
    },
    {
        "name": "Hillock Halfling",
        "desc": "Accustomed to a calm life in the hills, your people find rest and relaxation especially replenishing, particularly when indulging in creature comforts. When you regain Hit Points overnight, add your level to the Hit Points regained. When anyone uses the Medicine skill to Treat your Wounds, you can eat a snack to add your level to the Hit Points you regain from their treatment.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Hillock Halfling",
                        "source": "Hillock Halfling",
                        "sourceId": "1-Feat-Hillock Halfling-0"
                    }
                ],
                "id": "1-Feat-Hillock Halfling-0",
                "level": 0,
                "source": "Hillock Halfling"
            }
        ]
    },
    {
        "name": "Nomadic Halfling",
        "desc": "Your ancestors have traveled from place to place for generations, never content to settle down. You gain two additional languages of your choice, chosen from among the common and uncommon languages available to you, and every time you take the Multilingual feat, you gain another new language.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Nomadic Halfling",
                        "source": "Nomadic Halfling",
                        "sourceId": "1-Feat-Nomadic Halfling-0"
                    }
                ],
                "id": "1-Feat-Nomadic Halfling-0",
                "level": 0,
                "source": "Nomadic Halfling"
            }
        ]
    },
    {
        "name": "Twilight Halfling",
        "desc": "Your ancestors performed many secret acts under the concealing cover of dusk, whether for good or ill, and over time they developed the ability to see in twilight beyond even the usual keen sight of halflings. You gain low-light vision.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "senses": [
            "Low-Light Vision"
        ]
    },
    {
        "name": "Wildwood Halfling",
        "desc": "You hail from deep in a jungle or forest, and you've learned how to use your small size to wriggle through undergrowth, vines, and other obstacles. You ignore difficult terrain from trees, foliage, and undergrowth.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "feats": [
                    {
                        "locked": true,
                        "name": "Wildwood Halfling",
                        "source": "Wildwood Halfling",
                        "sourceId": "1-Feat-Wildwood Halfling-0"
                    }
                ],
                "id": "1-Feat-Wildwood Halfling-0",
                "level": 0,
                "source": "Wildwood Halfling"
            }
        ]
    },
    {
        "name": "Half-Elf",
        "desc": "Either one of your parents was an elf, or one or both were half-elves. You have pointed ears and other telltale signs of elf heritage. You gain the elf trait and low-light vision. In addition, you can select elf, half-elf, and human feats whenever you gain an ancestry feat.",
        "traits": [
            "Elf"
        ],
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "ancestries": [
            "Elf",
            "Half-Elf"
        ],
        "senses": [
            "Low-Light Vision"
        ]
    },
    {
        "name": "Half-Orc",
        "desc": "One of your parents was an orc, or one or both were half-orcs. You have a green tinge to your skin and other indicators of orc heritage. You gain the orc trait and low-light vision. In addition, you can select orc, half-orc, and human feats whenever you gain an ancestry feat.",
        "traits": [
            "Orc"
        ],
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "ancestries": [
            "Orc",
            "Half-Orc"
        ],
        "senses": [
            "Low-Light Vision"
        ]
    },
    {
        "name": "Skilled Heritage",
        "desc": "Your ingenuity allows you to train in a wide variety of skills. You become trained in one skill of your choice. At 5th level, you become an expert in the chosen skill.",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "skillChoices": [
            {
                "available": 1,
                "id": "1-Skill-Skilled Heritage-0",
                "maxRank": 2,
                "source": "Skilled Heritage",
                "type": "Skill"
            }
        ]
    },
    {
        "name": "Versatile Heritage",
        "desc": "Humanity's versatility and ambition have fueled its ascendance to be the most common ancestry in most nations throughout the world. Select a general feat of your choice for which you meet the prerequisites (as with your ancestry feat, you can select this general feat at any point during character creation).",
        "sourceBook": "Core Rulebook",
        "_extensionFileName": "core",
        "featChoices": [
            {
                "available": 1,
                "id": "1-Feat-Versatile Heritage-0",
                "level": 0,
                "source": "Versatile Heritage",
                "type": "General"
            }
        ]
    }
]
