[
    {
        "name": "Flurry of Blows",
        "actions": "1A",
        "traits": [
            "Flourish",
            "Monk"
        ],
        "target": "other",
        "desc": "Make two unarmed Strikes. If both hit the same creature, combine their damage for the purpose of resistances and weaknesses. Apply your multiple attack penalty to the Strikes normally. As it has the flourish trait, you can use Flurry of Blows only once per turn."
    },
    {
        "name": "Crane Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of a crane, holding your arms in an imitation of a crane's wings and using flowing, defensive motions. You gain a +1 circumstance bonus to AC, but the only Strikes you can make are crane wing attacks. These deal 1d6 bludgeoning damage; are in the brawling group; and have the agile, finesse, nonlethal, and unarmed traits.\n\nWhile in Crane Stance, reduce the DC for High Jump and Long Jump by 5, and when you Leap, you can move an additional 5 feet horizontally or 2 feet vertically.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Crane Stance",
                "source": "Crane Stance"
            }
        ]
    },
    {
        "name": "Dragon Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of a dragon and make powerful leg strikes like a lashing dragon's tail. You can make dragon tail attacks that deal 1d10 bludgeoning damage. They are in the brawling group and have the backswing, nonlethal, and unarmed traits.\n\nWhile in Dragon Stance, you can ignore the first square of difficult terrain while Striding.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Dragon Stance",
                "source": "Dragon Stance"
            }
        ]
    },
    {
        "name": "Mountain Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored and touching the ground.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of an implacable mountain - a technique first discovered by dwarven monks - allowing you to strike with the weight of an avalanche. The only Strikes you can make are falling stone unarmed attacks. These deal 1d8 bludgeoning damage; are in the brawling group; and have the forceful, nonlethal, and unarmed traits.\n\nWhile in Mountain Stance, you gain a +4 status bonus to AC and a +2 circumstance bonus to any defenses against being Shoved or Tripped. However, you have a Dexterity modifier cap to your AC of +0, meaning you don't add your Dexterity to your AC, and your Speeds are all reduced by 5 feet.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Mountain Stance",
                "source": "Mountain Stance"
            }
        ]
    },
    {
        "name": "Rain of Embers Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored and touching the ground.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of an enraged phoenix, holding your fingers as rigid as deadly talons while moving with quick, flickering gestures that flicker with dancing flames. The only Strikes you can make are fire talon Strikes. These deal 1d4 fire damage; are in the brawling group; and have the agile, finesse, fire, nonlethal, and unarmed traits.\n\nWhile in Rain of Embers Stance, you gain a +1 status bonus to AC and fire resistance equal to half your level (minimum 1).",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Rain of Embers Stance",
                "source": "Rain of Embers Stance"
            }
        ]
    },
    {
        "name": "Tiger Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of a tiger and can make tiger claw attacks. These deal 1d8 slashing damage; are in the brawling group; and have the agile, finesse, nonlethal, and unarmed traits. On a critical success with your tiger claws, if you deal damage, the target takes 1d4 persistent bleed damage.\n\nAs long as your Speed is at least 20 feet while in Tiger Stance, you can Step 10 feet.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Tiger Stance",
                "source": "Tiger Stance"
            }
        ]
    },
    {
        "name": "Wolf Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of a wolf, low to the ground with your hands held like fanged teeth. You can make wolf jaw unarmed attacks. These deal 1d8 piercing damage; are in the brawling group; and have the agile, backstabber, finesse, nonlethal, and unarmed traits.\n\nIf you're flanking a target while in Wolf Stance, your wolf jaw unarmed attacks also gain the trip trait.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Wolf Stance",
                "source": "Wolf Stance"
            }
        ]
    },
    {
        "name": "Deflect Arrows",
        "actions": "Reaction",
        "traits": [
            "Monk"
        ],
        "requirements": "You're aware of the attack, are not flat-footed against it, and have a hand free.",
        "trigger": "You are the target of a physical ranged attack.",
        "toggle": true,
        "target": "self",
        "desc": "You gain a +4 circumstance bonus to AC against the triggering attack. If the attack misses, you have deflected it. You cannot use this feat to deflect unusually massive ranged projectiles (such as boulders or ballista bolts).",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Deflect Arrows",
                "source": "Deflect Arrows"
            }
        ]
    },
    {
        "name": "Flying Kick",
        "actions": "2A",
        "traits": [
            "Monk"
        ],
        "target": "other",
        "desc": "You launch yourself at a foe. Make a Leap or attempt a High Jump or Long Jump. At the end of the jump, if you're adjacent to a foe, you can immediately Strike that foe with an unarmed attack, even if the foe is in mid-air. You fall to the ground after the Strike. If the distance you fall is no more than the height of your jump, you land upright and take no damage."
    },
    {
        "name": "Stand Still",
        "actions": "Reaction",
        "traits": [
            "Monk"
        ],
        "trigger": "A creature within your reach uses a move action or leaves a square during a move action it's using.",
        "target": "other",
        "desc": "You strike out when your foe tries to flee. Make a melee Strike against the triggering creature. If the attack is a critical hit and the trigger was a move action, you disrupt that action."
    },
    {
        "name": "Crane Flutter",
        "actions": "Reaction",
        "traits": [
            "Monk"
        ],
        "trigger": "You are targeted with a melee attack by an attacker you can see.",
        "toggle": true,
        "target": "self",
        "desc": "You interpose your arm between yourself and your opponent. Your circumstance bonus to AC from Crane Stance increases to +3 against the triggering attack. If the attack misses you, you can immediately make a crane wing Strike against the attacker at a -2 penalty, even if the attacker isn't within your reach.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Crane Flutter",
                "source": "Crane Flutter"
            }
        ]
    },
    {
        "name": "Dragon Roar",
        "actions": "1A",
        "traits": [
            "Auditory",
            "Emotion",
            "Fear",
            "Mental",
            "Monk"
        ],
        "requirements": "You are in Dragon Stance.",
        "target": "area",
        "desc": "You bellow, instilling fear in your enemies. Enemies within a 15-foot emanation must succeed at a Will save against your Intimidation DC or be frightened 1 (frightened 2 on a critical failure). When a creature frightened by the roar begins its turn adjacent to you, it can't reduce its frightened value below 1 on that turn. Your first attack that hits a frightened creature after you roar and before the end of your next turn gains a +4 circumstance bonus to damage.\n\nAfter you use Dragon Roar, you can't use it again for |dice=1d4| 1d4 rounds. Its effects end immediately if you leave Dragon Stance. Creatures in the area of your roar are then temporarily immune for 1 minute."
    },
    {
        "name": "Mountain Stronghold",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "requirements": "You are in Mountain Stance.",
        "target": "self",
        "desc": "You focus on your connection to the earth and call upon the mountain to block attacks against you. You gain a +2 circumstance bonus to AC until the beginning of your next turn.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Mountain Stronghold",
                "source": "Mountain Stronghold"
            }
        ]
    },
    {
        "name": "Tiger Slash",
        "actions": "2A",
        "traits": [
            "Monk"
        ],
        "requirements": "You are in Tiger Stance.",
        "target": "other",
        "desc": "You make a fierce swipe with both hands. Make a tiger claw Strike. It deals two extra weapon damage dice (three extra dice if you're 14th level or higher), and you can push the target 5 feet away as if you had successfully Shoved them. If the attack is a critical success and deals damage, add your Strength modifier to the persistent bleed damage from your tiger claw."
    },
    {
        "name": "Whirling Throw",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "requirements": "You have a creature grabbed or restrained.",
        "target": "other",
        "desc": "You propel your grabbed or restrained foe a great distance. You can throw the creature any distance up to 10 feet, plus 5 feet * your Strength modifier. If you successfully throw the creature, it takes bludgeoning damage equal to |dice=strmod B| your Strength modifier plus |dice=1d6 B| 1d6 per 10 feet you threw it.\n\nAttempt an Athletics check against the foe's Fortitude DC. You take a -2 circumstance penalty to your check if the target is one size larger than you and a -4 circumstance penalty if it's larger than that. You gain a +2 circumstance bonus to your check if the target is one size smaller than you and a +4 circumstance bonus if it's smaller than that.",
        "critsuccess": "You throw the creature the desired distance and it lands prone.",
        "success": "You throw the creature the desired distance.",
        "failure": "You don't throw the creature.",
        "critfailure": "You don't throw the creature, and it's no longer grabbed or restrained by you."
    },
    {
        "name": "Wolf Drag",
        "actions": "2A",
        "traits": [
            "Monk"
        ],
        "requirements": "You are in Wolf Stance.",
        "target": "other",
        "desc": "You rip your enemy off their feet. Make a wolf jaw Strike. Your wolf jaw gains the fatal d12 trait for this Strike, and if the attack succeeds, you knock the target prone."
    },
    {
        "name": "Ironblood Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored.",
        "toggle": true,
        "target": "self",
        "desc": "You enter the stance of impenetrable iron, refusing to yield to any blow. You can make iron sweep unarmed attacks. These deal 1d8 bludgeoning damage; are in the brawling group; and have the nonlethal, parry, sweep, and unarmed traits.\n\nWhile in Ironblood Stance, you gain resistance 2 to all damage. The resistance increases to 3 at 12th level, to 4 at 16th level, and to 5 at 20th level.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Ironblood Stance",
                "source": "Ironblood Stance"
            }
        ]
    },
    {
        "name": "Mixed Maneuver",
        "actions": "2A",
        "traits": [
            "Monk"
        ],
        "target": "other",
        "desc": "You combine two different maneuvers together into a single flowing whole. Choose any two of Grapple, Shove, and Trip. Attempt both of the attacks you chose against the same or different creatures, but don't apply the multiple attack penalty until after resolving both attacks."
    },
    {
        "name": "Tangled Forest Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "requirements": "You are unarmored.",
        "toggle": true,
        "target": "self",
        "desc": "You extend your arms like gnarled branches to interfere with your foes' movements. You can make lashing branch unarmed attacks. These deal 1d8 slashing damage; are in the brawling group; and have the agile, finesse, nonlethal, and unarmed traits.\n\nWhile you're in Tangled Forest Stance and can act, every enemy in your reach that tries to move away from you must succeed at a Reflex save, Acrobatics check, or Athletics check against your class DC or be immobilized for that action. If you prefer, you can allow the enemy to move.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Tangled Forest Stance",
                "source": "Tangled Forest Stance"
            }
        ]
    },
    {
        "name": "Wall Run",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "target": "self",
        "desc": "You defy gravity, traversing vertical planes as easily as the ground. Stride up to your Speed. You must start your movement on a horizontal surface. During this movement, you can run up vertical surfaces, like walls, at your full Speed. If you end the Stride off the ground, you fall after taking your next action or when your turn ends, whichever comes first (though you can Grab an Edge, if applicable). If you have Water Step or a similar ability, Wall Run lets you run along flimsy vertical surfaces, as well as vertical liquids, such as a waterfall."
    },
    {
        "name": "Knockback Strike",
        "actions": "2A",
        "traits": [
            "Monk"
        ],
        "target": "other",
        "desc": "You focus your strength into a blow powerful enough to push an enemy away from you. Make an unarmed Strike. If you hit, attempt an Athletics check to Shove the target. This attack uses the same multiple attack penalty as your Strike, and doesn't count toward your multiple attack penalty."
    },
    {
        "name": "Sleeper Hold",
        "actions": "1A",
        "traits": [
            "Incapacitation",
            "Monk"
        ],
        "requirements": "You have a creature grabbed or restrained.",
        "target": "other",
        "desc": "You pinch crucial points of your target's nervous system, impeding its ability to function. Attempt an Athletics check to Grapple the creature, with the following success and critical success effects instead of the usual effects.",
        "critsuccess": "The target falls unconscious for 1 minute, though it remains standing and doesn't drop what it holds.",
        "success": "The target is clumsy 1 until the end of its next turn."
    },
    {
        "name": "Winding Flow",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "frequency": "once per round",
        "cooldown": 5,
        "target": "self",
        "desc": "Any journey consists of more than simply reaching your destination. You use two of the following actions in any order: Stand, Step, and Stride. You can't use the same action twice."
    },
    {
        "name": "Disrupt Ki",
        "actions": "2A",
        "traits": [
            "Monk",
            "Negative"
        ],
        "target": "other",
        "desc": "Make an unarmed Strike. If it deals damage to a living creature, you block that creature's inner life force. The creature takes |dice=2d6 Persistent Negative| 2d6 persistent negative damage and is enfeebled 1 until the persistent damage ends. If you're 18th level or higher, this deals |dice=3d6 Persistent Negative| 3d6 persistent negative damage instead."
    },
    {
        "name": "Stance Savant (Monk)",
        "actions": "Free",
        "traits": [
            "Monk"
        ],
        "trigger": "You roll initiative.",
        "target": "self",
        "desc": "You enter a stance without a thought. Use an action that has the stance trait."
    },
    {
        "name": "Ironblood Surge",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "requirements": "You are in Ironblood Stance.",
        "target": "self",
        "desc": "You steel yourself, preparing to resist oncoming attacks and using your muscles to absorb the impact. You gain the benefits of your iron sweep's parry trait (a +1 circumstance bonus to AC until the start of your next turn) and your resistance from Ironblood Stance increases to your Strength modifier (if it's higher) for the same duration.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Ironblood Surge",
                "source": "Ironblood Surge"
            }
        ]
    },
    {
        "name": "Mountain Quake",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "requirements": "You are in Mountain Stance.",
        "target": "area",
        "desc": "You stomp, shaking the earth beneath you. Creatures on the ground within a 20-foot emanation take |dice=strmod| damage equal to your Strength modifier (minimum 0), which they can resist with a basic Fortitude save. On a failure, they also fall prone. After you use this action, you can't use it again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Tangled Forest Rake",
        "actions": "1A",
        "traits": [
            "Monk"
        ],
        "requirements": "You are in Tangled Forest Stance.",
        "target": "other",
        "desc": "You reposition foes with raking attacks. Make a lashing branch Strike. If you hit and deal damage, you force the target to move 5 feet into a space within your reach. This follows the forced movement rules."
    },
    {
        "name": "Master of Many Styles",
        "actions": "Free",
        "traits": [
            "Monk"
        ],
        "trigger": "Your turn begins.",
        "target": "self",
        "desc": "You move between stances in an unceasing dance. You use an action with the stance trait."
    },
    {
        "name": "Shattering Strike",
        "actions": "2A",
        "traits": [
            "Monk"
        ],
        "target": "other",
        "desc": "The force of your considered blow shatters objects and defenses alike. Make an unarmed Strike. It bypasses the target's resistances. If the target has Hardness, the Strike treats the Hardness as if it were half its value."
    },
    {
        "name": "Wild Winds Gust",
        "actions": "2A",
        "traits": [
            "Air",
            "Concentrate",
            "Evocation",
            "Manipulate",
            "Monk"
        ],
        "requirements": "You are in Wild Winds Stance.",
        "target": "other",
        "desc": "You store up energy and release it in an enormous gust of rushing wind. Make a wind crash Strike against each creature in your choice of a 30-foot cone or a 60 foot line. These attacks all count toward your multiple attack penalty, but the penalty doesn't increase until after you make all the attacks."
    },
    {
        "name": "Swift River",
        "actions": "Free",
        "inputRequired": "Ignore one status penalty to your speed, or remove one immobilized or slowed condition affecting you.",
        "traits": [
            "Monk"
        ],
        "trigger": "Your turn ends and you have a status penalty to your Speed or are immobilized or slowed.",
        "target": "self",
        "desc": "You flow like water, avoiding all restraints. End one status penalty to your speed, or end one immobilized or slowed condition affecting you."
    },
    {
        "name": "Impossible Technique",
        "actions": "Reaction",
        "traits": [
            "Fortune",
            "Monk"
        ],
        "requirements": "You are not armored or fatigued.",
        "trigger": "An enemy's attack hits you or you fail a saving throw against an enemy's ability.",
        "cooldown": 6000,
        "target": "other",
        "desc": "You execute a maneuver that defies possibility. If the triggering effect was an enemy's attack hitting you, the enemy rerolls the attack roll and uses the lower result. If the triggering effect was you failing a saving throw, you reroll the saving throw and use the higher result."
    },
    {
        "name": "Fused Stance",
        "actions": "1A",
        "traits": [
            "Monk",
            "Stance"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You have combined two stances into a single stance all your own. When you enter your fused stance, you gain all the effects of both stances, including the requirements and restrictions.\n\nYou can't fuse stances with fundamentally incompatible requirements or restrictions (such as Ironblood Stance and Crane Stance, which both require using only one type of Strike)."
    },
    {
        "name": "Hunt Prey",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Ranger"
        ],
        "toggle": true,
        "maxDuration": -2,
        "target": "other",
        "desc": "You designate a single creature as your prey and focus your attacks against that creature. You must be able to see or hear the prey, or you must be tracking the prey during exploration.\n\nYou gain a +2 circumstance bonus to Perception checks when you Seek your prey and a +2 circumstance bonus to Survival checks when you Track your prey. You also ignore the penalty for making ranged attacks within your second range increment against the prey you're hunting.\n\nYou can have only one creature designated as your prey at a time. If you use Hunt Prey against a creature when you already have a creature designated, the prior creature loses the designation and the new prey gains the designation. Your designation lasts until your next daily preparations.",
        "gainConditions": [
            {
                "duration": -2,
                "name": "Hunt Prey",
                "source": "Hunt Prey",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Bear Hug",
        "actions": "1A",
        "requirements": "The bear's last action was a successful claw Strike.",
        "target": "other",
        "desc": "The bear makes another claw Strike against the same target. If this Strike hits, the target is also grabbed, as if the bear had successfully Grappled the target."
    },
    {
        "name": "Support",
        "actions": "1A",
        "requirements": "The creature is an animal companion.",
        "target": "self",
        "desc": "Your animal companion supports you. You gain the benefits listed in the companion type's Support Benefit entry. If the animal uses the Support action, the only other actions it can use on this turn are basic move actions to get into position to take advantage of the Support benefits; if it has already used any other action this turn, it can't Support you."
    },
    {
        "name": "Orc Ferocity",
        "actions": "Reaction",
        "traits": [
            "Orc"
        ],
        "trigger": "You would be reduced to 0 Hit Points but not immediately killed.",
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "Fierceness in battle runs through your blood, and you refuse to fall from your injuries. You avoid being knocked out and remain at 1 Hit Point, and your wounded condition increases by 1.",
        "gainConditions": [
            {
                "addValue": 1,
                "name": "Wounded",
                "source": "Orc Ferocity"
            }
        ],
        "onceEffects": [
            {
                "affected": "HP",
                "value": "(-(Current_HP() - 1))"
            }
        ]
    },
    {
        "name": "Call on Ancient Blood: Fortitude",
        "actions": "Reaction",
        "trigger": "You attempt a saving throw against a magical effect, but you haven't rolled yet.",
        "target": "self",
        "desc": "Your ancestors' innate resistance to magic surges, before slowly ebbing down. You gain a +1 circumstance bonus to the triggering saving throw and until the end of this turn.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Call on Ancient Blood",
                "source": "Call on Ancient Blood"
            }
        ]
    },
    {
        "name": "Energy Emanation",
        "actions": "2A",
        "traits": [
            "Evocation",
            "Primal"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "area",
        "desc": "Energy bursts forth from your body. You deal |dice=var1| 1d6 damage of your chosen type to all adjacent creatures (basic Reflex save using your class DC or spell DC, whichever is higher). At 3rd level, and every 2 levels thereafter, this damage increases by 1d6.",
        "heightenedDescs": [
            {
                "level": 1,
                "descs": [
                    {
                        "value": "1d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 3,
                "descs": [
                    {
                        "value": "2d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 5,
                "descs": [
                    {
                        "value": "3d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 7,
                "descs": [
                    {
                        "value": "4d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 9,
                "descs": [
                    {
                        "value": "5d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 11,
                "descs": [
                    {
                        "value": "6d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 13,
                "descs": [
                    {
                        "value": "7d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 15,
                "descs": [
                    {
                        "value": "8d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 17,
                "descs": [
                    {
                        "value": "9d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 19,
                "descs": [
                    {
                        "value": "10d6",
                        "variable": "var1"
                    }
                ]
            }
        ]
    },
    {
        "name": "Battle Medicine",
        "actions": "1A",
        "traits": [
            "General",
            "Healing",
            "Manipulate",
            "Skill"
        ],
        "requirements": "You are holding or wearing healer's tools.",
        "target": "ally",
        "desc": "You can patch up yourself or an adjacent ally, even in combat. Attempt a Medicine check with the same DC as for Treat Wounds, and restore a corresponding amount of Hit Points; this does not remove the wounded condition. As with Treat Wounds, you can attempt checks against higher DCs if you have the minimum proficiency rank. The target is then temporarily immune to your Battle Medicine for 1 day."
    },
    {
        "name": "Eye of the Arclords",
        "actions": "1A",
        "traits": [
            "Uncommon",
            "General",
            "Skill"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "You open an incandescent third eye upon your forehead. The eye can remain open for 1 minute, and you can close it before then with a single action with the concentrate trait. It can remain open for 2 minutes if you're a master in Arcana, or 5 minutes if you're legendary. While the eye is open, you gain the following benefits: you gain the effects of the detect magic arcane innate spell from your Arcane Sense at the start of each of your turns without needing to cast the spell; you gain darkvision; you gain a +2 status bonus to Perception checks to Seek undetected and hidden creatures and to your Perception DC against Hide and Sneak. After your third eye closes, you are dazzled for an amount of time equal to how long you had it open.",
        "gainConditions": [
            {
                "activationPrerequisite": "Skill_Level('Arcana') < 6 ? 1 : 0",
                "duration": 100,
                "name": "Eye of the Arclords",
                "source": "Eye of the Arclords"
            },
            {
                "activationPrerequisite": "Skill_Level('Arcana') == 6 ? 1 : 0",
                "duration": 200,
                "name": "Eye of the Arclords",
                "source": "Eye of the Arclords"
            },
            {
                "activationPrerequisite": "Skill_Level('Arcana') > 6 ? 1 : 0",
                "duration": 500,
                "name": "Eye of the Arclords",
                "source": "Eye of the Arclords"
            }
        ]
    },
    {
        "name": "Juggle",
        "actions": "1A",
        "traits": [
            "Uncommon",
            "Concentrate",
            "General",
            "Manipulate",
            "Skill"
        ],
        "target": "self",
        "desc": "You can Juggle items and still use your hands between tosses. You can use the Juggle action in several ways.\n\nYou can start to Juggle with a single stored item, an item you were carrying, or an unattended item within your reach. The item must be of light or negligible Bulk. You Juggle the item until the end of your next turn, unless you use this feat against next turn to continue Juggling (see below). While you are Juggling, you can use this action again to add another item to the Juggle, which must meet all the same requirements. You can Juggle a number of items equal to one more than the number of hands you are using to Juggle.\n\nYou can also use this action to continue Juggling as long as you aren't fatigued. When you do, you continue to Juggle until the end of your next turn. If you do not continue Juggling by the end of your turn, you cease Juggling and you drop all the items. You become fatigued if you continue Juggling for more than 10 minutes (60 rounds) within the course of an hour.\n\nAs long as you're Juggling fewer than your maximum number of items, you have a free hand. You can wield weapons you are Juggling (but not shields or other items) as long as they can be wielded in one hand. For example, while you Juggle a dagger in one hand and wield a shield in the other, you are wielding the dagger but still have a free hand to Cast a Spell with a material component. Juggling two or more weapons with one hand doesn't allow you to use feats that require two weapons each held in a different hand."
    },
    {
        "name": "Kip Up",
        "actions": "Free",
        "traits": [
            "General",
            "Skill"
        ],
        "target": "self",
        "desc": "You stand up. This movement doesn't trigger reactions."
    },
    {
        "name": "Legendary Negotiation",
        "actions": "3A",
        "traits": [
            "General",
            "Skill"
        ],
        "target": "other",
        "desc": "You can negotiate incredibly quickly in adverse situations. You attempt to Make an Impression and then Request your opponent cease their current activity and engage in negotiations. You take a -5 penalty to your Diplomacy check. The GM sets the DC of the Request based on the circumstances - it's generally at least a very hard DC of the creature's level. Some creatures might simply refuse, and even those who agree to parley might ultimately find your arguments lacking and return to violence."
    },
    {
        "name": "Recognize Spell",
        "actions": "Reaction",
        "traits": [
            "General",
            "Secret",
            "Skill"
        ],
        "trigger": "A creature within line of sight casts a spell that you don't have prepared or in your spell repertoire, or a trap or similar object casts such a spell. You must be aware of the casting.",
        "target": "self",
        "desc": "If you are trained in the appropriate skill for the spell's tradition and it's a common spell of 2nd level or lower, you automatically identify it (you still roll to attempt to get a critical success, but can't get a worse result than success). The highest level of spell you automatically identify increases to 4 if you're an expert, 6 if you're a master, and 10 if you're legendary. The GM rolls a secret Arcana, Nature, Occultism, or Religion check, whichever corresponds to the tradition of the spell being cast. If you're not trained in the skill, you can't get a result better than failure.",
        "critsuccess": "You correctly recognize the spell and gain a +1 circumstance bonus to your saving throw or your AC against it.",
        "success": "You correctly recognize the spell.",
        "failure": "You fail to recognize the spell.",
        "critfailure": "You misidentify the spell as another spell entirely, of the GM's choice."
    },
    {
        "name": "Reveal Machinations",
        "actions": "1A",
        "traits": [
            "Rare",
            "General",
            "Skill"
        ],
        "target": "other",
        "desc": "You reveal that you played a minor but recurring role in another humanoid's life - or at least convince them that's the case. Attempt a Deception check against the target's Will DC. On a success, the revelation makes them frightened 2, and on a critical success they are frightened 3. In addition, you gain information about the subject as though you had attempted to Recall Knowledge about them using an appropriate skill and received the same result on your roll. You can't use this ability against the same humanoid again until 1 day has passed and you've also successfully disguised yourself as a different person."
    },
    {
        "name": "Sacred Defense",
        "actions": "1A",
        "inputRequired": "Add and remove the appropriate amount of temporary Hit Points after determining the success.",
        "traits": [
            "Divine",
            "General",
            "Skill"
        ],
        "frequency": "once per hour",
        "cooldown": 6000,
        "target": "self",
        "desc": "You call upon your deity to grant you their protective blessing. Attempt a DC 30 Religion check. If you have legendary proficiency in Religion, you can instead attempt a DC 40 Religion check to increase the temporary Hit Points you gain on a successful check to 15 (25 on a critical success).",
        "critsuccess": "You gain 10 temporary Hit Points. You lose any remaining temporary Hit Points after 1 minute.",
        "success": "You gain 5 temporary Hit Points. You lose any remaining temporary Hit Points after 1 minute.",
        "critfailure": "Your deity withholds their blessing. You cannot attempt to call to your deity again for 1 day."
    },
    {
        "name": "Sanctify Water",
        "actions": "1A",
        "traits": [
            "General",
            "Skill"
        ],
        "target": "object",
        "desc": "You imbue water with your deity's blessing. Choose a container of water on your person that is of light Bulk. For 1 round, if you or an ally throw this container at a foe, it has the damaging effects of holy water (if you follow a good deity) or unholy water (if you follow an evil deity). The water's transient power doesn't make it gain any value, allow it to be used to supply the cost for a spell or ritual, and so on. If you have legendary proficiency in Religion, you can sanctify three containers held by you or allies within your reach instead of one.\n\nPFS Note: When using Sanctify Water use your proficiency with simple weapons to determine your attack bonus when throwing the blessed container of water. If you give the container to another character for them to throw, they use their proficiency with improvised weapons instead."
    },
    {
        "name": "Scare to Death",
        "actions": "1A",
        "traits": [
            "Death",
            "Emotion",
            "Fear",
            "General",
            "Incapacitation",
            "Skill"
        ],
        "target": "other",
        "desc": "You can frighten foes so much, they might die. Attempt an Intimidation check against the Will DC of a living creature within 30 feet of you that you sense or observe and who can sense or observe you. If the target can't hear you or doesn't understand the language you are speaking, you take a -4 circumstance penalty. The creature is temporarily immune for 1 minute.",
        "critsuccess": "The target must succeed at a Fortitude save against your Intimidation DC or die. If the target succeeds at its save, it becomes frightened 2 and is fleeing for 1 round; it suffers no effect on a critical success.",
        "success": "The target becomes frightened 2.",
        "failure": "The target becomes frightened 1.",
        "critfailure": "The target is unaffected."
    },
    {
        "name": "Shield Block",
        "actions": "Reaction",
        "traits": [
            "General"
        ],
        "trigger": "While you have your shield raised, you would take damage from a physical attack.",
        "target": "self",
        "desc": "You snap your shield in place to ward off a blow. Your shield prevents you from taking an amount of damage up to the shield's Hardness. You and the shield each take any remaining damage, possibly breaking or destroying the shield.",
        "gainConditions": [
            {
                "activationPrerequisite": "(Shield() && Shield().name.includes('Force Shield')) ? 1 : 0",
                "duration": 1000,
                "name": "Shield Cooldown"
            }
        ]
    },
    {
        "name": "Sow Rumor",
        "actions": " ",
        "traits": [
            "Uncommon",
            "General",
            "Secret",
            "Skill"
        ],
        "target": "other",
        "desc": "You spread rumors, which may or may not be true, about a specific subject. If the subject of your rumor is not currently the subject of any contradictory rumors, this takes as long as it would normally take you to Gather Information (typically 2 hours), at the end of which the GM rolls a secret Deception check to see how well you spread the rumor. If your rumor matches any current rumors about the subject, it takes less time to spread the rumor, and if you are attempting to overtake a particularly popular and contradictory rumor, it takes much longer or may be impossible. The DC similarly increases or decreases depending on how plausible your rumor is.",
        "critsuccess": "Your rumor spreads like wildfire. Anyone who succeeds at a check to Gather Information on the specific subject learns your rumor in preference to other rumors about the subject. Your rumor persists for 1 month.",
        "success": "You successfully spread the rumor. Anyone who succeeds at a check to Gather Information on the specific subject adds your rumor to the list of rumors they could learn about the subject. Your rumor persists for 1 week.",
        "failure": "Your rumor dies off, never becoming popular enough for other people to learn it via Gather Information.",
        "critfailure": "You are unable to spread a rumor and take a -4 circumstance penalty to Deception checks to Sow Rumors about the same subject within the same region for 1 week. In addition, a rumor spreads about someone trying to spread false rumors about the subject."
    },
    {
        "name": "Train Animal",
        "actions": " ",
        "traits": [
            "Downtime",
            "General",
            "Manipulate",
            "Skill"
        ],
        "target": "minion",
        "desc": "You spend time teaching an animal to do a certain action. You can either select a basic action the animal already knows how to do (typically those listed in the Command an Animal action) or attempt to teach the animal a new basic action. The GM determines the DC of any check required and the amount of time the training takes (usually at least a week). It's usually impossible to teach an animal a trick that uses critical thinking. If you're expert, master, or legendary in Nature, you might be able to train more unusual creatures, at the GM's discretion.",
        "success": "The animal learns the action. If it was an action the animal already knew, you can Command the Animal to take that action without attempting a Nature check. If it was a new basic action, add that action to the actions the animal can take when Commanded, but you must still roll.",
        "failure": "The animal doesn't learn the trick."
    },
    {
        "name": "Trick Magic Item",
        "actions": "1A",
        "traits": [
            "General",
            "Manipulate",
            "Skill"
        ],
        "target": "object",
        "desc": "You examine a magic item you normally couldn't use in an effort to fool it and activate it temporarily. For example, this might allow a fighter to cast a spell from a wand or allow a wizard to cast a spell that's not on the arcane list using a scroll. You must know what activating the item does, or you can't attempt to trick it.\n\nAttempt a check using the skill matching the item's magic tradition, or matching a tradition that has the spell on its list, if you're trying to cast a spell from the item. The relevant skills are Arcana for arcane, Nature for primal, Occultism for occult, Religion for divine, or any of the four for an item that has the magical trait and not a tradition trait. The GM determines the DC based on the item's level (possibly adjusted depending on the item or situation).\n\nIf you activate a magic item that requires a spell attack roll or spell DC and you don't have the ability to cast spells of the relevant tradition, use your level as your proficiency bonus and the highest of your Intelligence, Wisdom, or Charisma modifiers. If you're a master in the appropriate skill for the item's tradition, you instead use the trained proficiency bonus, and if you're legendary, you instead use the expert proficiency bonus.",
        "success": "For the rest of the current turn, you can spend actions to activate the item as if you could normally use it.",
        "failure": "You can't use the item or try to trick it again this turn, but you can try again on subsequent turns.",
        "critfailure": "You can't use the item, and you can't try to trick it again until your next daily preparations."
    },
    {
        "name": "Battle Prayer",
        "actions": "1A",
        "traits": [
            "Divine",
            "General",
            "Skill"
        ],
        "target": "other",
        "desc": "Calling out to your deity, you recite scripture to harm a foe. Attempt a Religion check against the Will DC of a foe within 30 feet. The foe is then temporarily immune to Battle Prayers from your deity for 1 day.",
        "critsuccess": "You deal |dice=2d6| 2d6 damage of the chosen alignment type, or |dice=6d6| 6d6 damage if you have legendary proficiency in Religion.",
        "success": "You deal 1d6 damage of the chosen alignment type, or 3d6 damage if you have legendary proficiency in Religion.",
        "failure": "There is no effect.",
        "critfailure": "The backlash of your foe's will against your prayer prevents you from using Battle Prayer again for 10 minutes."
    },
    {
        "name": "Evangelize",
        "actions": "1A",
        "traits": [
            "Auditory",
            "General",
            "Linguistic",
            "Mental",
            "Skill"
        ],
        "target": "other",
        "desc": "You point out a detail that incontrovertibly supports your faith, causing a listener's mind to whirl. Attempt a Diplomacy check and compare the result to the Will DC of a single target that can hear you and understands your language; that target is then temporarily immune to Evangelize with respect to your deity or philosophy for 1 day. A creature that already agrees with you is unaffected, and at the GM's discretion, a target that genuinely changes its perspective to support your faith as a result of the argument is also otherwise unaffected.",
        "critsuccess": "The target is stupefied 2 for 1 round.",
        "success": "The target is stupefied 1 for 1 round.",
        "failure": "The target is unaffected."
    },
    {
        "name": "Familiar Focus",
        "actions": "2A Familiar activity",
        "traits": [
            "Concentrate"
        ],
        "cooldown": 144000,
        "target": "self",
        "desc": "Once per day, your familiar can use 2 actions with the concentrate trait to regain 1 Focus Point, up to your usual maximum. You must have a focus pool to select this.",
        "onceEffects": [
            {
                "affected": "Focus Points",
                "value": "1"
            }
        ]
    },
    {
        "name": "Lifelink",
        "actions": "Reaction",
        "inputRequired": "Take the damage instead of your familiar.",
        "traits": [
            "Concentrate"
        ],
        "target": "familiar",
        "desc": "If your familiar would be reduced to 0 HP by damage, as a reaction with the concentrate trait, you can take the damage. If you do, you take all the damage and your familiar takes none. However, if special effects when a hit damages your familiar (such as snake venom) still apply to your familiar."
    },
    {
        "name": "Chameleon Gnome",
        "actions": "1A",
        "toggle": true,
        "target": "self",
        "desc": "The color of your hair and skin is mutable, possibly due to latent magic. You can slowly change the vibrancy and the exact color, and the coloration can be different across your body, allowing you to create patterns or other colorful designs. It takes a single action for minor localized shifts and up to an hour for dramatic shifts throughout your body. While you're asleep, the colors shift on their own in tune with your dreams, giving you an unusual coloration each morning. When you're in an area where your coloration is roughly similar to the environment (for instance, forest green in a forest), you can use the single action to make minor localized shifts designed to help you blend into your surroundings. This grants you a +2 circumstance bonus to Stealth checks until your surroundings shift in coloration or pattern.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Chameleon Gnome",
                "source": "Chameleon Gnome"
            }
        ]
    },
    {
        "name": "Fey-Touched Gnome",
        "actions": "10 minutes",
        "inputRequired": "Select another cantrip in the spell selection menu.",
        "traits": [
            "Concentrate"
        ],
        "target": "self",
        "desc": "You can change the cantrip you gained from your heritage to a different one from the same list once per day by meditating to realign yourself with the First World."
    },
    {
        "name": "Resist Elf Magic",
        "actions": "Reaction",
        "trigger": "You attempt a saving throw against a magical effect but haven't rolled yet.",
        "toggle": true,
        "target": "self",
        "desc": "Your ancestral resistance to magic protects you. You gain a +1 circumstance bonus to the triggering saving throw. If the triggering effect is arcane, you gain a +2 circumstance bonus instead.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Resist Elf Magic",
                "source": "Resist Elf Magic"
            }
        ]
    },
    {
        "name": "Threatening Approach",
        "actions": "2A",
        "target": "other",
        "desc": "You Stride to be adjacent to a foe and Demoralize that foe. If you succeed, the foe is frightened 2 instead of frightened 1."
    },
    {
        "name": "Unseen Lizardfolk",
        "actions": "1A",
        "toggle": true,
        "target": "self",
        "desc": "You can change your skin color to blend in with your surroundings, making minor shifts with a single action and dramatic changes over the course of an hour. When you're in an area where your coloration is roughly similar to the environment (for instance, forest green in a forest), you can use the minor, singleaction application of this ability to make localized changes that help you blend into your surroundings, gaining a +2 circumstance bonus to Stealth checks until your surroundings change in coloration or pattern.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Unseen Lizardfolk",
                "source": "Unseen Lizardfolk"
            }
        ]
    },
    {
        "name": "Quick Alchemy",
        "actions": "1A",
        "inputRequired": "You can create items in the quick crafting area of the inventory.",
        "traits": [
            "Alchemist",
            "Manipulate"
        ],
        "requirements": "You have alchemist's tools, the formula for the alchemical item you're creating, and a free hand.",
        "cost": "1 batch of infused reagents",
        "target": "self",
        "desc": "You swiftly mix up a short-lived alchemical item to use at a moment's notice. You create a single alchemical item of your advanced alchemy level or lower that's in your formula book without having to spend the normal monetary cost in alchemical reagents or needing to attempt a Crafting check. This item has the infused trait, but it remains potent only until the start of your next turn."
    },
    {
        "name": "Mighty Rage",
        "actions": "Free",
        "traits": [
            "Barbarian"
        ],
        "trigger": "You use the Rage action on your turn.",
        "target": "self",
        "desc": "Use an action that has the rage trait. Alternatively, you can increase the actions of the triggering Rage to 2 to instead use a 2-action activity with the rage trait."
    },
    {
        "name": "Rage",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Emotion",
            "Mental"
        ],
        "requirements": "You aren't fatigued or raging.",
        "toggle": true,
        "cooldown": 100,
        "cooldownAfterEnd": true,
        "maxDuration": 100,
        "target": "self",
        "desc": "You tap into your inner fury and begin raging. You gain a number of temporary Hit Points equal to your level plus your Constitution modifier. This frenzy lasts for 1 minute, until there are no enemies you can perceive, or until you fall unconscious, whichever comes first. You can't voluntarily stop raging. While you are raging: \n\nYou deal 2 additional damage with melee weapons and unarmed attacks. This additional damage is halved if your weapon or unarmed attack is agile.\nYou take a -1 penalty to AC.\nYou can't use actions with the concentrate trait unless they also have the rage trait. You can Seek while raging.\n\nAfter you stop raging, you lose any remaining temporary Hit Points from Rage, and you can't Rage again for 1 minute.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Rage",
                "source": "Rage"
            }
        ]
    },
    {
        "name": "Attack of Opportunity",
        "actions": "Reaction",
        "trigger": "A creature within your reach uses a manipulate action or a move action, makes a ranged attack, or leaves a square during a move action it's using.",
        "target": "other",
        "desc": "You lash out at a foe that leaves an opening. Make a melee Strike against the triggering creature. If your attack is a critical hit and the trigger was a manipulate action, you disrupt that action. This Strike doesn't count toward your multiple attack penalty, and your multiple attack penalty doesn't apply to this Strike."
    },
    {
        "name": "Debilitating Strike",
        "actions": "Free",
        "traits": [
            "Rogue"
        ],
        "trigger": "Your Strike hits a flat-footed creature and deals damage.",
        "target": "other",
        "desc": "You apply one of the following debilitations, which lasts until the end of your next turn.\n\n<strong>Debilitation</strong> The target takes a -10-foot status penalty to its Speeds.\n<strong>Debilitation</strong> The target becomes enfeebled 1."
    },
    {
        "name": "Drain Bonded Item",
        "actions": "Free",
        "inputRequired": "You can restore an expended spell in the spells list using your bonded item's charge(s).",
        "traits": [
            "Arcane",
            "Wizard"
        ],
        "frequency": "once per day",
        "target": "self",
        "desc": "You expend the power stored in your bonded item. During your turn, you gain the ability to cast one spell you prepared today and already cast, without spending a spell slot. You must still Cast the Spell and meet the spell's other requirements."
    },
    {
        "name": "Drain Familiar",
        "actions": "Free",
        "inputRequired": "You can restore an expended spell in the spells list using your bonded item's charge(s).",
        "traits": [
            "Arcane",
            "Wizard"
        ],
        "frequency": "once per day",
        "target": "self",
        "desc": "You expend the power stored in your familiar. During your turn, you gain the ability to cast one spell you prepared today and already cast, without spending a spell slot. You must still Cast the Spell and meet the spell's other requirements."
    },
    {
        "name": "Halfling Luck",
        "actions": "Free",
        "traits": [
            "Fortune",
            "Halfling"
        ],
        "trigger": "You fail a skill check or saving throw.",
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "Your happy-go-lucky nature makes it seem like misfortune avoids you, and to an extent, that might even be true. You can reroll the triggering check, but you must use the new result, even if it's worse than your first roll."
    },
    {
        "name": "Halfling Luck (Guiding Luck)",
        "actions": "Free",
        "traits": [
            "Fortune",
            "Halfling"
        ],
        "trigger": "You fail a perception check or attack roll.",
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "Your luck guides you to look the right way and aim your blows unerringly. You can reroll the triggering check, but you must use the new result, even if it's worse than your first roll."
    },
    {
        "name": "Widen Spell",
        "actions": "1A",
        "traits": [
            "Druid",
            "Manipulate",
            "Metamagic",
            "Sorcerer",
            "Wizard"
        ],
        "target": "self",
        "desc": "You manipulate the energy of your spell, causing it to spread out and affect a wider area. If the next action you use is to Cast a Spell that has an area of a burst, cone, or line and does not have a duration, increase the area of that spell. Add 5 feet to the radius of a burst that normally has a radius of at least 10 feet (a burst with a smaller radius is not affected). Add 5 feet to the length of a cone or line that is normally 15 feet long or smaller, and add 10 feet to the length of a larger cone or line."
    },
    {
        "name": "Reach Spell",
        "actions": "1A",
        "traits": [
            "Bard",
            "Cleric",
            "Concentrate",
            "Druid",
            "Metamagic",
            "Sorcerer",
            "Wizard"
        ],
        "target": "self",
        "desc": "You can extend the range of your spells. If the next action you use is to Cast a Spell that has a range, increase that spell's range by 30 feet. As is standard for increasing spell ranges, if the spell normally has a range of touch, you extend its range to 30 feet."
    },
    {
        "name": "Black Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Acid",
            "Consumable",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of acid. The breath does |dice=4d6 Acid| 4d6 acid damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Copper Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Acid",
            "Consumable",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of acid. The breath does |dice=4d6 Acid| 4d6 acid damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Blue Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Electricity",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of electricity. The breath does |dice=4d6 Electricity| 4d6 electricity damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Bronze Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Electricity",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of electricity. The breath does |dice=4d6 Electricity| 4d6 electricity damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Brass Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of fire. The breath does |dice=4d6 Fire| 4d6 fire damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Green Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Evocation",
            "Magical",
            "Poison",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of poison. The breath does |dice=4d6 Poison| 4d6 poison damage, and each creature in the area must attempt a DC 23 basic Fortitude save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Gold Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of fire. The breath does |dice=4d6 Fire| 4d6 fire damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Red Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of fire. The breath does |dice=4d6 Fire| 4d6 fire damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Silver Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of cold. The breath does |dice=4d6 Cold| 4d6 cold damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "White Dragon's Breath Potion (Young)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of cold. The breath does |dice=4d6 Cold| 4d6 cold damage, and each creature in the area must attempt a DC 23 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Black Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Acid",
            "Consumable",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of acid. The breath does |dice=6d6 Acid| 6d6 acid damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Copper Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Acid",
            "Consumable",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "cooldown": 10,
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of acid. The breath does |dice=6d6 Acid| 6d6 acid damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Blue Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Electricity",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of electricity. The breath does |dice=6d6 Electricity| 6d6 electricity damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Bronze Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Electricity",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of electricity. The breath does |dice=6d6 Electricity| 6d6 electricity damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Brass Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of fire. The breath does |dice=6d6 Fire| 6d6 fire damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Green Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Evocation",
            "Magical",
            "Poison",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of poison. The breath does |dice=6d6 Poison| 6d6 poison damage, and each creature in the area must attempt a DC 29 basic Fortitude save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Gold Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of fire. The breath does |dice=6d6 Fire| 6d6 fire damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Red Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of fire. The breath does |dice=6d6 Fire| 6d6 fire damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Silver Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of cold. The breath does |dice=6d6 Cold| 6d6 cold damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "White Dragon's Breath Potion (Adult)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of cold. The breath does |dice=6d6 Cold| 6d6 cold damage, and each creature in the area must attempt a DC 29 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Black Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Acid",
            "Consumable",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of acid. The breath does |dice=10d6 Acid| 10d6 acid damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Copper Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Acid",
            "Consumable",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of acid. The breath does |dice=10d6 Acid| 10d6 acid damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Blue Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Electricity",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of electricity. The breath does |dice=10d6 Electricity| 10d6 electricity damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Bronze Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Electricity",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of electricity. The breath does |dice=10d6 Electricity| 10d6 electricity damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Brass Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 30-foot line of fire. The breath does |dice=10d6 Fire| 10d6 fire damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Green Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Evocation",
            "Magical",
            "Poison",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of poison. The breath does |dice=10d6 Poison| poison damage, and each creature in the area must attempt a DC 37 basic Fortitude save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Gold Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of fire. The breath does |dice=10d6 Fire| 10d6 fire damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Red Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of fire. The breath does |dice=10d6 Fire| 10d6 fire damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Silver Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of cold. The breath does |dice=10d6 Cold| 10d6 cold damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "White Dragon's Breath Potion (Wyrm)",
        "actions": "1A",
        "inputRequired": "After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "traits": [
            "Consumable",
            "Fire",
            "Evocation",
            "Magical",
            "Potion"
        ],
        "target": "self",
        "desc": "You unleash dragon's breath in a 15-foot cone of cold. The breath does |dice=10d6 Cold| 10d6 cold damage, and each creature in the area must attempt a DC 37 basic Reflex save. After you use the breath weapon, you can't do so again for |dice=1d4| 1d4 rounds."
    },
    {
        "name": "Energy Mutagen (Acid, Greater)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Acid",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=2d6 Acid| 2d6 acid damage for every full 10 minutes of duration remaining (DC 25 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Acid, Greater)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Cold, Greater)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Cold",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=2d6 Cold| 2d6 cold damage for every full 10 minutes of duration remaining (DC 25 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Cold, Greater)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Electricity, Greater)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Electricity",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=2d6 Electricity| 2d6 electricity damage for every full 10 minutes of duration remaining (DC 25 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Electricity, Greater)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Fire, Greater)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Fire",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=2d6 Fire| 2d6 fire damage for every full 10 minutes of duration remaining (DC 25 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Fire, Greater)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Acid, Major)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Acid",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=3d6 Acid| 3d6 acid damage for every full 10 minutes of duration remaining (DC 32 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Acid, Major)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Cold, Major)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Cold",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=3d6 Cold| 3d6 cold damage for every full 10 minutes of duration remaining (DC 32 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Cold, Major)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Electricity, Major)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Electricity",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=3d6 Electricity| 3d6 electricity damage for every full 10 minutes of duration remaining (DC 32 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Electricity, Major)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Energy Mutagen (Fire, Major)",
        "actions": "Free",
        "traits": [
            "Consumable",
            "Fire",
            "Mutagen",
            "Polymorph"
        ],
        "target": "area",
        "desc": "You end the benefits of the Energy Mutagen, unleashing a 30-foot cone of energy that deals |dice=3d6 Fire| 3d6 fire damage for every full 10 minutes of duration remaining (DC 32 basic Reflex save).",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Energy Mutagen Discharge",
                "source": "Energy Mutagen (Fire, Major)",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Double Slice",
        "actions": "2A",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are wielding two melee weapons, each in a different hand.",
        "target": "other",
        "desc": "You lash out at your foe with both weapons. Make two Strikes, one with each of your two melee weapons, each using your current multiple attack penalty. Both Strikes must have the same target. If the second Strike is made with a weapon that doesn't have the agile trait, it takes a -2 penalty.\n\nIf both attacks hit, combine their damage, and then add any other applicable effects from both weapons. You add any precision damage only once, to the attack of your choice. Combine the damage from both Strikes and apply resistances and weaknesses only once. This counts as two attacks when calculating your multiple attack penalty."
    },
    {
        "name": "Everstand Stance",
        "actions": "1A",
        "traits": [
            "Uncommon",
            "Champion",
            "Fighter",
            "Stance"
        ],
        "requirements": "You are wielding a shield.",
        "toggle": true,
        "target": "self",
        "desc": "You brace your shield with both hands, enhancing its potential for both offense and defense. When in this stance, you wield the shield with both hands. When wielding a shield this way, increase the weapon damage die of the shield's boss or spikes by one step, and increase the shield's Hardness by 2 when using the Shield Block reaction.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Everstand Stance",
                "source": "Everstand Stance"
            }
        ]
    },
    {
        "name": "Exacting Strike",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "target": "other",
        "desc": "You make a controlled attack, fully accounting for your momentum. Make a Strike. The Strike gains the following failure effect.",
        "failure": "This attack does not count toward your multiple attack penalty."
    },
    {
        "name": "Point-Blank Shot",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Open",
            "Stance"
        ],
        "requirements": "You are wielding a ranged weapon.",
        "toggle": true,
        "target": "self",
        "desc": "You take aim to pick off nearby enemies quickly. When using a ranged volley weapon while you are in this stance, you don't take the penalty to your attack rolls from the volley trait. When using a ranged weapon that doesn't have the volley trait, you gain a +2 circumstance bonus to damage rolls on attacks against targets within the weapon's first range increment.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Point-Blank Shot",
                "source": "Point-Blank Shot"
            }
        ]
    },
    {
        "name": "Power Attack",
        "actions": "2A",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "target": "other",
        "desc": "You unleash a particularly powerful attack that clobbers your foe but leaves you a bit unsteady. Make a melee Strike. This counts as two attacks when calculating your multiple attack penalty. If this Strike hits, you deal an extra die of weapon damage. If you're at least 10th level, increase this to two extra dice, and if you're at least 18th level, increase it to three extra dice."
    },
    {
        "name": "Reactive Shield",
        "actions": "Reaction",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are wielding a shield.",
        "trigger": "An enemy hits you with a melee Strike.",
        "target": "self",
        "desc": "You can snap your shield into place just as you would take a blow, avoiding the hit at the last second. You immediately use the Raise a Shield action and gain your shield's bonus to AC. The circumstance bonus from the shield applies to your AC when you're determining the outcome of the triggering attack.",
        "onceEffects": [
            {
                "affected": "Raise Shield",
                "value": "1"
            }
        ]
    },
    {
        "name": "Snagging Strike",
        "actions": "1A",
        "traits": [
            "Fighter"
        ],
        "requirements": "You have one hand free, and your target is within reach of that hand.",
        "target": "other",
        "desc": "You combine an attack with quick grappling moves to throw an enemy off balance as long as it stays in your reach. Make a Strike while keeping one hand free. If this Strike hits, the target is flat-footed until the start of your next turn or until it's no longer within the reach of your hand, whichever comes first."
    },
    {
        "name": "Sudden Charge",
        "actions": "2A",
        "traits": [
            "Barbarian",
            "Fighter",
            "Flourish",
            "Open"
        ],
        "target": "other",
        "desc": "With a quick sprint, you dash up to your foe and swing. Stride twice. If you end your movement within melee reach of at least one enemy, you can make a melee Strike against that enemy. You can use Sudden Charge while Burrowing, Climbing, Flying, or Swimming instead of Striding if you have the corresponding movement type."
    },
    {
        "name": "Aggressive Block",
        "actions": "Free",
        "traits": [
            "Fighter"
        ],
        "trigger": "You use the Shield Block reaction, and the opponent that triggered Shield Block is adjacent to you and is your size or smaller.",
        "target": "other",
        "desc": "You push back as you block the attack, knocking your foe away or off balance. You use your shield to push the triggering creature, either automatically Shoving it 5 feet or causing it to become flat-footed until the start of your next turn. The triggering creature chooses whether to be moved or become flat-footed. If it chooses to be moved, you choose the direction. If the Shove would cause it to hit a solid object, enter a square of difficult terrain, or enter another creature's space, it must become flat-footed instead of being moved."
    },
    {
        "name": "Assisting Shot",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You are wielding a ranged weapon.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "With a quick shot, you interfere with a foe in combat. Make a Strike with a ranged weapon. If the Strike hits, the next creature other than you to attack the same target before the start of your next turn gains a +1 circumstance bonus to their roll, or a +2 circumstance bonus if your Strike was a critical hit.",
        "targetNumbers": [
            {
                "number": -1
            }
        ],
        "gainConditions": [
            {
                "duration": 10,
                "name": "Assisting Shot (Originator)",
                "source": "Assisting Shot",
                "targetFilter": "caster"
            },
            {
                "copyChoiceFrom": "Assisting Shot (Originator)",
                "duration": 10,
                "name": "Assisting Shot",
                "source": "Assisting Shot",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Brutish Shove",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You are wielding a two-handed melee weapon.",
        "target": "other",
        "desc": "Throwing your weight behind your attack, you hit your opponent hard enough to make it stumble back. Make a Strike with a two-handed melee weapon. If you hit a target that is your size or smaller, that creature is flat-footed until the end of your current turn, and you can automatically Shove it, with the same benefits as the Shove action (including the critical success effect, if your Strike was a critical hit). If you move to follow the target, your movement doesn't trigger reactions.\n\nThis Strike has the following failure effect.",
        "failure": "The target becomes flat-footed until the end of your current turn."
    },
    {
        "name": "Combat Grab",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You have one hand free, and your target is within reach of that hand.",
        "target": "other",
        "desc": "You swipe at your opponent and grab at them. Make a melee Strike while keeping one hand free. If the Strike hits, you grab the target using your free hand. The creature remains grabbed until the end of your next turn or until it Escapes, whichever comes first."
    },
    {
        "name": "Dueling Parry",
        "actions": "1A",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are wielding only a single one-handed melee weapon and have your other hand or hands free.",
        "target": "self",
        "desc": "You can parry attacks against you with your one-handed weapon. You gain a +2 circumstance bonus to AC until the start of your next turn as long as you continue to meet the requirements.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Dueling Parry",
                "source": "Dueling Parry"
            }
        ]
    },
    {
        "name": "Intimidating Strike",
        "actions": "2A",
        "traits": [
            "Emotion",
            "Fear",
            "Fighter",
            "Mental"
        ],
        "target": "other",
        "desc": "Your blow not only wounds creatures but also shatters their confidence. Make a melee Strike. If you hit and deal damage, the target is frightened 1, or frightened 2 on a critical hit."
    },
    {
        "name": "Lunge",
        "actions": "1A",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are wielding a melee weapon.",
        "target": "other",
        "desc": "Extending your body to its limits, you attack an enemy that would normally be beyond your reach. Make a Strike with a melee weapon, increasing your reach by 5 feet for that Strike. If the weapon has the disarm, shove, or trip trait, you can use the corresponding action instead of a Strike."
    },
    {
        "name": "Double Shot",
        "actions": "2A",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "requirements": "You are wielding a ranged weapon with reload 0.",
        "target": "other",
        "desc": "You shoot twice in blindingly fast succession. Make two Strikes, each against a separate target and with a -2 penalty. Both attacks count toward your multiple attack penalty, but the penalty doesn't increase until after you've made both of them."
    },
    {
        "name": "Dual-Handed Assault",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "requirements": "You are wielding a one-handed melee weapon and have a free hand.",
        "target": "other",
        "desc": "You snap your free hand over to grip your weapon just long enough to add momentum and deliver a more powerful blow to your opponent. Make a Strike with the required weapon. You quickly switch your grip during the Strike in order to make the attack with two hands. If the weapon doesn't normally have the two-hand trait, increase its weapon damage die by one step for this attack. (Rules on increasing die size appear on page 279.) If the weapon has the two-hand trait, you gain the benefit of that trait and a circumstance bonus to damage equal to the weapon's number of damage dice. When the Strike is complete, you resume gripping the weapon with only one hand. This action doesn't end any stance or fighter feat effect that requires you to have one hand free."
    },
    {
        "name": "Everstand Strike",
        "actions": "1A",
        "inputRequired": "If the Strike hits and deals damage, you also Raise your Shield.",
        "traits": [
            "Uncommon",
            "Champion",
            "Fighter",
            "Press"
        ],
        "requirements": "You are wielding a shield in two hands.",
        "target": "other",
        "desc": "Your follow-up blow leaves you an opening to set your shield. Make a Strike with the wielded shield. If the Strike hits and deals damage, you also Raise your Shield."
    },
    {
        "name": "Knockdown",
        "actions": "2A",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "target": "other",
        "desc": "You make an attack to knock a foe off balance, then follow up immediately with a sweep to topple them. Make a melee Strike. If it hits and deals damage, you can attempt an Athletics check to Trip the creature you hit. If you're wielding a two-handed melee weapon, you can ignore Trip's requirement that you have a hand free. Both attacks count toward your multiple attack penalty, but the penalty doesn't increase until after you've made both of them."
    },
    {
        "name": "Quick Reversal",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Flourish",
            "Press"
        ],
        "requirements": "You are flanked by at least two enemies.",
        "target": "other",
        "desc": "You turn your foes' flanking against them with a quick reverse. Make a melee Strike against one of the flanking enemies and make a second Strike with the same weapon or unarmed attack against a different enemy that is flanking you. This second Strike has the same multiple attack penalty of the initial attack and doesn't count toward your multiple attack penalty."
    },
    {
        "name": "Swipe",
        "actions": "2A",
        "traits": [
            "Barbarian",
            "Fighter",
            "Flourish"
        ],
        "target": "other",
        "desc": "You make a wide, arcing swing. Make a single melee Strike and compare the attack roll result to the ACs of up to two foes, each of whom must be within your melee reach and adjacent to the other. Roll damage only once and apply it to each creature you hit. A Swipe counts as two attacks for your multiple attack penalty. If you're using a weapon with the sweep trait, its modifier applies to all your Swipe attacks."
    },
    {
        "name": "Twin Parry",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Ranger"
        ],
        "requirements": "You are wielding two melee weapons, one in each hand.",
        "target": "self",
        "desc": "You use your two weapons to parry attacks. You gain a +1 circumstance bonus to AC until the start of your next turn, or a +2 circumstance bonus if either weapon has the parry trait. You lose this circumstance bonus if you no longer meet this feat's requirement.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Twin Parry",
                "source": "Twin Parry"
            }
        ]
    },
    {
        "name": "Advantageous Assault",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "target": "self",
        "desc": "When an enemy's movement is compromised, you deliver a more deadly blow. Make a Strike against a creature that is grabbed, prone, or restrained. You gain a circumstance bonus to damage on this Strike equal to the number of weapon damage dice, or that number + 2 if you're wielding the weapon in two hands. The Strike gains the following failure effect.",
        "failure": "You deal damage to the target equal to the number of weapon damage dice, or that number + 2 if you're wielding the weapon in two hands. This damage has the same damage type as the weapon."
    },
    {
        "name": "Disarming Stance",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "requirements": "You are wielding only a single one-handed melee weapon and have your other hand or hands free.",
        "toggle": true,
        "target": "self",
        "desc": "You adopt a fencing stance that improves your control over your weapon. While you are in this stance, you gain a +1 circumstance bonus to Athletics checks to Disarm and a +2 circumstance bonus to your Reflex DC when defending against checks to Disarm you. In addition, you can attempt to Disarm creatures up to two sizes larger than you.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Disarming Stance",
                "source": "Disarming Stance"
            }
        ]
    },
    {
        "name": "Guardian's Deflection",
        "actions": "Reaction",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are wielding a single one-handed melee weapon and have your other hand or hands free.",
        "trigger": "An ally within your melee reach is hit by an attack, you can see the attacker, and the ally gaining a +2 circumstance bonus to AC would turn the critical hit into a hit or the hit into a miss.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "You use your weapon to deflect the attack against your ally, granting a +2 circumstance bonus to their Armor Class against the triggering attack. This turns the triggering critical hit into a hit, or the triggering hit into a miss.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Guardian's Deflection (Originator)",
                "source": "Guardian's Deflection",
                "targetFilter": "caster"
            },
            {
                "duration": 1,
                "name": "Guardian's Deflection",
                "source": "Guardian's Deflection",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Revealing Stab",
        "actions": "2A",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are wielding a melee weapon that deals piercing damage.",
        "target": "other",
        "desc": "You drive your piercing weapon into an imperceptible foe, revealing its location to your allies. Make a Strike with the required melee weapon. You don't have to attempt a flat check to hit a concealed creature, and you have to succeed at only a DC 5 flat check to target a hidden creature. If you hit and deal damage, you can drive the required weapon into a corporeal target, revealing its current position. You Release the weapon, and it becomes lodged in the target. If the target is concealed, other creatures don't need to succeed at a flat check to hit it. If the target is hidden, other creatures have to succeed at only a DC 5 flat check to target it. The creatures need to be able to see your weapon to gain any of these benefits, and the target can't become undetected to anyone who sees your weapon. If the target is invisible, the weapon remains visible while lodged in it.\n\nThis benefit lasts until the weapon is removed from the creature. An adjacent creature or the target can remove the weapon with 2 Interact actions."
    },
    {
        "name": "Shatter Defenses",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "A frightened creature is in your melee reach.",
        "target": "other",
        "desc": "Your offense exploits your enemy's fear. Make a melee Strike against a frightened creature. If you hit and deal damage, the target becomes flat-footed until its frightened condition ends. If the target was already flat-footed to you when you damaged it with this Strike, it can't reduce its frightened value below 1 until the start of your next turn."
    },
    {
        "name": "Dueling Riposte",
        "actions": "Reaction",
        "traits": [
            "Fighter"
        ],
        "requirements": "You are benefiting from Dueling Parry.",
        "trigger": "A creature within your reach critically fails a Strike against you.",
        "target": "other",
        "desc": "You riposte against your flailing enemy. Make a melee Strike against or attempt to Disarm the triggering creature."
    },
    {
        "name": "Felling Strike",
        "actions": "2A",
        "traits": [
            "Fighter"
        ],
        "target": "other",
        "desc": "Your attack can ground an airborne foe. Make a Strike. If it hits and deals damage to a flying target, the target falls up to 120 feet. The fall is gradual enough that if it causes the target to hit the ground, the target takes no damage from the fall. If the attack is a critical hit, the target can't Fly, Leap, levitate, or otherwise leave the ground until the end of your next turn."
    },
    {
        "name": "Impassable Wall Stance",
        "actions": "1A",
        "traits": [
            "Uncommon",
            "Champion",
            "Fighter"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You refuse to let foes past your guard. As long as you are in this stance, when you critically hit with an Attack of Opportunity triggered by a move action, you disrupt that move action.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Impassable Wall Stance",
                "source": "Impassable Wall Stance"
            }
        ]
    },
    {
        "name": "Incredible Aim",
        "actions": "2A",
        "traits": [
            "Concentrate",
            "Fighter"
        ],
        "target": "self",
        "desc": "By spending a moment to focus, you can ensure your attack strikes true. Make a ranged weapon Strike. On this Strike, you gain a +2 circumstance bonus to the attack roll and ignore the target's concealed condition."
    },
    {
        "name": "Mobile Shot Stance",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "toggle": true,
        "target": "self",
        "desc": "Your shots become nimble and deadly. While you're in this stance, your ranged Strikes don't trigger Attacks of Opportunity or other reactions that are triggered by a ranged attack. If you have Attack of Opportunity, you can use it with a loaded ranged weapon you're wielding. The triggering creature must be within 5 feet of you for you to do so.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Mobile Shot Stance",
                "source": "Mobile Shot Stance"
            }
        ]
    },
    {
        "name": "Positioning Assault",
        "actions": "2A",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "requirements": "You are wielding a two-handed melee weapon and your target is within your reach.",
        "target": "other",
        "desc": "With punishing blows, you force your opponent into position. Make a Strike with the required weapon. If you hit, you move the target 5 feet into a space in your reach. This follows the forced movement rules."
    },
    {
        "name": "Sudden Leap",
        "actions": "2A",
        "traits": [
            "Barbarian",
            "Fighter"
        ],
        "target": "other",
        "desc": "You make an impressive leap and swing while you soar. Make a Leap, High Jump, or Long Jump and attempt one melee Strike at any point during your jump. Immediately after the Strike, you fall to the ground if you're in the air, even if you haven't reached the maximum distance of your jump. If the distance you fall is no more than the height of your jump, you take no damage and land upright.\n\nWhen attempting a High Jump or Long Jump during a Sudden Leap, determine the DC using the Long Jump DCs, and increase your maximum distance to double your Speed.",
        "specialdesc": "If you have Felling Strike, you can spend 3 actions to make a Sudden Leap and use Felling Strike instead of a normal Strike."
    },
    {
        "name": "Certain Strike",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "target": "other",
        "desc": "Even when you don't hit squarely, you can still score a glancing blow. Make a melee Strike. It gains the following failure effect.",
        "failure": "Your attack deals any damage it would have dealt on a hit, excluding all damage dice. (This removes damage dice from weapon runes, spells, and special abilities, in addition to weapon damage dice.)"
    },
    {
        "name": "Debilitating Shot",
        "actions": "2A",
        "traits": [
            "Fighter",
            "Flourish"
        ],
        "target": "other",
        "desc": "Aiming for a weak point, you impede your foe with a precise shot. Make a ranged weapon Strike. If it hits and deals damage, the target is slowed 1 until the end of its next turn."
    },
    {
        "name": "Disarming Twist",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You are wielding only a single one-handed melee weapon and have your other hand or hands free.",
        "target": "other",
        "desc": "After your initial attack redirects your foe's defenses, your follow-up wrests their weapon from their grasp. Make a melee Strike with the required weapon. In addition to its other effects, this Strike gains the success and critical success effects of the Disarm action. The Strike also has the following failure effect.",
        "failure": "The target is flat-footed until the end of your current turn."
    },
    {
        "name": "Disruptive Stance",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "toggle": true,
        "target": "self",
        "desc": "The slightest distraction can provoke your wrath, and you're prepared to foil enemies' actions. As long as you are in this stance, you can use Attack of Opportunity when a creature within your reach uses a concentrate action, in addition to manipulate and move actions. Furthermore, you disrupt a triggering concentrate or manipulate action if your Strike hits (not only if it's a critical hit).",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Disruptive Stance",
                "source": "Disruptive Stance"
            }
        ]
    },
    {
        "name": "Mirror Shield",
        "actions": "Reaction",
        "traits": [
            "Fighter"
        ],
        "requirements": "You have a shield raised.",
        "trigger": "An opponent casting a spell that targets you critically fails a spell attack roll against your AC.",
        "target": "other",
        "desc": "You reflect the spell back against the triggering opponent. Make a ranged attack against the triggering creature using your highest proficiency with a ranged weapon. If you can cast spells, you can make a spell attack roll instead. If you succeed, your opponent takes the effects of a successful spell attack roll for their own spell (or the effects of a critical success if your attack roll was a critical success)."
    },
    {
        "name": "Twin Riposte",
        "actions": "Reaction",
        "traits": [
            "Fighter",
            "Ranger"
        ],
        "requirements": "You are benefiting from Twin Parry.",
        "trigger": "A creature within your reach critically fails a Strike against you.",
        "target": "other",
        "desc": "A clever parry with one weapon leaves your opponent open to an attack with the other weapon. Make a melee Strike or use a Disarm action against the triggering opponent."
    },
    {
        "name": "Brutal Finish",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You are wielding a melee weapon in two hands.",
        "target": "other",
        "desc": "Your final blow can make an impact even if it rebounds off a foe's defenses. Make a Strike with the required weapon. After the Strike, your turn ends. The Strike deals one extra weapon damage die, or two extra weapon damage dice if you're at least 18th level. The Strike also gains the following failure effect.",
        "failure": "You deal damage equal to one weapon damage die of the required weapon. Increase this to two dice if you're at least 18th level."
    },
    {
        "name": "Dueling Dance",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "requirements": "You are wielding only a single one-handed melee weapon and have your other hand or hands free.",
        "toggle": true,
        "target": "self",
        "desc": "Using your free hand as pivot and balance, you both attack and defend with your weapon. While you are in this stance, you constantly have the benefits of Dueling Parry.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Dueling Parry",
                "source": "Dueling Dance"
            }
        ]
    },
    {
        "name": "Incredible Ricochet",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Fighter",
            "Press"
        ],
        "target": "other",
        "desc": "After your first shot singles out your opponent's position, you direct another that ricochets around obstacles and strikes unerringly. Make a ranged weapon Strike against a creature you previously attacked this turn. You ignore the target's concealed condition and all cover."
    },
    {
        "name": "Lunging Stance",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "requirements": "You are wielding a melee weapon.",
        "toggle": true,
        "target": "self",
        "desc": "Your body coiled to strike, you can lash out at distant enemies. While you are in this stance, you can use Attack of Opportunity against a creature that is outside your reach but within the reach you would have with a Lunge. If you do, you increase your range with the Strike by 5 feet.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Lunging Stance",
                "source": "Lunging Stance"
            }
        ]
    },
    {
        "name": "Paragon's Guard",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "toggle": true,
        "target": "self",
        "desc": "Once you've had a moment to set your stance, you always have your shield ready without a thought. While you are in this stance, you constantly have your shield raised as if you'd used the Raise a Shield action, as long as you meet that action's requirements.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Paragon's Guard",
                "source": "Paragon's Guard"
            }
        ],
        "onceEffects": [
            {
                "affected": "Raise Shield",
                "value": "1"
            }
        ]
    },
    {
        "name": "Spring Attack",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You are adjacent to an enemy.",
        "target": "other",
        "desc": "Springing away from one foe, you Strike at another. Stride up to your Speed, but you must end that movement within melee reach of a different enemy. At the end of your movement, make a melee Strike against an enemy now within reach. You can use Spring Attack while Burrowing, Climbing, Flying, or Swimming instead of Striding if you have the corresponding movement type."
    },
    {
        "name": "Desperate Finisher",
        "actions": "Reaction",
        "traits": [
            "Fighter"
        ],
        "requirements": "You meet the requirements to use an action with the press trait.",
        "trigger": "You complete the last action on your turn, and your turn has not ended yet.",
        "target": "other",
        "desc": "You throw everything into one last press. Use a single action that you know with the press trait as part of Desperate Finisher. You forgo the ability to use reactions until the start of your next turn."
    },
    {
        "name": "Determination",
        "actions": "1A",
        "inputRequired": "Remove one condition or counteract one spell that is affecting you.",
        "traits": [
            "Concentrate",
            "Fighter"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "Your training allows you to shrug off your foes' spells and conditions when the need is dire. Choose a single nonpermanent spell or condition that is affecting you. If you chose a condition, its effect on you ends. If you chose a spell, attempt to counteract the spell (your counteract level is equal to half your level, rounded up, and you attempt a Will save as your counteract check).\n\nThis doesn't remove any Hit Point damage normally dealt by the spell or condition, and it doesn't prevent the spell or debilitating effect from affecting other allies or the environment around you. It can't remove an ongoing affliction or prevent such an affliction from inflicting conditions on you later. It can't remove conditions from the situation (such as prone or flanked). If the effect comes from a creature, hazard, or item of 20th level or higher, Determination can't remove its effect on you."
    },
    {
        "name": "Guiding Finish",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Press"
        ],
        "requirements": "You are wielding only a single one-handed melee weapon and have your other hand or hands free.",
        "target": "other",
        "desc": "Using your weapon as a lever, you force your opponent to end up right where you want them. Make a Strike with the required weapon. If the Strike hits, you can move the target up to 10 feet into a space in your reach. You can move the target through your space during this movement. This follows the forced movement rules. Your Strike gains the following failure effect.",
        "failure": "You can force the creature to move as you would on a success, but you can move the target only 5 feet."
    },
    {
        "name": "Stance Savant (Fighter)",
        "actions": "Free",
        "traits": [
            "Fighter"
        ],
        "trigger": "You roll initiative.",
        "target": "self",
        "desc": "When there's imminent danger, you drop into a stance with a mere thought. Use an action that has the stance trait."
    },
    {
        "name": "Two-Weapon Flurry",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Flourish",
            "Press"
        ],
        "requirements": "You are wielding two weapons, each in a different hand.",
        "target": "other",
        "desc": "You lash out with both your weapons in a sudden frenzy. Strike twice, once with each weapon."
    },
    {
        "name": "Whirlwind Strike",
        "actions": "3A",
        "traits": [
            "Barbarian",
            "Fighter",
            "Flourish",
            "Open"
        ],
        "target": "other",
        "desc": "You attack all nearby adversaries. Make a melee Strike against each enemy within your melee reach. Each attack counts toward your multiple attack penalty, but do not increase your penalty until you have made all your attacks."
    },
    {
        "name": "Graceful Poise",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "toggle": true,
        "target": "self",
        "desc": "With the right positioning, your off-hand weapon can strike like a scorpion's stinger. While you are in this stance, if you make your second Strike from Double Slice with an agile weapon, Double Slice counts as one attack when calculating your multiple attack penalty.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Graceful Poise",
                "source": "Graceful Poise"
            }
        ]
    },
    {
        "name": "Multishot Stance",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "requirements": "You are wielding a ranged weapon with reload 0.",
        "toggle": true,
        "target": "self",
        "desc": "You lock yourself in a stable position so you can fire swiftly and accurately. While you are in this stance, your penalty for Double Shot is reduced to -1, or -2 if you add the extra action to make three Strikes. If you move from your position, this stance ends.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Multishot Stance",
                "source": "Multishot Stance"
            }
        ]
    },
    {
        "name": "Twinned Defense",
        "actions": "1A",
        "traits": [
            "Fighter",
            "Stance"
        ],
        "requirements": "You are wielding two melee weapons, one in each hand.",
        "toggle": true,
        "target": "self",
        "desc": "You're always ready to use your off-hand weapon to interfere with attacks against you. While you are in this stance, you constantly gain the benefits of the Twin Parry action.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Twin Parry",
                "source": "Twinned Defense"
            }
        ]
    },
    {
        "name": "Impossible Volley (Fighter)",
        "actions": "3A",
        "traits": [
            "Fighter",
            "Flourish",
            "Open",
            "Ranger"
        ],
        "requirements": "You are wielding a ranged weapon with the volley trait and reload 0.",
        "target": "self",
        "desc": "You fire a volley at all foes in an area. Make one Strike with a -2 penalty against each enemy within a 10-foot-radius burst centered at or beyond your weapon's volley range. Roll the damage only once for all targets.\n\nEach attack counts toward your multiple attack penalty, but do not increase your penalty until you have made all your attacks.",
        "specialdesc": "When taken as a Fighter feat, this feat has the Flourish and Open traits."
    },
    {
        "name": "Master Strike",
        "actions": "Free",
        "traits": [
            "Incapacitation",
            "Rogue"
        ],
        "trigger": "Your Strike hits a flat-footed creature and deals damage.",
        "target": "other",
        "desc": "The target attempts a Fortitude save at your class DC. It then becomes temporarily immune to your Master Strike for 1 day.",
        "critsuccess": "The target is unaffected.",
        "success": "The target is enfeebled 2 until the end of your next turn.",
        "failure": "The target is paralyzed for 4 rounds.",
        "critfailure": "The target is paralyzed for 4 rounds, knocked unconscious for 2 hours, or killed (your choice)."
    },
    {
        "name": "Hunted Shot",
        "actions": "1A",
        "traits": [
            "Flourish",
            "Ranger"
        ],
        "requirements": "You are wielding a ranged weapon with reload 0.",
        "frequency": "once per round",
        "target": "other",
        "desc": "You take two quick shots against the one you hunt. Make two Strikes against your prey with the required weapon. If both hit the same creature, combine their damage for the purpose of resistances and weaknesses. Apply your multiple attack penalty to each Strike normally."
    },
    {
        "name": "Twin Takedown",
        "actions": "1A",
        "traits": [
            "Flourish",
            "Ranger"
        ],
        "requirements": "You are wielding two melee weapons, each in a different hand.",
        "frequency": "once per round",
        "target": "other",
        "desc": "You swiftly attack your hunted prey with both weapons. Make two Strikes against your hunted prey, one with each of the required weapons. If both hit the same hunted prey, combine their damage for the purpose of its resistances and weaknesses. Apply your multiple attack penalty to each Strike normally."
    },
    {
        "name": "Hunter's Aim",
        "actions": "2A",
        "traits": [
            "Concentrate",
            "Ranger"
        ],
        "target": "other",
        "desc": "When you focus on aiming, your attack becomes particularly accurate. Make a ranged weapon Strike against your hunted prey. On this Strike, you gain a +2 circumstance bonus to the attack roll and ignore your prey's concealed condition."
    },
    {
        "name": "Quick Draw",
        "actions": "1A",
        "traits": [
            "Ranger",
            "Rogue"
        ],
        "target": "other",
        "desc": "You draw your weapon and attack with the same motion. You Interact to draw a weapon, then Strike with that weapon."
    },
    {
        "name": "Relentless Stalker",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Move",
            "Ranger"
        ],
        "trigger": "An adjacent creature you are hunting attempts to move away from you using an action that has the move trait.",
        "target": "other",
        "desc": "Your hunted prey cannot escape your relentless pursuit. Stride up to your Speed in tandem with the triggering creature, remaining adjacent to the foe throughout its movement until it stops moving or you run out of movement. You can ignore difficult terrain during this movement unless the difficult terrain is caused by a magical effect."
    },
    {
        "name": "Disrupt Prey",
        "actions": "Reaction",
        "traits": [
            "Ranger"
        ],
        "trigger": "Your hunted prey is within your reach, and it uses a manipulate action, uses a move action, or leaves a square during a move action it's using.",
        "target": "other",
        "desc": "Make a melee Strike against your prey. If the attack is a critical hit, you disrupt the triggering action."
    },
    {
        "name": "Running Reload",
        "actions": "1A",
        "traits": [
            "Ranger"
        ],
        "target": "other",
        "desc": "You can reload your weapon on the move. You Stride, Step, or Sneak, then Interact to reload."
    },
    {
        "name": "Scout's Warning",
        "actions": "Free",
        "traits": [
            "Ranger",
            "Rogue"
        ],
        "trigger": "You are about to roll a Perception or Survival check for initiative.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "You visually or audibly warn your allies of danger, granting them each a +1 circumstance bonus to their initiative rolls. Depending on whether you use gestures or call out, this action gains either the visual or auditory trait, respectively.",
        "targetNumbers": [
            {
                "number": -1
            }
        ],
        "gainConditions": [
            {
                "duration": 1,
                "name": "Scout's Warning (Originator)",
                "source": "Scout's Warning",
                "targetFilter": "caster"
            },
            {
                "duration": 1,
                "name": "Scout's Warning",
                "source": "Scout's Warning",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Skirmish Strike",
        "actions": "1A",
        "traits": [
            "Flourish",
            "Ranger",
            "Rogue"
        ],
        "target": "other",
        "desc": "Your feet and weapon move in tandem. Either Step and then Strike, or Strike and then Step."
    },
    {
        "name": "Deadly Aim",
        "actions": "1A",
        "traits": [
            "Open",
            "Ranger"
        ],
        "target": "other",
        "desc": "You aim for your prey's weak spots, making your shot more challenging but dealing more damage if you hit. Make a ranged Strike against your hunted prey at a -2 penalty. You gain a +4 circumstance bonus to damage on that Strike. This bonus increases to +6 at 11th level and +8 at 15th level."
    },
    {
        "name": "Terrain Master",
        "actions": "1 hour",
        "traits": [
            "Ranger"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You adapt to your surroundings in any natural terrain. You can spend 1 hour practicing in your current terrain in order to make it your favored terrain, replacing your current favored terrain temporarily. If you spend a full day out of the new favored terrain, your favored terrain reverts back to your original choice when you took the Favored Terrain feat.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Terrain Master",
                "source": "Terrain Master"
            }
        ]
    },
    {
        "name": "Warden's Boon",
        "actions": "1A",
        "traits": [
            "Ranger"
        ],
        "durationDependsOnTarget": true,
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "By pointing out vulnerabilities, you grant the benefits listed in Hunt Prey and your hunter's edge benefit to an ally until the end of their next turn. Depending on whether you call out or use gestures, this action gains either the auditory or visual trait.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Warden's Boon (Originator)",
                "source": "Warden's Boon",
                "targetFilter": "caster"
            },
            {
                "copyChoiceFrom": "Warden's Boon (Originator)",
                "duration": 10,
                "name": "Warden's Boon",
                "source": "Warden's Boon",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Penetrating Shot",
        "actions": "2A",
        "traits": [
            "Open",
            "Ranger"
        ],
        "requirements": "You are wielding a ranged weapon.",
        "target": "other",
        "desc": "You shoot clear through an intervening creature to hit your prey. Choose a target that is giving lesser cover to your hunted prey. Make a single ranged Strike with the required weapon against the chosen target and your hunted prey. This attack ignores any lesser cover the chosen target provides your hunted prey. Roll damage only once, and apply it to each creature you hit. A Penetrating Shot counts as two attacks for your multiple attack penalty."
    },
    {
        "name": "Second Sting",
        "actions": "1A",
        "traits": [
            "Press",
            "Ranger"
        ],
        "requirements": "You are wielding two melee weapons, each in a different hand.",
        "target": "other",
        "desc": "You read your prey's movements and transform them into openings, so failures with one weapon set up glancing blows with the other. Make a melee Strike with one of the required weapons against your hunted prey. The Strike gains the following failure effect.",
        "failure": "You deal the damage the other required weapon would have dealt on a hit, excluding all damage dice. (This removes dice from weapon runes, spells, and special abilities, not just weapon damage dice.)"
    },
    {
        "name": "Sense the Unseen",
        "actions": "Reaction",
        "traits": [
            "Ranger",
            "Rogue"
        ],
        "trigger": "You fail a check to Seek.",
        "target": "other",
        "desc": "When you look for foes, you can catch even the slightest cues, such as their minute movements or the shifting of air currents on your skin. Even though you failed at the triggering check, you automatically sense any undetected creatures in the area where you're Seeking, making them merely hidden to you."
    },
    {
        "name": "Targeting Shot",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Press",
            "Ranger"
        ],
        "target": "other",
        "desc": "You carefully track your prey's position and defenses, allowing you to follow up around obstacles that block your shot. Make a ranged weapon Strike against your hunted prey. You ignore the target's concealed condition and all cover."
    },
    {
        "name": "Impossible Flurry",
        "actions": "3A",
        "traits": [
            "Flourish",
            "Open",
            "Ranger"
        ],
        "requirements": "You are wielding two melee weapons, each in a different hand.",
        "target": "other",
        "desc": "You forgo precision to attack at an impossible speed. Make three melee Strikes with each of the required weapons. All of these Strikes take the maximum multiple attack penalty, as if you had already made two or more attacks this turn."
    },
    {
        "name": "Impossible Volley",
        "actions": "3A",
        "traits": [
            "Ranger"
        ],
        "requirements": "You are wielding a ranged weapon with the volley trait and reload 0.",
        "target": "other",
        "desc": "You fire a volley at all foes in an area. Make one Strike with a -2 penalty against each enemy within a 10-foot-radius burst centered at or beyond your weapon's volley range. Roll the damage only once for all targets.\n\nEach attack counts toward your multiple attack penalty, but do not increase your penalty until you have made all your attacks."
    },
    {
        "name": "Hunt Prey: Flurry",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Ranger"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You've learned every possible edge to use against your foes. When you use Hunt Prey, you gain the flurry hunter's edge benefit instead of the one you selected at 1st level. Your multiple attack penalty for attacks against your hunted prey is -3 (-2 with an agile weapon) on your second attack of the turn instead of -5, and -6 (-4 with an agile weapon) on your third or subsequent attack of the turn, instead of -10. You don't gain the additional benefit from masterful hunter.\n\nYou designate a single creature as your prey and focus your attacks against that creature. You must be able to see or hear the prey, or you must be tracking the prey during exploration.\n\nYou gain a +2 circumstance bonus to Perception checks when you Seek your prey and a +2 circumstance bonus to Survival checks when you Track your prey. You also ignore the penalty for making ranged attacks within your second range increment against the prey you're hunting.\n\nYou can have only one creature designated as your prey at a time. If you use Hunt Prey against a creature when you already have a creature designated, the prior creature loses the designation and the new prey gains the designation. Your designation lasts until your next daily preparations.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Hunt Prey: Flurry",
                "source": "Hunt Prey: Flurry"
            }
        ]
    },
    {
        "name": "Hunt Prey: Outwit",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Ranger"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You've learned every possible edge to use against your foes. When you use Hunt Prey, you gain the outwit hunter's edge benefit instead of the one you selected at 1st level. You gain a +2 circumstance bonus to Deception checks, Intimidation checks, Stealth checks, and any checks to Recall Knowledge about the prey, and a +1 circumstance bonus to AC against your prey's attacks. You don't gain the additional benefit from masterful hunter.\n\nYou designate a single creature as your prey and focus your attacks against that creature. You must be able to see or hear the prey, or you must be tracking the prey during exploration.\n\nYou gain a +2 circumstance bonus to Perception checks when you Seek your prey and a +2 circumstance bonus to Survival checks when you Track your prey. You also ignore the penalty for making ranged attacks within your second range increment against the prey you're hunting.\n\nYou can have only one creature designated as your prey at a time. If you use Hunt Prey against a creature when you already have a creature designated, the prior creature loses the designation and the new prey gains the designation. Your designation lasts until your next daily preparations.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Hunt Prey: Outwit",
                "source": "Hunt Prey: Outwit"
            }
        ]
    },
    {
        "name": "Hunt Prey: Precision",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Ranger"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You've learned every possible edge to use against your foes. When you use Hunt Prey, you gain the precision hunter's edge benefit instead of the one you selected at 1st level. The first time you hit your hunted prey in a round, you also deal |dice=1d8 Precision| 1d8 additional precision damage. (Precision damage increases the damage you already deal, using the same type, but is ineffective against creatures that lack vital organs or weak points.) At 11th level, the extra damage increases to |dice=2d8 Precision| 2d8 precision damage, and at 19th level, the extra damage increases to |dice=3d8 Precision| 3d8 precision damage. You don't gain the additional benefit from masterful hunter.\n\nYou designate a single creature as your prey and focus your attacks against that creature. You must be able to see or hear the prey, or you must be tracking the prey during exploration.\n\nYou gain a +2 circumstance bonus to Perception checks when you Seek your prey and a +2 circumstance bonus to Survival checks when you Track your prey. You also ignore the penalty for making ranged attacks within your second range increment against the prey you're hunting.\n\nYou can have only one creature designated as your prey at a time. If you use Hunt Prey against a creature when you already have a creature designated, the prior creature loses the designation and the new prey gains the designation. Your designation lasts until your next daily preparations.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Hunt Prey: Precision",
                "source": "Hunt Prey: Precision"
            }
        ]
    },
    {
        "name": "Perfect Shot",
        "actions": "3A",
        "traits": [
            "Flourish",
            "Ranger"
        ],
        "requirements": "You are wielding a loaded ranged weapon with reload 1 or more, and you have not reloaded your weapon since your last turn.",
        "target": "other",
        "desc": "After watching the motions of combat with incredible intensity and precision, you fire at your prey at the perfect moment to deliver maximum pain. Make a ranged Strike with the required weapon against your hunted prey. If you hit, the Strike deals maximum damage. After the Strike, your turn ends."
    },
    {
        "name": "Badger Rage",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Emotion",
            "Mental"
        ],
        "requirements": "The badger isn't fatigued or raging.",
        "toggle": true,
        "cooldown": 100,
        "cooldownAfterEnd": true,
        "maxDuration": 100,
        "target": "self",
        "desc": "The badger enters a state of pure rage that lasts for 1 minute, until there are no enemies it can perceive, or until it falls unconscious, whichever comes first. It can't voluntarily stop raging. While raging, the badger is affected in the following ways.\n\nIt deals 4 additional damage with its bite attacks and 2 additional damage with its claw attacks.\nIt takes a -1 penalty to AC.\nIt can't use actions that have the concentrate trait unless they also have the rage trait. The animal companion can Seek even while raging.\n\nAfter it has stopped raging, it can't use Badger Rage again for 1 minute.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Badger Rage",
                "source": "Badger Rage"
            }
        ]
    },
    {
        "name": "Flyby Attack",
        "actions": "2A",
        "target": "other",
        "desc": "The bird Flies and makes a talon Strike at any point along the way."
    },
    {
        "name": "Sand Stride",
        "actions": "2A",
        "traits": [
            "Move"
        ],
        "target": "self",
        "desc": "The camel Strides twice with a +5-foot circumstance bonus to Speed, ignoring difficult terrain caused by rubble, sand, and uneven ground made of earth and stone."
    },
    {
        "name": "Cat Pounce",
        "actions": "1A",
        "traits": [
            "Flourish"
        ],
        "target": "other",
        "desc": "The cat Strides and then Strikes. If it was undetected at the start of its Cat Pounce, it remains undetected until after the attack."
    },
    {
        "name": "Tongue Pull",
        "actions": "1A",
        "traits": [
            "Attack"
        ],
        "target": "other",
        "desc": "The cave gecko snaps out its tongue, attempting to pull a foe within 10 feet toward it. The gecko attempts an Athletics check against the foe's Fortitude DC. On a success, the cave gecko pulls the foe next to it. This movement is forced movement. On a critical success, the foe is also grabbed until the beginning of your next turn."
    },
    {
        "name": "Pterosaur Swoop",
        "actions": "1A",
        "target": "other",
        "desc": "The pterosaur Flies up to its Speed and makes one beak Strike at any point during that movement."
    },
    {
        "name": "Darting Attack",
        "actions": "1A",
        "traits": [
            "Flourish"
        ],
        "target": "other",
        "desc": "The raptor Steps up to 10 feet and then Strikes, or Strikes and then Steps up to 10 feet."
    },
    {
        "name": "Gallop",
        "actions": "1A",
        "traits": [
            "Move"
        ],
        "target": "self",
        "desc": "The horse Strides twice at a +10-foot circumstance bonus to Speed."
    },
    {
        "name": "Gnaw",
        "actions": "1A",
        "traits": [
            "Move"
        ],
        "requirements": "The animal companion's last action was a successful jaws Strike.",
        "target": "other",
        "desc": "The Strike's target takes |dice=1d6 Persistent Bleed| 1d6 persistent bleed damage and takes a -10-foot status penalty to its Speed until it removes the bleed damage. If the hyena is a specialized animal companion, the persistent bleed damage increases to |dice=2d6 Persistent Bleed| 2d6."
    },
    {
        "name": "Lurching Rush",
        "actions": "2A",
        "target": "other",
        "desc": "The monitor lizard Strides and then makes a jaws Strike. If it moved at least 20 feet away from its starting position, it gains a +2 circumstance bonus to this attack roll."
    },
    {
        "name": "Constrict",
        "actions": "1A",
        "requirements": "The snake has a smaller creature grabbed.",
        "target": "other",
        "desc": "The snake deals 12 bludgeoning damage to the grabbed creature; the creature must attempt a basic Fortitude save. If the snake is a specialized animal companion, increase this damage to 20."
    },
    {
        "name": "Feast on the Fallen",
        "actions": "Reaction",
        "inputRequired": "Restore 18 Hit Points to the vulture, or 30 if the vulture is a specialized animal companion.",
        "traits": [
            "Healing",
            "Manipulate"
        ],
        "trigger": "A creature adjacent to the vulture is reduced to 0 Hit Points",
        "frequency": "once per hour",
        "cooldown": 144000,
        "target": "other",
        "desc": "The vulture consumes a piece of the defeated foe, regaining 18 Hit Points. If the vulture is a specialized animal companion, increase the Hit Points regained to 30."
    },
    {
        "name": "Knockdown (Wolf)",
        "actions": "1A",
        "requirements": "The animal companion's last action was a successful jaws Strike.",
        "target": "other",
        "desc": "The wolf automatically knocks the target of its jaws Strike prone."
    },
    {
        "name": "Counterspell (Prepared)",
        "actions": "Reaction",
        "inputRequired": "Use the triggering spell as a counterspell in your spell list.",
        "traits": [
            "Abjuration",
            "Arcane",
            "Wizard"
        ],
        "trigger": "A creature Casts a Spell that you have prepared.",
        "target": "other",
        "desc": "When a foe Casts a Spell and you can see its manifestations, you can use your own magic to disrupt it. You expend a prepared spell to counter the triggering creature's casting of that same spell. You lose your spell slot as if you had cast the triggering spell. You then attempt to counteract the triggering spell."
    },
    {
        "name": "Conceal Spell",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Manipulate",
            "Metamagic"
        ],
        "target": "self",
        "desc": "Hiding your gestures and incantations within other speech and movement, you attempt to conceal the fact that you are Casting a Spell. If the next action you use is to Cast a Spell, attempt a Stealth check against one or more observers' Perception DCs; if the spell has verbal components, you must also attempt a Deception check against the observers' Perception DC. If you succeed at your check (or checks) against an observer's DC, that observer doesn't notice you're casting a spell, even though material, somatic, and verbal components are usually noticeable and spells normally have sensory manifestations that would make spellcasting obvious to those nearby.\n\nThis ability hides only the spell's spellcasting actions and manifestations, not its effects, so an observer might still see a ray streak out from you or see you vanish into thin air."
    },
    {
        "name": "Bespell Weapon",
        "actions": "Free",
        "traits": [
            "Sorcerer",
            "Wizard"
        ],
        "requirements": "Your most recent action was to cast a non-cantrip spell.",
        "frequency": "once per turn",
        "cooldown": 10,
        "target": "self",
        "desc": "You siphon the residual energy from the last spell you cast into one weapon you're wielding. Until the end of your turn, the weapon deals an extra |dice=1d6| 1d6 damage of a type depending on the school of the spell you just cast.\n\n<strong>Abjuration</strong> force damage\n<strong>Conjuration or Transmutation</strong> the same type as the weapon\n<strong>Divination, Enchantment, or Illusion</strong> mental damage\n<strong>Evocation</strong> a type the spell dealt, or force damage if the spell didn't deal damage\n<strong>Necromancy</strong> negative damage",
        "gainConditions": [
            {
                "duration": 5,
                "name": "Bespell Weapon",
                "source": "Bespell Weapon"
            }
        ]
    },
    {
        "name": "Silent Spell",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Metamagic",
            "Wizard"
        ],
        "target": "self",
        "desc": "You've learned how to cast many of your spells without speaking the words of power you would normally need to provide. If the next action you use is Casting a Spell that has a verbal component and at least one other component, you can remove the verbal component. This makes the spell quieter and allows you to cast it in areas where sound can't carry. However, the spell still has visual manifestations, so this doesn't make the spell any less obvious to someone who sees you casting it. When you use Silent Spell, you can choose to gain the benefits of Conceal Spell, and you don't need to attempt a Deception check because the spell has no verbal components."
    },
    {
        "name": "Bond Conservation",
        "actions": "1A",
        "inputRequired": "Activate Bond Conservation after restoring the first spell. You can then freely restore one expended spell until the end of your next turn. Choose a spell 2 or more levels lower than the first spell cast with Drain Bonded Item.",
        "traits": [
            "Manipulate",
            "Metamagic",
            "Wizard"
        ],
        "requirements": "The last action you used was Drain Bonded Item.",
        "target": "self",
        "desc": "By carefully manipulating the arcane energies stored in your bonded item as you drain it, you can conserve just enough power to cast another, slightly weaker spell. If the next action you use is to Cast a Spell using the energy from Drain Bonded Item, you gain an extra use of Drain Bonded Item. You must use this extra use of Drain Bonded Item before the end of your next turn or you lose it, and you can use this additional use only to cast a spell 2 or more levels lower than the first spell cast with Drain Bonded Item.",
        "gainConditions": [
            {
                "duration": 15,
                "name": "Bond Conservation",
                "source": "Bond Conservation"
            }
        ]
    },
    {
        "name": "Overwhelming Energy",
        "actions": "1A",
        "traits": [
            "Druid",
            "Manipulate",
            "Metamagic",
            "Sorcerer",
            "Wizard"
        ],
        "target": "self",
        "desc": "You alter your spells to overcome resistances. If the next action you use is to Cast a Spell, the spell ignores an amount of the target's resistance to acid, cold, electricity, fire, or sonic damage equal to your level. This applies to all damage the spell deals, including persistent damage and damage caused by an ongoing effect of the spell, such as the wall created by wall of fire. A creature's immunities are unaffected."
    },
    {
        "name": "Quickened Casting",
        "actions": "Free",
        "traits": [
            "Bard",
            "Concentrate",
            "Metamagic",
            "Sorcerer",
            "Wizard"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "If your next action is to cast a cantrip of the class that gave you Quickened Casting or a spell that is at least 2 levels lower than the highest level spell of that class, reduce the number of actions to cast it by 1 (minimum 1 action).",
        "specialdesc": "This can only be used on a cantrip or spell from the class matching the one you gained this feat from."
    },
    {
        "name": "Magic Sense",
        "actions": "Free",
        "traits": [
            "Detection",
            "Divination",
            "Sorcerer",
            "Wizard"
        ],
        "trigger": "Your turn begins or ends.",
        "toggle": true,
        "target": "self",
        "desc": "You have a literal sixth sense for ambient magic in your vicinity. You can sense the presence of magic auras as though you were always using a 1st-level detect magic spell. This detects magic in your field of vision only. When you Seek, you gain the benefits of a 3rd-level detect magic spell on things you see (in addition to the normal benefits of Seeking). You can turn this sense off and on with a free action at the start or the end of your turn.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Magic Sense",
                "source": "Magic Sense"
            }
        ],
        "castSpells": [
            {
                "_className": "SpellCast",
                "level": 1,
                "name": "Detect Magic"
            },
            {
                "_className": "SpellCast",
                "level": 3,
                "name": "Detect Magic"
            }
        ]
    },
    {
        "name": "Effortless Concentration",
        "actions": "Free",
        "traits": [
            "Bard",
            "Druid",
            "Sorcerer",
            "Wizard"
        ],
        "trigger": "Your turn begins.",
        "target": "self",
        "desc": "You maintain a spell with hardly a thought. You immediately gain the effects of the Sustain a Spell action, allowing you to extend the duration of one of your active class spells."
    },
    {
        "name": "Spell Tinker",
        "actions": "2A",
        "inputRequired": "For spells where the chosen effect makes a mechanical difference, you can change the effect selection on the condition or select the alternative condition from the conditions menu and set the duration appropriately before removing the original condition.",
        "traits": [
            "Concentrate",
            "Wizard"
        ],
        "target": "self",
        "desc": "You've learned to alter choices you make when casting spells on yourself. After casting a spell on only yourself that offers several choices of effect (such as resist energy, spell immunity, or a polymorph spell that offers several potential forms), you can alter the choice you made when Casting the Spell (for instance, choosing a different type of damage for resist energy). However, your tinkering weakens the spell's integrity, reducing its remaining duration by half.\n\nYou can't use this feat if the benefits of the spell have already been used up or if the effects of the first choice would persist in any way after switching (for instance, if one of the choices was to create a consumable item you already used, or to heal you), or if the feat would create an effect more powerful than that offered by the base spell. The GM is the final arbiter of what Spell Tinker can be applied to."
    },
    {
        "name": "Nimble Dodge",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "requirements": "You are not encumbered.",
        "trigger": "A creature targets you with an attack and you can see the attacker.",
        "toggle": true,
        "target": "self",
        "desc": "You deftly dodge out of the way, gaining a +2 circumstance bonus to AC against the triggering attack.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Nimble Dodge",
                "source": "Nimble Dodge"
            }
        ]
    },
    {
        "name": "Twin Feint",
        "actions": "2A",
        "traits": [
            "Rogue"
        ],
        "requirements": "You are wielding two melee weapons, each in a different hand.",
        "target": "other",
        "desc": "You make a dazzling series of attacks with both weapons, using the first attack to throw your foe offguard against a second attack at a different angle. Make one Strike with each of your two melee weapons, both against the same target. The target is automatically flat-footed against the second attack. Apply your multiple attack penalty to the Strikes normally."
    },
    {
        "name": "You're Next",
        "actions": "Reaction",
        "traits": [
            "Emotion",
            "Fear",
            "Mental",
            "Rogue"
        ],
        "trigger": "You reduce an enemy to 0 hit points.",
        "target": "other",
        "desc": "After downing a foe, you menacingly remind another foe that you're coming after them next. Attempt an Intimidation check with a +2 circumstance bonus to Demoralize a single creature that you can see and that can see you. If you have legendary proficiency in Intimidation, you can use this as a free action with the same trigger."
    },
    {
        "name": "Battle Assessment",
        "actions": "1A",
        "traits": [
            "Rogue",
            "Secret"
        ],
        "target": "other",
        "desc": "With careful observation during battle, you identify an enemy's strengths and weaknesses. The GM rolls a secret Perception check for you against the Deception or Stealth DC (whichever is higher) of an enemy of your choice who is not concealed from you, hidden from you, or undetected by you, and who is engaged in combat. The GM might apply a penalty for the distance between you and the enemy. The enemy is then temporarily immune to your Battle Assessment for 1 day.",
        "critsuccess": "The GM chooses two of the following pieces of information about the enemy to tell you: which of the enemy's weaknesses is highest, which of the enemy's saving throws has the lowest modifier, one immunity the enemy has, or which of the enemy's resistances is highest. If the event of a tie, the GM should pick one at random.",
        "success": "The GM chooses one piece of information from the above list to tell you about the enemy.",
        "critfailure": "The GM gives you false information (the GM makes up the information)."
    },
    {
        "name": "Poison Weapon",
        "actions": "1A",
        "inputRequired": "Apply the poison to the weapon normally.",
        "traits": [
            "Manipulate",
            "Rogue"
        ],
        "requirements": "You are wielding a piercing or slashing weapon.",
        "target": "object",
        "desc": "You apply a poison to the required weapon; if you're not holding a poison and have a free hand, you can Interact to draw a poison as part of this action. If your next attack with that weapon before the end of your next turn hits and deals damage, it applies the effects of the poison, provided that poison can be delivered by contact or injury. If you critically fail the attack roll, the poison is wasted as normal."
    },
    {
        "name": "Reactive Pursuit",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "trigger": "An adjacent foe moves away from you, and you can reach at least one space adjacent to the foe with a Stride action.",
        "target": "other",
        "desc": "You keep pace with a retreating foe. You Stride, but you must end your movement adjacent to the triggering enemy. Your move does not trigger reactions from the triggering enemy. You can use Reactive Pursuit to Burrow, Climb, Fly, or Swim instead of Stride if you have the corresponding movement type."
    },
    {
        "name": "Sabotage",
        "actions": "1A",
        "traits": [
            "Incapacitation",
            "Rogue"
        ],
        "requirements": "You have a free hand.",
        "target": "other",
        "desc": "You subtly damage others' equipment. Choose one item that a creature within your reach wields or carries. The item must have moving parts that you could possibly sabotage (a shortbow could be sabotaged, but a longsword could not). Attempt a Thievery check against the Reflex DC of the creature. Damage dealt by Sabotage can't take the item below its Break Threshold.",
        "critsuccess": "You deal damage equal to four times your Thievery proficiency bonus.",
        "success": "You deal damage equal to double your Thievery proficiency bonus.",
        "critfailure": "Temporarily immune to your Sabotage for 1 day."
    },
    {
        "name": "Twist the Knife",
        "actions": "1A",
        "traits": [
            "Rogue"
        ],
        "requirements": "Your last action was a melee Strike that dealt sneak attack damage to a flat-footed target.",
        "target": "other",
        "desc": "After stabbing your opponent in a weak spot, you tear the wound open. You deal persistent bleed damage to the target equal to your number of sneak attack damage dice."
    },
    {
        "name": "Delay Trap",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "trigger": "A trap within your reach is triggered.",
        "target": "object",
        "desc": "You can jam the workings of a trap to delay its effects. Attempt a Thievery check to Disable a Device on the trap; the DC to do so is increased by 5, and the effects are as follows.",
        "critsuccess": "You prevent the trap from being triggered, or you delay the activation until the start or end of your next turn (your choice).",
        "success": "You prevent the trap from being triggered, or you delay the activation until the end of your next turn (whichever is worse for you; GM's choice).",
        "failure": "No effect.",
        "critfailure": "You're flat-footed until the start of your next turn."
    },
    {
        "name": "Opportune Backstab",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "trigger": "A creature within your melee reach is hit by a melee attack from one of your allies.",
        "target": "other",
        "desc": "When your enemy is hit by your ally, you capitalize upon the distraction. Make a Strike against the triggering creature."
    },
    {
        "name": "Sidestep",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "trigger": "The attack roll for a Strike targeting you fails or critically fails.",
        "target": "other",
        "desc": "You deftly step out of the way of an attack, letting the blow continue to the creature next to you. You redirect the attack to a creature of your choice that is adjacent to you and within the reach of the triggering attack. The attacker rerolls the Strike's attack roll against the new target."
    },
    {
        "name": "Fantastic Leap",
        "actions": "2A",
        "traits": [
            "Rogue"
        ],
        "target": "self",
        "desc": "You launch yourself through the air at a foe. Attempt a High Jump or Long Jump. If you attempt a High Jump, determine the distance you can travel using the scale of a Long Jump. At the end of your jump, you can make a melee Strike.\n\nAfter your Strike, you fall to the ground if you're in the air. If the distance of your fall is no more than the height of your jump, you take no damage and land upright."
    },
    {
        "name": "Felling Shot",
        "actions": "2A",
        "traits": [
            "Rogue"
        ],
        "target": "other",
        "desc": "Your ranged attacks can shoot an unprepared foe right out of the air. Make a Strike with a ranged weapon or a thrown weapon against a flat-footed creature. If the Strike is a success and deals damage, the target must attempt a Reflex save against your class DC with the following effects.",
        "success": "The target is unaffected.",
        "failure": "The target falls up to 120 feet. If it hits the ground, it takes no damage from the fall.",
        "critfailure": "As failure, and the target can't fiy, jump, levitate, or otherwise leave the ground until the end of your next turn."
    },
    {
        "name": "Reactive Interference",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "trigger": "An adjacent enemy begins to use a reaction.",
        "target": "other",
        "desc": "Grabbing a sleeve, swiping with your weapon, or creating another obstruction, you reflexively foil an enemy's response. If the triggering creature's level is equal to or lower than yours, you disrupt the triggering reaction. If the triggering creature's level is higher than yours, you must make an attack roll against its AC. On a success, you disrupt the reaction."
    },
    {
        "name": "Spring from the Shadows",
        "actions": "1A",
        "traits": [
            "Flourish",
            "Rogue"
        ],
        "target": "other",
        "desc": "Leaping out from hiding, you assail your target when they least expect it. You Stride up to your Speed, but you must end your movement next to an enemy you're hidden from or undetected by. You then Strike that enemy; you remain hidden from or undetected by that creature until after you Strike. You can use Spring from the Shadows while Burrowing, Climbing, Flying, or Swimming instead of Striding if you have the corresponding movement type."
    },
    {
        "name": "Defensive Roll",
        "actions": "Free",
        "traits": [
            "Rogue"
        ],
        "trigger": "A physical attack would reduce you to 0 Hit Points.",
        "frequency": "once per 10 minutes",
        "cooldown": 1000,
        "target": "self",
        "desc": "Dropping into a roll to disperse the force of the blow, you can partially evade a lethal attack and stay conscious. You take half damage from the triggering attack."
    },
    {
        "name": "Instant Opening",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Rogue"
        ],
        "target": "other",
        "desc": "You distract your opponent with a few choice words or a rude gesture. Choose a target within 30 feet. It's flat-footed against your attacks until the end of your next turn. Depending on the way you describe your distraction, this action gains either the auditory or visual trait."
    },
    {
        "name": "Cognitive Loophole",
        "actions": "Reaction",
        "inputRequired": "Ignore a single mental effect that meets the requirement.",
        "traits": [
            "Rogue"
        ],
        "requirements": "You are currently affected by a mental effect that you gained by failing, but not critically failing, a saving throw.",
        "trigger": "Your turn ends.",
        "target": "self",
        "desc": "You can find a loophole in a mental effect to temporarily overcome it. Until the end of your next turn, you ignore a single mental effect that meets the requirement. You can suppress a particular effect using Cognitive Loophole only once.",
        "specialdesc": "You can use this reaction even if the mental effect is preventing you from using reactions.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Cognitive Loophole",
                "source": "Cognitive Loophole"
            }
        ]
    },
    {
        "name": "Dispelling Slice",
        "actions": "2A",
        "traits": [
            "Rogue"
        ],
        "target": "other",
        "desc": "Your sneak attack slices through the threads binding magic to a target. Make a Strike against a flat-footed creature (your choice). If your Strike deals sneak attack damage, you attempt to counteract a single spell active on the target. Your counteract level is equal to half your level (rounded up), and your counteract check modifier is equal to your class DC - 10."
    },
    {
        "name": "Perfect Distraction",
        "actions": "1A",
        "traits": [
            "Rogue"
        ],
        "maxDuration": 100,
        "target": "self",
        "desc": "You use clever tactics to mislead your foes as you sneak away. You Sneak while leaving a decoy behind. The decoy acts as the spell mislead, though you aren't invisible, just undetected. You can continue to concentrate to move your decoy, as with the spell, whether or not you remain hidden throughout the duration. Once you use Perfect Distraction, you need to spend 10 minutes to set up another decoy before you can use it again.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Perfect Distraction",
                "source": "Perfect Distraction"
            }
        ],
        "showSpells": [
            {
                "level": "6",
                "name": "Mislead"
            }
        ]
    },
    {
        "name": "Perfect Distraction: Setup Decoy",
        "actions": "10 minutes",
        "traits": [
            "Rogue"
        ],
        "target": "self",
        "desc": "You have used up your decoy and can't use Perfect Distraction anymore. You need to spend 10 minutes to set up another decoy before you can use it again.",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Setup Perfect Distraction Decoy",
                "source": "Setup Perfect Distraction Decoy"
            }
        ]
    },
    {
        "name": "Implausible Infiltration",
        "actions": "2A",
        "traits": [
            "Magical",
            "Move",
            "Rogue"
        ],
        "requirements": "You are adjacent to a floor or vertical wall.",
        "target": "self",
        "desc": "You find tiny holes or imperfections that no one else could see and try to somehow fit yourself through them, possibly moving directly through the wall or floor from one side to the other. Your movement attempt fails if the wall or floor is made of something other than wood, plaster, or stone; is thicker than 10 feet; or contains even a thin layer of metal. If you have a climb Speed, you can use this ability to attempt to move through a ceiling."
    },
    {
        "name": "Trickster's Ace",
        "actions": "Reaction",
        "inputRequired": "You gain a spell slot for this purpose. When the trigger occurs, you can use the prepared spell as a Reaction. When choosing the spell in the spells menu, you must determine whether the chosen spell fulfills the requirements of Trickster's Ace.",
        "traits": [
            "Concentrate",
            "Rogue"
        ],
        "requirements": "When you make your daily preparations, you must specify a trigger for this reaction using the same restrictions as the triggers for the Ready action. You also choose a single spell from the arcane, divine, occult, or primal list of 4th level or lower. The spell can't have a cost, nor can its casting time be more than 10 minutes. The spell must be able to target a single creature, and you must be a valid target for it.",
        "trigger": "You specify the trigger when you make your daily preparations (see Requirements below).",
        "target": "self",
        "desc": "Whether from jury-rigged magic items, stolen magical essence, or other means, you have a contingency in your back pocket for desperate situations. When the trigger occurs, you cause the spell to come into effect. The spell targets only you, no matter how many creatures it would affect normally. If you define particularly complicated conditions, as determined by the GM, the trigger might fail. Once the contingency is triggered, the spell is expended until your next daily preparations."
    },
    {
        "name": "Enduring Debilitation",
        "actions": "Free",
        "traits": [
            "Uncommon",
            "Rogue"
        ],
        "trigger": "You apply a debilitation to a creature.",
        "frequency": "once per minute",
        "cooldown": 100,
        "target": "self",
        "desc": "You can make your debilitation last an exceptionally long time. The triggering debilitation lasts for 1 minute instead of until the end of your next turn."
    },
    {
        "name": "Hidden Paragon",
        "actions": "Reaction",
        "traits": [
            "Rogue"
        ],
        "trigger": "You successfully use Stealth to Hide and become hidden from all of your current foes, or use Stealth to Sneak and become undetected to all your current foes.",
        "frequency": "once per hour",
        "cooldown": 6000,
        "target": "self",
        "desc": "When you put your mind to slipping out of sight, you disappear completely. You become invisible for 1 minute, even if you use a hostile action. Not even glitterdust, see invisibility, or similar effects can reveal you, though creatures can still use the Seek action to locate you as normal.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Hidden Paragon",
                "source": "Hidden Paragon"
            }
        ]
    },
    {
        "name": "Reactive Distraction",
        "actions": "Reaction",
        "traits": [
            "Concentrate",
            "Manipulate",
            "Rogue"
        ],
        "requirements": "You have Perfect Distraction ready to use.",
        "trigger": "You would be hit by an attack or targeted by an effect, or you are within an effect's area.",
        "target": "self",
        "desc": "You reactively switch with your decoy to foil your foe. You use Perfect Distraction, even if you were observed, as long as you end the movement of your Sneak while concealed or in a location with cover or greater cover. Your decoy is targeted by the attack or effect instead of you. In the case of an area effect, if your Sneak doesn't move you out of the area, both you and the decoy are targeted by the effect.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Perfect Distraction",
                "source": "Perfect Distraction"
            }
        ]
    },
    {
        "name": "Melodious Spell",
        "actions": "1A",
        "traits": [
            "Bard",
            "Concentrate",
            "Manipulate",
            "Metamagic"
        ],
        "target": "self",
        "desc": "You subtly weave your spellcasting into your performance. If the next action you take is to Cast a Spell, attempt a Performance check against all observers' Perception DCs. If your Performance check is successful against an observer's Perception DC, that observer doesn't notice that you are Casting a Spell, even though normally spells have sensory manifestations that would make spellcasting obvious to those around you, and verbal, somatic, and material components are extremely overt. You hide all of these as part of an ordinary performance.\n\nThis hides only the spell's spellcasting actions and manifestations, not its effects, so an observer might still see a ray streak out from you or see you vanish."
    },
    {
        "name": "Harmonize",
        "actions": "1A",
        "inputRequired": "Treat your next composition as a harmonized composition. You do not need to remove the conditions it caused if you cast another composition within its duration.",
        "traits": [
            "Bard",
            "Concentrate",
            "Manipulate",
            "Metamagic"
        ],
        "target": "self",
        "desc": "You can perform multiple compositions simultaneously. If your next action is to cast a composition, it becomes a harmonized composition. Unlike a normal composition, a harmonized composition doesn't end if you cast another composition, and you can cast another composition on the same turn as a harmonized one. Casting another harmonized composition ends any harmonized composition you have in effect."
    },
    {
        "name": "Unusual Composition",
        "actions": "1A",
        "traits": [
            "Bard",
            "Concentrate",
            "Manipulate",
            "Metamagic"
        ],
        "target": "self",
        "desc": "You can translate the emotion and power of a composition to other mediums. If your next action is to cast a composition spell, you can use a different kind of performance than usual for the composition to change any of its somatic components to verbal components or vice versa. As usual for composition spells, this changes whether the composition is auditory or visual."
    },
    {
        "name": "True Hypercognition",
        "actions": "1A",
        "traits": [
            "Bard",
            "Concentrate",
            "Manipulate",
            "Metamagic"
        ],
        "target": "self",
        "desc": "Your mind works at an incredible pace. You instantly use up to five Recall Knowledge actions. If you have any special abilities or free actions that would normally be triggered when you Recall Knowledge, you can't use them for these actions."
    },
    {
        "name": "Ringmaster's Introduction",
        "actions": "Reaction",
        "inputRequired": "The ally may grant themselves the Ringmaster's Introduction condition for 1 turn.",
        "traits": [
            "Uncommon",
            "Auditory",
            "Bard"
        ],
        "requirements": "The ally hasn't acted in the current combat.",
        "trigger": "An ally's turn begins.",
        "durationDependsOnTarget": true,
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "You announce the triggering ally with a litany of their legendary achievements, spurring them to action. The target is quickened this turn and can spend the extra action to Stride, Strike, Demoralize, Feint, or Perform.",
        "gainConditions": [
            {
                "duration": 5,
                "name": "Ringmaster's Introduction (Originator)",
                "source": "Ringmaster's Introduction",
                "targetFilter": "caster"
            },
            {
                "duration": 5,
                "name": "Ringmaster's Introduction",
                "source": "Ringmaster's Introduction",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Courteous Comeback",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Fortune",
            "Human"
        ],
        "requirements": "You're in a settlement or community, and you haven't used Courteous Comeback in this settlement or community within the past month.",
        "trigger": "You critically fail a Diplomacy check.",
        "target": "self",
        "desc": "You grew up in the proud Padishah Empire, where even insults have a certain poetic wit. Reroll the triggering Diplomacy check, using the second result."
    },
    {
        "name": "Goblin Scuttle",
        "actions": "Reaction",
        "traits": [
            "Goblin"
        ],
        "trigger": "An ally ends a move action adjacent to you.",
        "target": "self",
        "desc": "You take advantage of your ally's movement to adjust your position. You Step."
    },
    {
        "name": "Goblin Song",
        "actions": "1A",
        "traits": [
            "Goblin"
        ],
        "target": "area",
        "desc": "You sing annoying goblin songs, distracting your foes with silly and repetitive lyrics. Attempt a Performance check against the Will DC of a single enemy within 30 feet. This has all the usual traits and restrictions of a Performance check. You can affect up to two targets within range if you have expert proficiency in Performance, four if you have master proficiency, and eight if you have legendary proficiency.",
        "critsuccess": "The target takes a -1 status penalty to Perception checks and Will saves for 1 minute.",
        "success": "The target takes a -1 status penalty to Perception checks and Will saves for 1 round.",
        "critfailure": "The target is temporarily immune to attempts to use Goblin Song for 1 hour."
    },
    {
        "name": "Ankle Bite",
        "actions": "Reaction",
        "traits": [
            "Goblin"
        ],
        "trigger": "A foe gives you the grabbed or restrained condition using a part of its body.",
        "target": "other",
        "desc": "Whenever someone grabs onto you, you instinctively bite down hard. Sometimes that makes them let go, and sometimes it just makes them angrier, but either way, it's both satisfying and tasty. Make a jaws Strike against the triggering foe. On a critical hit, you are no longer grabbed. This Strike doesn't count toward your multiple attack penalty, and your multiple attack penalty doesn't apply to this Strike."
    },
    {
        "name": "Tail Spin",
        "actions": "2A",
        "traits": [
            "Goblin"
        ],
        "target": "other",
        "desc": "You excel at using your tail as a weapon to upend your foes. Attempt a single Athletics check to Trip up to two adjacent creatures. If you roll a success against a target, you get a critical success against that target instead.",
        "targetNumbers": [
            {
                "number": 2
            }
        ]
    },
    {
        "name": "Torch Goblin",
        "actions": "1A",
        "traits": [
            "Goblin"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You've spent enough time on fire that you know how to use it to your advantage. You can light yourself thoroughly on fire with a held torch, a bottle of alchemist's fire, or a similar incendiary, dealing yourself 1d6 persistent fire damage. As long as you are suffering persistent fire damage, all your melee attacks against adjacent creatures deal an additional 1 fire damage per weapon damage die. Any creature that successfully Grapples, Shoves, or Trips you takes |dice=1d6 Fire| 1d6 fire damage; if it uses a weapon for that action, the weapon takes the damage instead. You must still attempt the flat check to remove the persistent fire damage each round, as normal.",
        "gainConditions": [
            {
                "name": "Torch Goblin",
                "source": "Torch Goblin"
            }
        ]
    },
    {
        "name": "Freeze It!",
        "actions": "1A",
        "traits": [
            "Goblin"
        ],
        "target": "other",
        "desc": "You are no rime hag or Jadwiga, but the magic of the north has still left a mark on you. Frigid ice runs through your veins, and you can expel frost from your body to freeze your foes. Attempt an Athletics check against the Fortitude DC of an adjacent foe. If you have master proficiency in Athletics, you can affect up to two adjacent foes, rolling one Athletics check against each foe.",
        "critsuccess": "The target becomes clumsy 2 for 1 round.",
        "success": "The target becomes clumsy 1 for 1 round.",
        "critfailure": "The target is temporarily immune for 1 minute."
    },
    {
        "name": "Hungry Goblin",
        "inputRequired": "Activate this activity to gain temporary Hit Points equal to half your level for 1 minute.",
        "traits": [
            "Goblin"
        ],
        "target": "self",
        "desc": "You'll eat anything and anyone. Whenever you inflict persistent bleed damage with your jaws unarmed attack, you gain temporary Hit Points equal to half your level for 1 minute.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Hungry Goblin",
                "source": "Hungry Goblin"
            }
        ]
    },
    {
        "name": "Roll with It",
        "actions": "Reaction",
        "traits": [
            "Goblin"
        ],
        "trigger": "A foe hits you with a melee weapon or unarmed attack.",
        "target": "self",
        "desc": "When you take a big hit, your foe bounces you around like a rubber ball, but you escape the worst of the blow. Your foe can move you any distance of its choice up to 30 feet in a direction of its choice (this is not forced movement, and it triggers reactions as normal). You fall prone and are stunned 1. Attempt a DC 6 flat check. On a success, you take minimum damage from the attack, and on a critical success, if the attack was a critical hit, you don't take double damage from the critical hit.",
        "gainConditions": [
            {
                "name": "Prone",
                "source": "Roll with It"
            },
            {
                "name": "Stunned",
                "source": "Roll with It",
                "value": 1
            }
        ]
    },
    {
        "name": "Retributive Strike",
        "actions": "Reaction",
        "traits": [
            "Champion"
        ],
        "trigger": "An enemy damages your ally, and both are within 15 feet of you.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "You protect your ally and strike your foe. The ally gains resistance to all damage against the triggering damage equal to 2 + your level. If the foe is within reach, make a melee Strike against it.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Retributive Strike (Originator)",
                "source": "Retributive Strike",
                "targetFilter": "caster"
            },
            {
                "name": "Retributive Strike",
                "source": "Retributive Strike",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Glimpse of Redemption",
        "actions": "Reaction",
        "traits": [
            "Champion"
        ],
        "trigger": "An enemy damages your ally, and both are within 15 feet of you.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "Your foe hesitates under the weight of sin as visions of redemption play in their mind's eye. The foe must choose one of the following options:\n\nThe ally is unharmed by the triggering damage.\nThe ally gains resistance to all damage against the triggering damage equal to 2 + your level. After the damaging effect is applied, the enemy becomes enfeebled 2 until the end of its next turn.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Glimpse of Redemption (Originator)",
                "source": "Glimpse of Redemption",
                "targetFilter": "caster"
            },
            {
                "copyChoiceFrom": "Glimpse of Redemption (Originator)",
                "name": "Glimpse of Redemption",
                "source": "Glimpse of Redemption",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Liberating Step",
        "actions": "Reaction",
        "traits": [
            "Champion"
        ],
        "trigger": "An enemy damages, Grabs, or Grapples your ally, and both are within 15 feet of you.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "You free an ally from restraint. If the trigger was an ally taking damage, the ally gains resistance to all damage against the triggering damage equal to 2 + your level. The ally can attempt to break free of effects grabbing, restraining, immobilizing, or paralyzing them. They either attempt a new save against one such effect that allows a save, or attempt to Escape from one effect as a free action. If they can move, the ally can Step as a free action, even if they didn't need to escape.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Liberating Step (Originator)",
                "source": "Liberating Step",
                "targetFilter": "caster"
            },
            {
                "name": "Liberating Step",
                "source": "Liberating Step",
                "targetFilter": "target"
            }
        ]
    },
    {
        "name": "Reflective Scales Discharge",
        "actions": "2A",
        "traits": [
            "Concentrate",
            "Manipulate"
        ],
        "target": "area",
        "desc": "The reflective scales store up energy as they protect you. Keep track of how much damage the scales have prevented. You explode your scales outward in a 20-foot radius around you, dealing |dice=1d6| 1d6 damage of the chosen type to all creatures in the area for every 10 damage the scales have prevented, to a maximum of 10d6 damage (plus 5d6 for every 2 levels after 4th) after preventing 100 damage (plus 50 for every 2 levels after 4th). Once you do so, the spell ends.",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Reflective Scales Discharge",
                "source": "Reflective Scales Discharge",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Keep Up Appearances",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Human"
        ],
        "trigger": "You are affected by an emotion effect.",
        "target": "area",
        "desc": "Taldan pride means you never show weakness. Roll a Deception check and compare the result to any observing creatures' Perception DCs. On a success, that creature believes you were unaffected by the emotion effect. A creature tricked in this manner can't benefit from the emotion effect and can't use abilities that require you to be under this emotion effect; for example, if you successfully use this ability to trick a will-o'-wisp into believing you aren't under a fear effect, it can't use its Feed on Fear ability on you."
    },
    {
        "name": "Know Oneself",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Fortune",
            "Human"
        ],
        "trigger": "You roll a critical failure on a saving throw against an emotion effect.",
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "You center yourself and call to mind the Vudrani monastic ideals of mindfulness and self-knowledge. You fail the save against the emotion effect instead of critically failing."
    },
    {
        "name": "Saoc Astrology",
        "actions": "1A",
        "traits": [
            "Uncommon",
            "Concentrate",
            "Human"
        ],
        "requirements": "You must spend 10 minutes just after your daily preparations examining the sky or consulting a star chart or you can't use this action that day.",
        "toggle": true,
        "charges": 3,
        "frequency": "3 times per day",
        "cooldown": 144000,
        "maxDuration": 1,
        "target": "self",
        "desc": "The ancient Saoc Brethren were the masters of astrology, and while your knowledge may be but a pale shadow of their wisdom, it still comes in handy. You recall the stars' predictions about your current situation. If your next action requires you to attempt one or more skill checks, roll 1d8. On a result of 6, 7, or 8, you gain a +2 circumstance bonus to the first such skill check you attempt. On a 3, 4, or 5, you gain a +1 circumstance bonus. On a 2, you gain nothing. On a 1, you take a -1 circumstance penalty to the skill check.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Saoc Astrology",
                "source": "Saoc Astrology"
            }
        ]
    },
    {
        "name": "Tupilaq Carver",
        "actions": "Free",
        "traits": [
            "Human",
            "Uncommon"
        ],
        "target": "self",
        "desc": "You know the truth behind old stories that tell of sending a fetish of bone and sinew to seek vengeance. If your next action is to cast summon construct, you include a drop of blood, lock of hair, or other portion of a creature's body as part of the spell's material component, and the summoned construct gains a +4 status bonus to Perception checks to sense or locate that creature.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Tupilaq Carver",
                "source": "Tupilaq Carver"
            }
        ]
    },
    {
        "name": "Incredible Improvisation",
        "actions": "Free",
        "traits": [
            "Human"
        ],
        "trigger": "You attempt a check using a skill you're untrained in.",
        "toggle": true,
        "frequency": "once per day",
        "cooldown": 144000,
        "maxDuration": 1,
        "target": "self",
        "desc": "A stroke of brilliance gives you a major advantage with a skill despite your inexperience. Gain a +4 circumstance bonus to the triggering skill check.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Incredible Improvisation",
                "source": "Incredible Improvisation"
            }
        ]
    },
    {
        "name": "Shadow Pact",
        "actions": "1 minute",
        "inputRequired": "You take 1 damage automatically when you activate Shadow Pact.",
        "traits": [
            "Human"
        ],
        "target": "self",
        "desc": "Thousands of years ago, your ancestors made a pact with Zon-Kuthon. He has not forgotten, even if you might wish he had. You can take 1 damage to mix blood and shadows to cast 5th-level creation as an innate divine spell. You can use this ability as often as you wish, but you can have only one such object in existence at a time. If the object encounters bright light, the spell ends and the object dissolves into shadows.",
        "gainConditions": [
            {
                "duration": 6000,
                "name": "Shadow Pact",
                "source": "Shadow Pact"
            }
        ],
        "showSpells": [
            {
                "level": "5",
                "name": "Creation"
            }
        ]
    },
    {
        "name": "Orc Superstition",
        "actions": "Reaction",
        "traits": [
            "Concentrate",
            "Orc"
        ],
        "trigger": "You attempt a saving throw against a spell or magical effect, before rolling.",
        "toggle": true,
        "maxDuration": 1,
        "target": "self",
        "desc": "You defend yourself against magic by relying on techniques derived from orc cultural superstitions. You gain a +1 circumstance bonus to your saving throw against the triggering spell or magical effect.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Orc Superstition",
                "source": "Orc Superstition"
            }
        ]
    },
    {
        "name": "Victorious Vigor",
        "actions": "Reaction",
        "traits": [
            "Orc"
        ],
        "trigger": "You bring a foe to 0 Hit Points.",
        "target": "self",
        "desc": "Your victories in battle fill you with pride and imbue you with the energy to fight a bit longer despite your wounds. You gain temporary Hit Points equal to your Constitution modifier until the end of your next turn.",
        "gainConditions": [
            {
                "duration": 15,
                "name": "Victorious Vigor",
                "source": "Victorious Vigor"
            }
        ]
    },
    {
        "name": "Forest Stealth",
        "actions": "1A",
        "traits": [
            "Elf"
        ],
        "requirements": "You are in a forest or jungle environment near an environmental feature that would allow you to Take Cover.",
        "target": "self",
        "desc": "You are skilled at quickly hiding behind bits of underbrush or foliage. You Take Cover and then use that cover to Hide.",
        "onceEffects": [
            {
                "affected": "Cover",
                "value": "4"
            }
        ]
    },
    {
        "name": "Brightness Seeker",
        "actions": "10 minutes",
        "traits": [
            "Elf"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "Once per day, you can spend 10 minutes studying your surroundings in search of omens related to a particular course of action to cast augury as an innate divine spell. Unless the result of the augury was \"nothing,\" you gain the following reaction for the next 30 minutes:",
        "gainConditions": [
            {
                "duration": 3000,
                "name": "Brightness Seeker",
                "source": "Brightness Seeker"
            }
        ],
        "castSpells": [
            {
                "_className": "SpellCast",
                "level": 2,
                "name": "Augury"
            }
        ],
        "showActivities": [
            "Call Upon the Brightness"
        ]
    },
    {
        "name": "Call Upon the Brightness",
        "actions": "Reaction",
        "traits": [
            "Elf"
        ],
        "trigger": "You attempt an attack roll, skill check, or saving throw while performing the course of action from your augury, but you haven't rolled yet.",
        "toggle": true,
        "maxDuration": 1,
        "target": "self",
        "desc": "You gain a +1 status bonus to the triggering check, or a +2 status bonus if the result of the augury was \"woe\" and you proceeded anyway.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Call Upon the Brightness",
                "source": "Call Upon the Brightness"
            }
        ]
    },
    {
        "name": "Elf Step",
        "actions": "1A",
        "traits": [
            "Elf"
        ],
        "target": "self",
        "desc": "You move in a graceful dance, and even your steps are broad. You Step 5 feet twice."
    },
    {
        "name": "Universal Longevity",
        "actions": "1A",
        "inputRequired": "You can already freely change the skills you selected with Ancestral Longevity and Expert Longevity. Universal Longevity gives you in-game permission to do once per day without making your daily preparations.",
        "traits": [
            "Elf"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "You've perfected your ability to keep up with all the skills you've learned over your long life, so you're almost never truly untrained at a skill. You reflect on your life experiences, changing the skills you selected with Ancestral Longevity and Expert Longevity."
    },
    {
        "name": "Envenom Fangs",
        "actions": "1A",
        "traits": [
            "Lizardfolk"
        ],
        "charges": 1,
        "frequency": "a number of times per day equal to your level",
        "cooldown": 144000,
        "target": "self",
        "desc": "You envenom your fangs. If the next fangs Strike you make before the end of your next turn hits and deals damage, the Strike deals an additional |dice=1d6 Poison| 1d6 poison damage. On a critical failure, the poison is wasted as normal.",
        "gainConditions": [
            {
                "duration": 15,
                "name": "Envenom Fangs",
                "source": "Envenom Fangs"
            }
        ]
    },
    {
        "name": "Shed Tail",
        "actions": "Reaction",
        "traits": [
            "Lizardfolk"
        ],
        "requirements": "You have a fully grown tail.",
        "trigger": "You become grabbed.",
        "cooldown": 1008000,
        "target": "self",
        "desc": "You can shed your tail to escape. You cease being grabbed, then Stride without triggering any reactions from the creature that grabbed you. It takes 1 week for your tail to fully grow back. Until it does, you can't use your tail unarmed attack, and you take a -2 circumstance penalty on checks to Balance.",
        "gainConditions": [
            {
                "duration": 1008000,
                "name": "Shed Tail",
                "source": "Shed Tail"
            }
        ]
    },
    {
        "name": "Avenge in Glory",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Dwarf"
        ],
        "trigger": "An ally within 30 feet gains the dying condition.",
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "You honor your ally's life, gaining temporary Hit Points equal to your level for 1 minute. As long as you have these temporary Hit Points, you gain a +1 circumstance bonus to attack and damage rolls.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Avenge in Glory",
                "source": "Avenge in Glory"
            }
        ]
    },
    {
        "name": "Clan's Edge",
        "actions": "2A",
        "traits": [
            "Dwarf"
        ],
        "target": "self",
        "desc": "By moving your clan dagger with rapid precision, you can protect yourself more effectively. Make two clan dagger Strikes against different targets. Your multiple attack penalty applies normally to these Strikes. You then use an Interact action to gain the +1 circumstance bonus to your AC from your clan dagger's parrying trait.",
        "gainConditions": [
            {
                "duration": 10,
                "name": "Clan's Edge",
                "source": "Clan's Edge"
            }
        ]
    },
    {
        "name": "Vengeful Hatred",
        "inputRequired": "Activate this activity whenever a creature critically succeeds at an attack against you and deals damage to you.",
        "traits": [
            "Dwarf"
        ],
        "target": "self",
        "desc": "In addition to your bonus against your dwarven ancestral foes, if a creature critically succeeds at an attack against you and deals damage to you, you gain your bonus to damage against that creature for 1 minute regardless of whether it has the chosen trait. You gain a +1 circumstance bonus to damage with weapons and unarmed attacks against this creature. If your attack would deal more than one weapon die of damage (as is common at higher levels than 1st), the bonus is equal to the number of weapon dice or unarmed attack dice.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Vengeful Hatred",
                "source": "Vengeful Hatred"
            }
        ]
    },
    {
        "name": "Boulder Roll",
        "actions": "2A",
        "traits": [
            "Dwarf"
        ],
        "target": "other",
        "desc": "Your dwarven build allows you to push foes around, just like a mighty boulder tumbles through a subterranean cavern. Take a Step into the square of a foe that is your size or smaller, and the foe must move into the empty space directly behind it. The foe must move even if doing so places it in harm's way. The foe can attempt a Fortitude saving throw against your Athletics DC to block your Step. If the foe attempts this saving throw, unless it critically succeeds, it takes bludgeoning damage equal to your level plus your Strength modifier.\n\nIf the foe can't move into an empty space (if it is surrounded by solid objects or other creatures, for example), your Boulder Roll has no effect."
    },
    {
        "name": "Moment of Clarity",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Rage"
        ],
        "target": "self",
        "desc": "You push back your rage for a moment in order to think clearly. Until the end of this turn, you can use actions with the concentrate trait even if those actions don't have the rage trait.",
        "gainConditions": [
            {
                "duration": 5,
                "name": "Moment of Clarity",
                "source": "Moment of Clarity"
            }
        ]
    },
    {
        "name": "Furious Finish",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "toggle": true,
        "maxDuration": 1,
        "target": "other",
        "desc": "Desperate to finish the fight, you pour all your rage into one final blow. Make a Strike. If it hits, you gain a circumstance bonus to damage equal to the number of rounds remaining in your Rage (maximum 10). After this Strike, your Rage immediately ends, and you are fatigued until you rest for at least 10 minutes.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Furious Finish",
                "source": "Furious Finish",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "No Escape",
        "actions": "Reaction",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "trigger": "A foe within reach attempts to move away from you.",
        "target": "other",
        "desc": "You keep pace with a retreating foe. Stride up to your Speed, following the foe and keeping it in reach throughout its movement until it stops moving or you've moved your full Speed. You can use No Escape to Burrow, Climb, Fly, or Swim instead of Stride if you have the corresponding movement type."
    },
    {
        "name": "Second Wind",
        "inputRequired": "While this is activated, you can enter Rage without waiting.",
        "traits": [
            "Barbarian"
        ],
        "toggle": true,
        "target": "self",
        "desc": "You can enter a second rage, but afterward you need to catch your breath. You can Rage without waiting for 1 minute after the previous Rage (or 1 round, with quick rage), but when you end this second Rage, you're fatigued until you rest for 10 minutes.",
        "gainConditions": [
            {
                "name": "Second Wind",
                "source": "Second Wind"
            }
        ]
    },
    {
        "name": "Shake it Off",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Rage"
        ],
        "target": "self",
        "desc": "You concentrate on your rage, overcoming fear and fighting back sickness. Reduce your frightened condition value by 1, and attempt a Fortitude save to recover from the sickened condition as if you had spent an action retching; you reduce your sickened condition value by 1 on a failure (but not on a critical failure), by 2 on a success, or by 3 on a critical success.",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Shake it Off",
                "source": "Shake it Off"
            }
        ]
    },
    {
        "name": "Farabellus Flip",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Barbarian",
            "Fighter",
            "Ranger"
        ],
        "trigger": "An enemy targets you with a melee Strike.",
        "toggle": true,
        "maxDuration": 1,
        "target": "self",
        "desc": "Surprisingly agile even in a breastplate and carrying a full rucksack, Marcos Farabellus developed this evasive maneuver during one of his many adventures. Flinging your body into a twisting somersault, you gain a +2 circumstance bonus to your AC against the triggering attack. If the attack still hits you, you can Step to an open space that's still within the triggering enemy's reach, turning the impact of the blow into momentum.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Farabellus Flip",
                "source": "Farabellus Flip"
            }
        ]
    },
    {
        "name": "Wounded Rage",
        "actions": "Reaction",
        "inputRequired": "Activate the Rage activity.",
        "traits": [
            "Barbarian"
        ],
        "target": "self",
        "desc": "You roar in pain, awakening the rage within you. You Rage."
    },
    {
        "name": "Cleave",
        "actions": "Reaction",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "trigger": "Your melee Strike kills a creature or knocks it unconscious, and another foe is adjacent to that creature.",
        "target": "other",
        "desc": "You swing clear through one foe and into another. Make a melee Strike against the second foe."
    },
    {
        "name": "Dragon's Rage Breath",
        "actions": "2A",
        "traits": [
            "Arcane",
            "Barbarian",
            "Concentrate",
            "Evocation",
            "Instinct",
            "Rage"
        ],
        "requirements": "You haven't used this ability since you last Raged.",
        "target": "area",
        "desc": "You breathe deeply and exhale powerful energy in a 30-foot cone or 60-foot line, dealing |dice=var1| 1d6 damage per level. The area and damage type match those of your dragon (see Table 3-4). If you used this ability in the last hour, the area and the damage are halved (15-foot cone or 30-foot line; |dice=var2| 1d6 damage for every 2 levels). Each creature in the area must attempt a basic Reflex save.\n\n<strong>Black</strong>: <strong>Type</strong> Chromatic, <strong>Breath Weapon</strong> Line of acid.\n<strong>Blue</strong>: <strong>Type</strong> Chromatic, <strong>Breath Weapon</strong> Line of electricity.\n<strong>Green</strong>: <strong>Type</strong> Chromatic, <strong>Breath Weapon</strong> Cone of poison.\n<strong>Red</strong>: <strong>Type</strong> Chromatic, <strong>Breath Weapon</strong> Cone of fire.\n<strong>White</strong>: <strong>Type</strong> Chromatic, <strong>Breath Weapon</strong> Cone of cold.\n<strong>Brass</strong>: <strong>Type</strong> Metallic, <strong>Breath Weapon</strong> Line of fire.\n<strong>Bronze</strong>: <strong>Type</strong> Metallic, <strong>Breath Weapon</strong> Line of electricity.\n<strong>Copper</strong>: <strong>Type</strong> Metallic, <strong>Breath Weapon</strong> Line of acid.\n<strong>Gold</strong>: <strong>Type</strong> Metallic, <strong>Breath Weapon</strong> Cone of fire.\n<strong>Silver</strong>: <strong>Type</strong> Metallic, <strong>Breath Weapon</strong> Cold of cold.",
        "gainConditions": [
            {
                "duration": 6000,
                "name": "Dragon's Rage Breath: Halved Damage",
                "source": "Dragon's Rage Breath",
                "targetFilter": "caster"
            },
            {
                "name": "Dragon's Rage Breath Cooldown",
                "source": "Dragon's Rage Breath",
                "targetFilter": "caster"
            }
        ],
        "heightenedDescs": [
            {
                "level": 6,
                "descs": [
                    {
                        "value": "6d6",
                        "variable": "var1"
                    },
                    {
                        "value": "3d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 7,
                "descs": [
                    {
                        "value": "7d6",
                        "variable": "var1"
                    },
                    {
                        "value": "3d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 8,
                "descs": [
                    {
                        "value": "8d6",
                        "variable": "var1"
                    },
                    {
                        "value": "4d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 9,
                "descs": [
                    {
                        "value": "9d6",
                        "variable": "var1"
                    },
                    {
                        "value": "4d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 10,
                "descs": [
                    {
                        "value": "10d6",
                        "variable": "var1"
                    },
                    {
                        "value": "5d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 11,
                "descs": [
                    {
                        "value": "11d6",
                        "variable": "var1"
                    },
                    {
                        "value": "5d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 12,
                "descs": [
                    {
                        "value": "12d6",
                        "variable": "var1"
                    },
                    {
                        "value": "6d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 13,
                "descs": [
                    {
                        "value": "13d6",
                        "variable": "var1"
                    },
                    {
                        "value": "6d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 14,
                "descs": [
                    {
                        "value": "14d6",
                        "variable": "var1"
                    },
                    {
                        "value": "7d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 15,
                "descs": [
                    {
                        "value": "15d6",
                        "variable": "var1"
                    },
                    {
                        "value": "7d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 16,
                "Descs": [
                    {
                        "value": "8d6",
                        "variable": "var2"
                    },
                    {
                        "value": "16d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 17,
                "Descs": [
                    {
                        "value": "8d6",
                        "variable": "var2"
                    },
                    {
                        "value": "17d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 18,
                "Descs": [
                    {
                        "value": "9d6",
                        "variable": "var2"
                    },
                    {
                        "value": "18d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 19,
                "Descs": [
                    {
                        "value": "9d6",
                        "variable": "var2"
                    },
                    {
                        "value": "19d6",
                        "variable": "var1"
                    }
                ]
            },
            {
                "level": 20,
                "Descs": [
                    {
                        "value": "10d6",
                        "variable": "var2"
                    },
                    {
                        "value": "20d6",
                        "variable": "var1"
                    }
                ]
            }
        ]
    },
    {
        "name": "Giant's Stature",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Instinct",
            "Polymorph",
            "Primal",
            "Rage",
            "Transmutation"
        ],
        "requirements": "You are Medium or smaller.",
        "target": "self",
        "desc": "You grow to incredible size. You become Large, increasing your reach by 5 feet and gaining the clumsy 1 condition until you stop raging. Your equipment grows with you.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Giant's Stature",
                "source": "Giant's Stature"
            }
        ]
    },
    {
        "name": "Spirits' Interference",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Divine",
            "Instinct",
            "Necromancy",
            "Rage"
        ],
        "target": "self",
        "desc": "You call forth protective spirits to ward off ranged attacks. Until your rage ends, anyone making a ranged attack against you must succeed at a DC 5 flat check or the attack misses with no effect.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Spirits' Interference",
                "source": "Spirits' Interference"
            }
        ]
    },
    {
        "name": "Animal Rage",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Instinct",
            "Polymorph",
            "Primal",
            "Rage",
            "Transmutation"
        ],
        "toggle": true,
        "maxDuration": 100,
        "target": "self",
        "desc": "You transform into your animal. You gain the effects of the 3rd-level animal form spell except you use your own statistics, temporary Hit Points, and unarmed attacks instead of those granted by animal form. You also retain the constant abilities of your gear. If your animal is a frog, your tongue's reach increases to 15 feet. Dismissing the transformation gains the rage trait.",
        "gainConditions": [
            {
                "choiceBySubType": "Animal Instinct",
                "duration": 100,
                "hideChoices": "TRUE",
                "name": "Animal Rage",
                "source": "Animal Rage"
            }
        ],
        "showSpells": [
            {
                "level": "3",
                "name": "Animal Form"
            }
        ]
    },
    {
        "name": "Renewed Vigor",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Rage"
        ],
        "target": "self",
        "desc": "You pause to recover your raging vigor. You gain temporary Hit Points equal to half your level plus your Constitution modifier.",
        "onceEffects": [
            {
                "affected": "Temporary HP",
                "value": "Math.floor(Level / 2) + Modifier('Constitution')"
            }
        ]
    },
    {
        "name": "Share Rage",
        "actions": "1A",
        "traits": [
            "Auditory",
            "Barbarian",
            "Rage",
            "Visual"
        ],
        "requirements": "You haven't used this ability since you last Raged.",
        "target": "ally",
        "cannotTargetCaster": true,
        "desc": "You stoke an ally's fury. While you are raging, one willing creature within 30 feet gains the effects of the Rage action, except it can still use concentrate actions.",
        "gainConditions": [
            {
                "name": "Share Rage (Originator)",
                "source": "Share Rage",
                "targetFilter": "caster"
            },
            {
                "name": "Share Rage",
                "source": "Share Rage",
                "targetFilter": "target"
            },
            {
                "activationPrerequisite": "!Has_Feat(Creature.type, 'Contagious Rage') ? 1 : 0",
                "name": "Share Rage Cooldown",
                "source": "Share Rage",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Thrash",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "requirements": "You have a foe grabbed.",
        "target": "other",
        "desc": "You thrash the grabbed foe around. It takes bludgeoning damage equal to your Strength modifier plus your weapon specialization damage plus your Rage damage. The foe must attempt a basic Fortitude save against your class DC."
    },
    {
        "name": "Come and Get Me",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Rage"
        ],
        "target": "self",
        "desc": "You open yourself to attacks so you can respond in turn. Until your rage ends, you are flat-footed, and damage rolls against you gain a +2 circumstance bonus. If a creature hits you, that creature is flat-footed to you until the end of your next turn. If you hit it before the end of your next turn, you gain temporary Hit Points equal to your Constitution modifier, or double that on a critical hit. These temporary Hit Points last until the end of your rage.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Come and Get Me",
                "source": "Come and Get Me"
            }
        ]
    },
    {
        "name": "Furious Sprint",
        "actions": "2A",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "target": "self",
        "desc": "You rush forward. Stride up to five times your Speed in a straight line. You can increase the number of actions this activity takes to 3 to Stride up to eight times your Speed in a straight line instead."
    },
    {
        "name": "Knockback",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "requirements": "Your last action was a successful Strike.",
        "target": "other",
        "desc": "The weight of your swing drives your enemy back. You push the foe back 5 feet, with the effects of a successful Shove. You can follow the foe as normal for a successful Shove."
    },
    {
        "name": "Terrifying Howl",
        "actions": "1A",
        "traits": [
            "Auditory",
            "Barbarian",
            "Rage"
        ],
        "target": "area",
        "desc": "You unleash a terrifying howl. Attempt Intimidate checks to Demoralize each enemy within 30 feet. Regardless of the results of your checks, each enemy is then temporarily immune to Terrifying Howl for 1 minute."
    },
    {
        "name": "Dragon's Rage Wings",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Instinct",
            "Morph",
            "Primal",
            "Rage",
            "Transmutation"
        ],
        "target": "self",
        "desc": "You sprout dragon wings from your back of the same color as your chosen dragon. While you are raging, you gain a fly Speed equal to your land Speed. If you are flying when your rage ends, you start to fall but the transformation only completes at the last moment, so you take no damage from the fall and land standing up.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Dragon Rage's Wings",
                "source": "Dragon Rage's Wings"
            }
        ]
    },
    {
        "name": "Furious Grab",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "requirements": "Your last action was a successful Strike, and either you have a hand free or your Strike used a grapple weapon.",
        "target": "other",
        "desc": "You grab your foe while it's distracted by your attack. The foe you hit becomes grabbed, as if you had succeeded at an Athletics check to Grapple the foe."
    },
    {
        "name": "Predator's Pounce",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Flourish",
            "Instinct",
            "Open",
            "Rage"
        ],
        "requirements": "You are unarmored or wearing light armor.",
        "target": "other",
        "desc": "You close the distance to your prey in a blur, pouncing on the creature before it can react. You Stride up to your Speed and make a Strike at the end of your movement."
    },
    {
        "name": "Spirit's Wrath",
        "actions": "1A",
        "traits": [
            "Attack",
            "Barbarian",
            "Concentrate",
            "Instinct",
            "Rage"
        ],
        "target": "other",
        "desc": "You call forth an ephemeral apparition, typically the ghost of an ancestor or a nature spirit, which takes the form of a wisp. The spirit wisp makes a melee wisp rush unarmed attack against an enemy within 120 feet of you. The wisp's attack modifier is equal to your proficiency bonus for martial weapons plus your Strength modifier plus a +2 item bonus, and it applies the same circumstance and status bonuses and penalties that you have. On a hit, the wisp deals damage equal to |dice=4d8 + conmod| 4d8 plus your Constitution modifier. The damage is your choice of negative or positive damage; don't apply your Rage damage or your weapon specialization damage, but circumstance and status bonuses and penalties that would also affect the wisp's damage apply. If your wisp's Strike is a critical hit, the target becomes frightened 1. This attack uses and counts toward your multiple attack penalty as if you were the one attacking."
    },
    {
        "name": "Giant's Lunge",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Instint",
            "Rage"
        ],
        "target": "self",
        "desc": "You extend your body and prepare to attack foes outside your normal reach. Until your rage ends, all your melee weapons and unarmed attacks gain reach 10. This doesn't increase the reach of any weapon or unarmed attack that already has the reach trait, but it does combine with abilities that increase your reach due to increased size, such as Giant's Stature.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Giant's Lunge",
                "source": "Giant's Lunge"
            }
        ]
    },
    {
        "name": "Vengeful Strike",
        "actions": "Reaction",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "requirements": "You're under the effect of Come and Get Me.",
        "trigger": "A creature within your reach succeeds or critically succeeds at an attack against you.",
        "target": "other",
        "desc": "When struck by an enemy, you respond in turn. Make a melee Strike against the triggering creature. This Strike doesn't count toward your multiple attack penalty, and your multiple attack penalty doesn't apply to this Strike."
    },
    {
        "name": "Dragon Transformation",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Instinct",
            "Polymorph",
            "Primal",
            "Rage",
            "Transmutation"
        ],
        "toggle": true,
        "maxDuration": 100,
        "target": "self",
        "desc": "You transform into a ferocious Large dragon, gaining the effects of 6th-level dragon form except that you use your own AC and attack modifier, you apply your extra damage from Rage, and the Breath Weapon uses your class DC at all levels. The action to Dismiss the transformation gains the rage trait.\n\nAt 18th level, you gain a +20-foot status bonus to your fly Speed, your damage bonus with dragon Strikes increases to +12, and you gain a +14 status bonus to your breath weapon damage.",
        "gainConditions": [
            {
                "duration": 100,
                "name": "Dragon Transformation",
                "source": "Dragon Transformation"
            }
        ],
        "showSpells": [
            {
                "level": "6",
                "name": "Dragon Form"
            }
        ]
    },
    {
        "name": "Dragon Form Breath Weapon",
        "actions": "2A",
        "inputRequired": "Roll 1d4 and choose the appropriate duration for the cooldown condition.",
        "traits": [
            "Arcane",
            "Evocation"
        ],
        "target": "area",
        "desc": "The shape, damage, and damage type of your breath weapon depend on your specific dragon form (see below). A creature in the area attempts a basic save against your spell DC. This is a Reflex save unless stated otherwise in the special ability description for your specific dragon form. Once activated, your breath weapon can't be used again for |dice=1d4| 1d4 rounds. Your breath weapon has the trait corresponding to the type of damage it deals.\n\nOn 8th spell level, you gain a +14 status bonus to the breath weapon's damage.\n\n<strong>Black</strong> 60-foot line, |dice=11d6 Acid| |dice=11d6 + 14 Acid|  11d6 acid.\n<strong>Blue</strong> 80-foot line, |dice=6d12 Electricity| |dice=6d12 + 14 Electricity| 6d12 electricity.\n<strong>Brass</strong> 60-foot line, |dice=15d4 Fire| |dice=15d4 + 14 Fire| 15d4 fire.\n<strong>Bronze</strong> 80-foot line, |dice=6d12 Electricity| |dice=6d12 + 14 Electricity| 6d12 electricity.\n<strong>Copper</strong> 60-foot line, |dice=10d6 Acid| |dice=10d6 + 14 Acid| 10d6 acid.\n<strong>Gold</strong> 30-foot cone, |dice=10d6 Fire| |dice=10d6 + 14 Fire|  6d10 fire.\n<strong>Green</strong> 30-foot cone, |dice=10d6 Poison| |dice=10d6 + 14 Poison| 10d6 poison (Fortitude save instead of Reflex).\n<strong>Red</strong> 30-foot cone, |dice=10d6 Fire| |dice=10d6 + 14 Fire| 10d6 fire.\n<strong>Silver</strong> 30-foot cone, |dice=8d8 Cold| |dice=8d8 + 14 Cold| 8d8 cold.\n<strong>White</strong> 30-foot cone, |dice=10d6 Cold| |dice=10d6 + 14 Cold| 10d6 cold.",
        "gainConditions": [
            {
                "duration": -5,
                "name": "Dragon Form Breath Weapon Cooldown",
                "source": "Dragon Form Breath Weapon",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Reckless Abandon",
        "actions": "Free",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "requirements": "Your turn begins, and you are at half or fewer Hit Points.",
        "target": "self",
        "desc": "Your blood boils when you take a beating, and you throw caution to the wind to finish the fight. You gain a +2 circumstance bonus to attack rolls, a -2 penalty to AC, and a -1 penalty to saves. These bonuses and penalties last until your Rage ends or until you are above half Hit Points, whichever comes first.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Reckless Abandon",
                "source": "Reckless Abandon"
            }
        ]
    },
    {
        "name": "Perfect Clarity",
        "actions": "Reaction",
        "traits": [
            "Barbarian",
            "Concentrate",
            "Fortune",
            "Rage"
        ],
        "trigger": "You fail or critically fail an attack roll or Will save.",
        "toggle": true,
        "maxDuration": 1,
        "target": "self",
        "desc": "You burn out all of your rage to ensure that your attack lands and your mind remains free. Reroll the triggering attack roll or Will save with a +2 circumstance bonus, use the better result, and resolve the effect. You then immediately stop raging.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Perfect Clarity",
                "source": "Perfect Clarity"
            }
        ]
    },
    {
        "name": "Vicious Evisceration",
        "actions": "2A",
        "traits": [
            "Barbarian",
            "Rage"
        ],
        "target": "other",
        "desc": "You make a vicious attack that maims your enemy. Make a melee Strike. If the Strike hits and deals damage, the target is drained 1, or drained 2 on a critical success."
    },
    {
        "name": "Annihilating Swing",
        "actions": "2A",
        "traits": [
            "Uncommon",
            "Barbarian"
        ],
        "frequency": "once per 10 minutes",
        "cooldown": 1000,
        "target": "other",
        "desc": "You have learned from the brute destructive power of xulgaths and their kind. You make a melee Strike that ignores any resistances the target has. If you target a solid unattended object or surface with your Strike, you might automatically destroy it without an attack roll. If you target any object or surface with Hardness 20 or less that isn't a magic item or the effect of a spell, you destroy it. If the target object or surface is a magic item or the effect of a spell, you attempt to counteract it using your attack bonus with the Strike for the counteract check. On a successful counteract check, you destroy the object or surface unless it has Hardness greater than 20, is an artifact, or is similarly difficult to destroy. You destroy up to a 5-foot cube of an object or surface larger than Medium."
    },
    {
        "name": "Invulnerable Juggernaut",
        "actions": "Reaction",
        "inputRequired": "Activate this activity instead of applying the damage that would reduce you to 0 Hit Points.",
        "traits": [
            "Uncommon",
            "Barbarian"
        ],
        "trigger": "You would be reduced to 0 Hit Points.",
        "target": "self",
        "desc": "You end your rage to stay at 1 Hit Point. You become wounded 2 (or increase your wounded condition by 2 if you are already wounded).",
        "gainConditions": [
            {
                "addValue": 2,
                "name": "Wounded",
                "source": "Invulnerable Juggernaut"
            }
        ],
        "onceEffects": [
            {
                "affected": "HP",
                "value": "(-(Current_HP() - 1))"
            }
        ]
    },
    {
        "name": "Quaking Stomp",
        "actions": "1A",
        "traits": [
            "Barbarian",
            "Manipulate",
            "Rage"
        ],
        "frequency": "once per 10 minutes",
        "cooldown": 1000,
        "target": "area",
        "desc": "You stomp the ground with such force that it creates a minor earthquake, with the effects of the earthquake spell.",
        "castSpells": [
            {
                "_className": "SpellCast",
                "level": 8,
                "name": "Earthquake"
            }
        ]
    },
    {
        "name": "Form Control",
        "actions": "1A",
        "traits": [
            "Druid",
            "Manipulate",
            "Metamagic"
        ],
        "target": "self",
        "desc": "With additional care and effort, you can take on an alternate form for a longer period of time. If your next action is to cast wild shape, wild shape's spell level is 2 lower than normal (minimum 1st level), but you can remain transformed for up to 1 hour or the listed duration (whichever is longer). You can still Dismiss the form at any time, as permitted by the spell.",
        "gainConditions": [
            {
                "duration": 5,
                "name": "Form Control",
                "source": "Form Control"
            }
        ]
    },
    {
        "name": "Storm Retribution",
        "actions": "Reaction",
        "traits": [
            "Druid"
        ],
        "requirements": "You have at least 1 available Focus Point.",
        "trigger": "An opponent adjacent to you critically hits you with a melee weapon or melee unarmed attack.",
        "target": "other",
        "desc": "You lash out, directing a burst of storming fury toward a creature that has harmed you. You cast tempest surge on the triggering opponent and push that creature, moving it 5 feet away from you if it fails its Reflex save, or 10 feet if it critically fails. This movement is forced movement.",
        "onceEffects": [
            {
                "affected": "Focus Points",
                "value": "-1"
            }
        ],
        "castSpells": [
            {
                "_className": "SpellCast",
                "level": 0,
                "name": "Tempest Surge"
            }
        ]
    },
    {
        "name": "Shroud of Flame",
        "actions": "1A",
        "traits": [
            "Aura",
            "Evocation",
            "Fire",
            "Primal"
        ],
        "toggle": true,
        "target": "self",
        "desc": "(Phoenix form only) You gain a 20 feet aura of fire that extends out from you. A creature that enters or ends its turn within the aura takes |dice=2d6 Fire| 2d6 fire damage (|dice=3d6 Fire| 3d6 on 9th level monstrosity form). A creature can take this damage only once per turn. You can use a single action, which has the concentrate trait, to activate or deactivate this aura.",
        "gainConditions": [
            {
                "name": "Shroud of Flame",
                "source": "Shroud of Flame"
            }
        ]
    },
    {
        "name": "Spine Rake",
        "actions": "2A",
        "traits": [
            "Move"
        ],
        "target": "area",
        "desc": "(Sea serpent form only) You extend your spines and Swim or Stride. Each creature you're adjacent to at any point during your movement takes |dice=4d8 + 10 S| 4d8+10 slashing damage (|dice=5d8 + 10 S| 5d8+10 on 9th level monstrosity form) (basic Reflex against your spell DC)."
    },
    {
        "name": "Trample",
        "actions": "3A",
        "target": "area",
        "desc": "(Kaiju form only) You move up to double your Speed and move through the spaces of Huge or smaller creatures, trampling each creature whose space you enter. A trampled creature takes foot damage (|dice=6d6 + 10 B| 6d6+10 bludgeoning) with a basic Reflex save against your spell DC."
    },
    {
        "name": "Healing Transformation",
        "actions": "1A",
        "inputRequired": "Restore 1d6 Hit Points per spell level to the target creature when you cast the polymorph spell.",
        "traits": [
            "Druid",
            "Metamagic"
        ],
        "target": "self",
        "desc": "You can take advantage of shapechanging magic to close wounds and patch injuries. If your next action is to cast a non-cantrip polymorph spell that targets only one creature, your polymorph spell also restores |dice=1d6| 1d6 Hit Points per spell level to that creature. This is a healing effect."
    },
    {
        "name": "Pesh Skin",
        "actions": "1A",
        "traits": [
            "Uncommon",
            "Druid",
            "Morph"
        ],
        "requirements": "You are transformed into a plant by a polymorph spell.",
        "target": "self",
        "desc": "Your plant form sprouts hundreds of spines, and your blood causes mild hallucinations in creatures exposed to it. Each time a creature touches you, hits you with an unarmed attack, or hits you with a melee weapon attack while adjacent to you, that creature takes |dice=1d6 P| 1d6 piercing damage. Increase the damage to |dice=2d6 P| 2d6 if the polymorph spell is 8th level or higher, or to |dice=3d6 P| 3d6 if it's 10th level.\n\nWhen an adjacent creature damages you with piercing or slashing damage, it must succeed at a Fortitude save against your class DC or become stupefied 1 (or stupefied 2 on a critical failure) until the end of its next turn.\n\nThese benefits last until you're no longer polymorphed into a plant.",
        "gainConditions": [
            {
                "duration": -1,
                "name": "Pesh Skin",
                "source": "Pesh Skin"
            }
        ]
    },
    {
        "name": "Verdant Metamorphosis: Tree Shape",
        "actions": "1A",
        "traits": [
            "Concentrate"
        ],
        "target": "self",
        "desc": "You can change from a form that looks mostly like your old self into a tree or any other non-creature plant as a single action, which has the concentrate trait. This has the same effect as tree shape, except you can turn into any kind of non-creature plant and your AC is 30.",
        "gainConditions": [
            {
                "duration": 48000,
                "name": "Tree Shape (Verdant Metamorphosis)",
                "source": "Verdant Metamorphosis: Tree Shape"
            }
        ]
    },
    {
        "name": "Impaling Briars: Impale",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Manipulate"
        ],
        "frequency": "once per round",
        "cooldown": 10,
        "target": "other",
        "desc": "Once per round, you can direct the briars to impale any target in the area (or flying up to 20 feet above the area) that you can see by using a single action, which has the concentrate and manipulate traits. Make a spell attack roll. On a success, the target takes |dice=10d6| 10d6 piercing damage and takes a -10-foot circumstance penalty to all Speeds for 1 round; on a critical success, the target is immobilized for 1 round unless it Escapes."
    },
    {
        "name": "Leyline Conduit",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Druid",
            "Manipulate",
            "Metamagic"
        ],
        "toggle": true,
        "frequency": "once per minute",
        "cooldown": 100,
        "maxDuration": 1,
        "target": "self",
        "desc": "You can cast your spells effortlessly by tapping into the leylines of the world. If your next action is to Cast a Spell of 5th level or lower that has no duration, you don't expend the prepared spell as you cast it.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Leyline Conduit",
                "source": "Leyline Conduit"
            }
        ]
    },
    {
        "name": "True Shapeshifter",
        "actions": "2A",
        "inputRequired": "You can always freely change the form you chose with wild shape. This gives you in-game permission to do so, but you may need to change its duration manually. It can be quicker to dismiss the spell, cast it again and return the focus point.",
        "traits": [
            "Concentrate",
            "Druid"
        ],
        "target": "self",
        "desc": "You transcend the limitations of form. While under the effects of wild shape, you can change into any other form on your wild shape list; if the durations of the forms would vary, use the shorter of the two durations."
    },
    {
        "name": "True Shapeshifter: Nature Incarnate",
        "actions": "2A",
        "traits": [
            "Concentrate",
            "Druid"
        ],
        "frequency": "once per day",
        "cooldown": 144000,
        "target": "self",
        "desc": "Once per day, you can transform into a kaiju, with the effects of nature incarnate; if you have Plant Shape, you can instead transform into a green man.",
        "gainConditions": [
            {
                "duration": 0,
                "name": "True Shapeshifter",
                "source": "True Shapeshifter"
            }
        ],
        "showSpells": [
            {
                "level": "10",
                "name": "Nature Incarnate"
            }
        ]
    },
    {
        "name": "Verdant Presence",
        "actions": "Reaction",
        "traits": [
            "Uncommon",
            "Druid"
        ],
        "frequency": "once per hour",
        "cooldown": 6000,
        "target": "self",
        "desc": "The life-giving properties of the aeon orbs flourish within you. Small plants or fungi magically appear on all surfaces in a 60-foot emanation around you. This life withers after 1 day unless the environment can support it. You can choose one of the following options each time you use this feat.\n\nYou can cause any number of 5-foot squares in the area to be light undergrowth, which is difficult terrain and provides lesser cover.\nYou can cause a tree or giant mushroom to appear in any unoccupied location in the area; it occupies an entire 5-foot square and provides standard cover. The tree or mushroom has 5 Hardness and 50 Hit Points.",
        "gainConditions": [
            {
                "duration": 144000,
                "name": "Verdant Presence",
                "source": "Verdant Presence"
            }
        ]
    },
    {
        "name": "Storm Lord: Call Lightning Bolt",
        "actions": "1A",
        "traits": [
            "Concentrate",
            "Manipulate"
        ],
        "frequency": "once per round",
        "cooldown": 10,
        "target": "other",
        "desc": "Once per round you can use a single action, which has the concentrate and manipulate traits, to call down a bolt of lightning, striking any target in range that you can see. You deal 10d6 electricity damage to the target; it must attempt a basic Reflex save. On a failure, it is also deafened for 1 round."
    },
    {
        "name": "Counterspell (Spontaneous)",
        "actions": "Reaction",
        "inputRequired": "You can use the triggering spell as a counterspell in your spell list.",
        "traits": [
            "Abjuration",
            "Sorcerer"
        ],
        "requirements": "You have an unexpended spell slot you could use to cast the triggering spell.",
        "trigger": "A creature Casts a Spell that you have prepared.",
        "target": "other",
        "desc": "When a foe Casts a Spell and you can see its manifestations, you can use your own magic to disrupt it. You expend one of your spell slots to counter the triggering creature's casting of a spell that you have in your repertoire. You lose your spell slot as if you had cast the triggering spell. You then attempt to counteract the triggering spell.\n\nThis feat has the trait corresponding to the tradition of spells you cast (arcane, divine, occult, or primal)."
    },
    {
        "name": "Interweave Dispel",
        "actions": "1A",
        "inputRequired": "Cast dispel magic from your spell repertoire as a free action.",
        "traits": [
            "Metamagic",
            "Sorcerer"
        ],
        "target": "self",
        "desc": "You weave dispelling energy into a spell, sending both effects at a foe. If your next action is to cast a single-target spell against a creature, and you either hit the foe with the spell attack roll or the foe fails its saving throw, you can cast dispel magic on the foe as a free action, expending a spell slot as normal and targeting one spell effect affecting the foe."
    },
    {
        "name": "Bloodline Conduit",
        "actions": "1A",
        "traits": [
            "Metamagic",
            "Sorcerer"
        ],
        "toggle": true,
        "frequency": "once per minute",
        "cooldown": 100,
        "maxDuration": 1,
        "target": "self",
        "desc": "Your inborn magical nature lets you redirect ambient energies to fuel your spells. If your next action is to Cast a Spell of 5th level or lower that has no duration, you don't expend the spell's slot when you cast it.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Bloodline Conduit",
                "source": "Bloodline Conduit"
            }
        ]
    },
    {
        "name": "Tenacious Blood Magic",
        "actions": "Free",
        "inputRequired": "Manually change the duration of the blood magic effect.",
        "traits": [
            "Uncommon",
            "Sorcerer"
        ],
        "trigger": "You apply an effect from your blood magic that lasts for 1 round.",
        "frequency": "once per minute",
        "cooldown": 100,
        "target": "self",
        "desc": "You have learned how to invest magic more deeply by witnessing Aroden's works. The triggering blood magic effect lasts for 1 minute instead of 1 round."
    },
    {
        "name": "Crushing Despair: Fail Save",
        "target": "self",
        "desc": "While crushing despair is active, you must attempt another save against the spell at the start of your turn; on a failure, you are slowed 1 for that turn as you sob uncontrollably.",
        "gainConditions": [
            {
                "duration": 5,
                "name": "Slowed",
                "source": "Crushing Despair: Failed Save",
                "value": 1
            }
        ]
    }
]