[
    {
        "name": "Sacred Defense",
        "actions": "1A",
        "inputRequired": "Add and remove the appropriate amount of temporary Hit Points after determining the success.",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Divine",
            "General",
            "Skill"
        ],
        "frequency": "once per hour",
        "cooldown": 6000,
        "target": "self",
        "showonSkill": "Religion",
        "desc": "You call upon your deity to grant you their protective blessing. Attempt a DC 30 Religion check. If you have legendary proficiency in Religion, you can instead attempt a DC 40 Religion check to increase the temporary Hit Points you gain on a successful check to 15 (25 on a critical success).",
        "critsuccess": "You gain 10 temporary Hit Points. You lose any remaining temporary Hit Points after 1 minute.",
        "success": "You gain 5 temporary Hit Points. You lose any remaining temporary Hit Points after 1 minute.",
        "critfailure": "Your deity withholds their blessing. You cannot attempt to call to your deity again for 1 day."
    },
    {
        "name": "Sanctify Water",
        "actions": "1A",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "General",
            "Skill"
        ],
        "target": "object",
        "desc": "You imbue water with your deity's blessing. Choose a container of water on your person that is of light Bulk. For 1 round, if you or an ally throw this container at a foe, it has the damaging effects of holy water (if you follow a good deity) or unholy water (if you follow an evil deity). The water's transient power doesn't make it gain any value, allow it to be used to supply the cost for a spell or ritual, and so on. If you have legendary proficiency in Religion, you can sanctify three containers held by you or allies within your reach instead of one.\n\nPFS Note: When using Sanctify Water use your proficiency with simple weapons to determine your attack bonus when throwing the blessed container of water. If you give the container to another character for them to throw, they use their proficiency with improvised weapons instead."
    },
    {
        "name": "Battle Prayer",
        "actions": "1A",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Divine",
            "General",
            "Skill"
        ],
        "target": "other",
        "showonSkill": "Religion",
        "desc": "Calling out to your deity, you recite scripture to harm a foe. Attempt a Religion check against the Will DC of a foe within 30 feet. The foe is then temporarily immune to Battle Prayers from your deity for 1 day.",
        "critsuccess": "You deal |dice=2d6| 2d6 damage of the chosen alignment type, or |dice=6d6| 6d6 damage if you have legendary proficiency in Religion.",
        "success": "You deal 1d6 damage of the chosen alignment type, or 3d6 damage if you have legendary proficiency in Religion.",
        "failure": "There is no effect.",
        "critfailure": "The backlash of your foe's will against your prayer prevents you from using Battle Prayer again for 10 minutes."
    },
    {
        "name": "Evangelize",
        "actions": "1A",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Auditory",
            "General",
            "Linguistic",
            "Mental",
            "Skill"
        ],
        "target": "other",
        "showonSkill": "Diplomacy",
        "desc": "You point out a detail that incontrovertibly supports your faith, causing a listener's mind to whirl. Attempt a Diplomacy check and compare the result to the Will DC of a single target that can hear you and understands your language; that target is then temporarily immune to Evangelize with respect to your deity or philosophy for 1 day. A creature that already agrees with you is unaffected, and at the GM's discretion, a target that genuinely changes its perspective to support your faith as a result of the argument is also otherwise unaffected.",
        "critsuccess": "The target is stupefied 2 for 1 round.",
        "success": "The target is stupefied 1 for 1 round.",
        "failure": "The target is unaffected."
    },
    {
        "name": "Reflective Scales Discharge",
        "actions": "2A",
        "activationType": "Concentrate, Manipulate",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Concentrate",
            "Manipulate"
        ],
        "target": "area",
        "desc": "The reflective scales store up energy as they protect you. Keep track of how much damage the scales have prevented. You explode your scales outward in a 20-foot radius around you, dealing |dice=1d6| 1d6 damage of the chosen type to all creatures in the area for every 10 damage the scales have prevented, to a maximum of 10d6 damage (plus 5d6 for every 2 levels after 4th) after preventing 100 damage (plus 50 for every 2 levels after 4th). Once you do so, the spell ends.",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Reflective Scales Discharge",
                "targetFilter": "caster"
            }
        ]
    },
    {
        "name": "Draconic Barrage Energy Missile",
        "actions": "1A",
        "activationType": "Concentrate",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Attack",
            "Concentrate"
        ],
        "target": "self",
        "desc": "You have shaped energy into <var>var1</var>. The specific dragon is random; roll 1d6 on the table below for each dragon evoked to determine which type of dragon you create. While the spell persists, you can command one of your dragons to spit a missile of energy at a creature within 60 feet by using a single action, which has the concentrate trait. This is a ranged Strike that uses your spell attack bonus and deals |dice=var2 + spellMod| <var>var2</var> damage plus your spellcasting ability modifier, with the damage type depending on the dragon. A dragon's breath Strike uses and contributes to your multiple attack penalty. Once a dragon has used its breath Strike, it winks out of existence; when you have no dragons remaining, the spell ends.\n\n<strong>1</strong> Copper or black dragon, Acid breath\n<strong>2</strong> Silver or white dragon, Cold breath\n<strong>3</strong> Bronze or blue dragon, Electricity breath\n<strong>4</strong> Brass, gold, or red dragon, Fire breath\n<strong>5</strong> Green Dragon, Poison breath\n<strong>6</strong> Your choice of dragon, breath type as the dragon",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Draconic Barrage Energy Missile"
            }
        ],
        "heightenedDescs": [
            {
                "level": 1,
                "descs": [
                    {
                        "value": "one incorporeal tiny dragon (or serpentine creature) that flits around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "1d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 2,
                "descs": [
                    {
                        "value": "two incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "2d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 3,
                "descs": [
                    {
                        "value": "three incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "3d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 4,
                "descs": [
                    {
                        "value": "four incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "4d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 5,
                "descs": [
                    {
                        "value": "five incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "5d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 6,
                "descs": [
                    {
                        "value": "six incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "6d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 7,
                "descs": [
                    {
                        "value": "seven incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "7d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 8,
                "descs": [
                    {
                        "value": "eight incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "8d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 9,
                "descs": [
                    {
                        "value": "nine incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "9d6",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 10,
                "descs": [
                    {
                        "value": "ten incorporeal tiny dragons (or serpentine creatures) that flit around you.",
                        "variable": "var1"
                    },
                    {
                        "value": "10d6",
                        "variable": "var2"
                    }
                ]
            }
        ]
    },
    {
        "name": "Bottle the Storm Discharge",
        "actions": "1A",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Attack"
        ],
        "target": "self",
        "desc": "When lightning was turned at you, you stored the charge safely within yourself, unleashing it when the time is right. If you have successfully prevented damage with the electricity resistance granted by bottle the storm, at any time during the spell's duration, you can spend a single action, which has the attack trait, to expend the charge and make a melee spell attack at an adjacent target or a ranged spell attack at a target within 60 feet.<var>var2</var> This attack deals electricity damage equal to the damage prevented by bottle the storm.",
        "gainConditions": [
            {
                "duration": 0,
                "name": "Bottle the Storm Discharge"
            }
        ],
        "heightenedDescs": [
            {
                "level": 4,
                "descs": [
                    {
                        "value": "10",
                        "variable": "var1"
                    },
                    {
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 7,
                "descs": [
                    {
                        "value": "15",
                        "variable": "var1"
                    },
                    {
                        "value": " You can immediately make the spell attack roll granted by bottle the storm as part of the reaction used to cast the spell.",
                        "variable": "var2"
                    }
                ]
            },
            {
                "level": 10,
                "descs": [
                    {
                        "value": "20",
                        "variable": "var1"
                    },
                    {
                        "value": " You can immediately make the spell attack roll granted by bottle the storm as part of the reaction used to cast the spell.",
                        "variable": "var2"
                    }
                ]
            }
        ]
    },
    {
        "name": "Diamond Dust Bonus",
        "inputRequired": "You can target any ally with this activity that should gain the status bonus against a light effect scattered by the diamond dust cloud.",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "target": "area",
        "desc": "You have supercooled the nearby air, forming a cloud of dancing ice crystals in an emanation around you. The crystals scatter and refract light; if a light effect enters diamond dust's area, any creatures that effect goes on to affect gain a +2 status bonus to AC and saves against it.",
        "gainConditions": [
            {
                "duration": 1,
                "name": "Diamond Dust Bonus"
            }
        ]
    },
    {
        "name": "Font of Serenity: Touch the Font",
        "actions": "1A",
        "activationType": "Interact",
        "inputRequired": "The spell attempts to counteract one emotion effect affecting the targeted ally.",
        "sourceBook": "Gods & Magic",
        "_extensionFileName": "godsAndMagic",
        "traits": [
            "Interact"
        ],
        "target": "ally",
        "desc": "A divine beacon radiates serenity, soothing you and nearby allies. You can touch the font as an Interact action; if you do so, the spell attempts to counteract one emotion effect affecting the ally of your choice, after which that emotion effect is temporarily immune for 1 day. If the spell succeeds at the counteract check, it removes the emotion effect from your ally, though not from any other creatures the effect might be affecting.",
        "gainConditions": [
            {
                "duration": -5,
                "name": "Font of Serenity Counteract Immunity"
            }
        ]
    }
]
