[
    {
        "name": "Flurry of Blows",
        "actions": "1",
        "desc": "Make two unarmed Strikes. If both hit the same creature, combine their damage for the purpose of resistances and weaknesses. Apply your multiple attack penalty to the Strikes normally. As it has the flourish trait, you can use Flurry of Blows only once per turn.",
        "traits": [
            "Flourish",
            "Monk"
        ]
    },
    {
        "name": "Whirling Throw",
        "actions": "1",
        "requirements": "You have a creature grabbed or restrained.",
        "desc": "You propel your grabbed or restrained foe a great distance. You can throw the creature any distance up to 10 feet, plus 5 feet × your Strength modifier. If you successfully throw the creature, it takes bludgeoning damage equal to your Strength modifier plus 1d6 per 10 feet you threw it.\n\nAttempt an Athletics check against the foe’s Fortitude DC. You take a –2 circumstance penalty to your check if the target is one size larger than you and a –4 circumstance penalty if it’s larger than that. You gain a +2 circumstance bonus to your check if the target is one size smaller than you and a +4 circumstance bonus if it’s smaller than that.",
        "critsuccess": "You throw the creature the desired distance and it lands prone.",
        "success": "You throw the creature the desired distance.",
        "failure": "You don’t throw the creature.",
        "critfailure": "You don’t throw the creature, and it’s no longer grabbed or restrained by you.",
        "traits": [
            "Flourish",
            "Monk"
        ]
    },
    {
        "name": "Crane Stance",
        "actions": "1",
        "toggle":true,
        "requirements": "You are unarmored.",
        "desc": "You enter the stance of a crane, holding your arms in an imitation of a crane’s wings and using flowing, defensive motions. You gain a +1 circumstance bonus to AC, but the only Strikes you can make are crane wing attacks. These deal 1d6 bludgeoning damage; are in the brawling group; and have the agile, finesse, nonlethal, and unarmed traits.\n\nWhile in Crane Stance, reduce the DC for High Jump and Long Jump by 5, and when you Leap, you can move an additional 5 feet horizontally or 2 feet vertically.",
        "hint": "While in Crane Stance, reduce the DC for High Jump and Long Jump by 5, and when you Leap, you can move an additional 5 feet horizontally or 2 feet vertically.",
        "gainItems": [
            {
                "name": "Crane Wing",
                "type": "weapons"
            }
        ],
        "showon": "Athletics",
        "traits": [
            "Monk",
            "Stance"
        ]
    },
    {
        "name": "Orc Ferocity",
        "actions": "Reaction",
        "frequency": "once per day",
        "cooldown": 144000,
        "desc": "Fierceness in battle runs through your blood, and you refuse to fall from your injuries. You avoid being knocked out and remain at 1 Hit Point, and your wounded condition increases by 1.",
        "traits": [
            "Orc"
        ],
        "gainConditions": [
            {
                "name": "Wounded",
                "addValue": 1,
                "source": "Orc Ferocity"
            }
        ],
        "onceEffects": [
            {
                "affected": "HP",
                "value": "-(currentHP - 1)"
            }
        ]
    },
    {
        "name": "Battle Medicine",
        "actions": "1",
        "desc": "You can patch up yourself or an adjacent ally, even in combat. Attempt a Medicine check with the same DC as for Treat Wounds, and restore a corresponding amount of Hit Points; this does not remove the wounded condition. As with Treat Wounds, you can attempt checks against higher DCs if you have the minimum proficiency rank. The target is then temporarily immune to your Battle Medicine for 1 day.",
        "traits": [
            "General",
            "Healing",
            "Manipulate",
            "Skill"
        ]
    },
    {
        "name": "Juggle",
        "actions": "1",
        "desc": "You can Juggle items and still use your hands between tosses. You can use the Juggle action in several ways.\n\nYou can start to Juggle with a single stored item, an item you were carrying, or an unattended item within your reach. The item must be of light or negligible Bulk. You Juggle the item until the end of your next turn, unless you use this feat against next turn to continue Juggling (see below). While you are Juggling, you can use this action again to add another item to the Juggle, which must meet all the same requirements. You can Juggle a number of items equal to one more than the number of hands you are using to Juggle.\n\nYou can also use this action to continue Juggling as long as you aren’t fatigued. When you do, you continue to Juggle until the end of your next turn. If you do not continue Juggling by the end of your turn, you cease Juggling and you drop all the items. You become fatigued if you continue Juggling for more than 10 minutes (60 rounds) within the course of an hour.\n\nAs long as you’re Juggling fewer than your maximum number of items, you have a free hand. You can wield weapons you are Juggling (but not shields or other items) as long as they can be wielded in one hand. For example, while you Juggle a dagger in one hand and wield a shield in the other, you are wielding the dagger but still have a free hand to Cast a Spell with a material component. Juggling two or more weapons with one hand doesn’t allow you to use feats that require two weapons each held in a different hand.",
        "traits": [
            "Uncommon",
            "Concentrate",
            "General",
            "Manipulate",
            "Skill"
        ]
    },
    {
        "name": "Kip Up",
        "actions": "Free",
        "desc": "You stand up. This movement doesn’t trigger reactions.",
        "traits": [
            "General",
            "Skill"
        ]
    },
    {
        "name": "Legendary Negotiation",
        "actions": "3",
        "desc": "You can negotiate incredibly quickly in adverse situations. You attempt to Make an Impression and then Request your opponent cease their current activity and engage in negotiations. You take a –5 penalty to your Diplomacy check. The GM sets the DC of the Request based on the circumstances—it’s generally at least a very hard DC of the creature’s level. Some creatures might simply refuse, and even those who agree to parley might ultimately find your arguments lacking and return to violence.",
        "traits": [
            "General",
            "Skill"
        ]
    },
    {
        "name": "Recognize Spell",
        "actions": "Reaction",
        "trigger": "A creature within line of sight casts a spell that you don’t have prepared or in your spell repertoire, or a trap or similar object casts such a spell. You must be aware of the casting.",
        "desc": "If you are trained in the appropriate skill for the spell’s tradition and it’s a common spell of 2nd level or lower, you automatically identify it (you still roll to attempt to get a critical success, but can’t get a worse result than success). The highest level of spell you automatically identify increases to 4 if you’re an expert, 6 if you’re a master, and 10 if you’re legendary. The GM rolls a secret Arcana, Nature, Occultism, or Religion check, whichever corresponds to the tradition of the spell being cast. If you’re not trained in the skill, you can’t get a result better than failure.",
        "critsuccess": "You correctly recognize the spell and gain a +1 circumstance bonus to your saving throw or your AC against it.",
        "success": "You correctly recognize the spell.",
        "failure": "You fail to recognize the spell.",
        "critfailure": "You misidentify the spell as another spell entirely, of the GM’s choice.",
        "traits": [
            "General",
            "Secret",
            "Skill"
        ]
    },
    {
        "name": "Sacred Defense",
        "actions": "1",
        "frequency": "once per hour",
        "cooldown": 6000,
        "desc": "You call upon your deity to grant you their protective blessing. Attempt a DC 30 Religion check. If you have legendary proficiency in Religion, you can instead attempt a DC 40 Religion check to increase the temporary Hit Points you gain on a successful check to 15 (25 on a critical success).",
        "critsuccess": "You gain 10 temporary Hit Points. You lose any remaining temporary Hit Points after 1 minute.",
        "success": "You gain 5 temporary Hit Points. You lose any remaining temporary Hit Points after 1 minute.",
        "critfailure": "Your deity withholds their blessing. You cannot attempt to call to your deity again for 1 day.",
        "inputRequired": "Add and remove any temporary Hit Points after determining the success.",
        "traits": [
            "Divine",
            "General",
            "Skill"
        ]
    },
    {
        "name": "Sanctify Water",
        "actions": "1",
        "desc": "You imbue water with your deity’s blessing. Choose a container of water on your person that is of light Bulk. For 1 round, if you or an ally throw this container at a foe, it has the damaging effects of holy water (if you follow a good deity) or unholy water (if you follow an evil deity). The water’s transient power doesn’t make it gain any value, allow it to be used to supply the cost for a spell or ritual, and so on. If you have legendary proficiency in Religion, you can sanctify three containers held by you or allies within your reach instead of one.\n\nPFS Note: When using Sanctify Water use your proficiency with simple weapons to determine your attack bonus when throwing the blessed container of water. If you give the container to another character for them to throw, they use their proficiency with improvised weapons instead.",
        "traits": [
            "General",
            "Skill"
        ]
    }
]