[
    {
        "type": "armors",
        "name": "Unarmored",
        "prof": "Unarmored",
        "moddable": "-"
    },
    {
        "type": "armors",
        "price": 10,
        "bulk": "L",
        "name": "Explorer's Clothing",
        "desc": "Adventurers who don’t wear armor travel in durable clothing. Though it’s not armor and uses your unarmored defense proficiency, it still has a Dex Cap and can grant an item bonus to AC if etched with potency runes.",
        "prof": "Unarmored",
        "dexcap": 5,
        "traits": [
            "Comfort"
        ]
    },
    {
        "type": "armors",
        "price": 20,
        "bulk": "L",
        "name": "Padded Armor",
        "desc": "This armor is simply a layer of heavy, quilted cloth, but it is sometimes used because it’s so inexpensive. Padded armor is easier to damage and destroy than other types of armor. Heavy armor comes with a padded armor undercoat included in its Price, though it loses the comfort trait when worn under heavy armor. You can wear just that padded armor undercoat to sleep in, if your heavy armor is destroyed, or when otherwise not wearing the full heavy armor. This allows you to keep the armor invested and benefit from the power of any runes on the associated heavy armor, but no one else can wear your heavy armor without the padded undercoat.",
        "prof": "Light Armor",
        "dexcap": 3,
        "strength": 10,
        "acbonus": 1,
        "traits": [
            "Comfort"
        ]
    },
    {
        "type": "armors",
        "price": 200,
        "bulk": "1",
        "name": "Leather Armor",
        "desc": "A mix of flexible and molded boiled leather, a suit of this type of armor provides some protection with maximum flexibility.",
        "prof": "Light Armor",
        "dexcap": 4,
        "skillpenalty": -1,
        "strength": 10,
        "acbonus": 1,
        "traits": []
    },
    {
        "type": "armors",
        "price": 300,
        "bulk": "1",
        "name": "Studded Leather Armor",
        "desc": "This leather armor is reinforced with metal studs and sometimes small metal plates, providing most of the flexibility of leather armor with more robust protection.",
        "prof": "Light Armor",
        "dexcap": 3,
        "skillpenalty": -1,
        "strength": 12,
        "acbonus": 2,
        "traits": []
    },
    {
        "type": "armors",
        "price": 500,
        "bulk": "1",
        "name": "Chain Shirt",
        "desc": "Sometimes called a hauberk, this is a long shirt constructed of the same metal rings as chainmail. However, it is much lighter than chainmail and protects only the torso, upper arms, and upper legs of its wearer.",
        "prof": "Light Armor",
        "dexcap": 3,
        "skillpenalty": -1,
        "strength": 12,
        "acbonus": 2,
        "traits": [
            "Flexible",
            "Noisy"
        ]
    },
    {
        "type": "armors",
        "price": 200,
        "bulk": "2",
        "name": "Hide Armor",
        "group": "Leather",
        "desc": "A mix of furs, sturdy hide, and sometimes molded boiled leather, this armor provides protection due to its layers of leather, though its bulkiness slows the wearer down and decreases mobility.",
        "prof": "Medium Armor",
        "dexcap": 2,
        "skillpenalty": -2,
        "speedpenalty": -5,
        "strength": 14,
        "acbonus": 3,
        "traits": []
    },
    {
        "type": "armors",
        "price": 400,
        "bulk": "2",
        "name": "Scale Mail",
        "group": "Composite",
        "desc": "Scale mail consists of many metal scales sewn onto a reinforced leather backing, often in the form of a long shirt that protects the torso, arms, and legs.",
        "prof": "Medium Armor",
        "dexcap": 2,
        "skillpenalty": -2,
        "speedpenalty": -5,
        "strength": 14,
        "acbonus": 3,
        "traits": []
    },
    {
        "type": "armors",
        "price": 600,
        "bulk": "2",
        "name": "Chain Mail",
        "group": "Chain",
        "desc": "A suit of chain mail consists of several pieces of armor composed of small metal rings linked together in a protective mesh. It typically includes a chain shirt, leggings, a pair of arms, and a coif, collectively protecting most of the body.",
        "prof": "Medium Armor",
        "dexcap": 1,
        "skillpenalty": -2,
        "speedpenalty": -5,
        "strength": 16,
        "acbonus": 4,
        "traits": [
            "Flexible",
            "Noisy"
        ]
    },
    {
        "type": "armors",
        "price": 800,
        "bulk": "2",
        "name": "Breastplate",
        "group": "Plate",
        "desc": "Though referred to as a breastplate, this type of armor consists of several pieces of plate or half-plate armor that protect the torso, chest, neck, and sometimes the hips and lower legs. It strategically grants some of the protection of plate while allowing greater flexibility and speed.",
        "prof": "Medium Armor",
        "dexcap": 1,
        "skillpenalty": -2,
        "speedpenalty": -5,
        "strength": 16,
        "acbonus": 4,
        "traits": []
    },
    {
        "type": "armors",
        "level": 1,
        "price": 1300,
        "bulk": "3",
        "name": "Splint Mail",
        "group": "Composite",
        "desc": "This type of armor is chain mail reinforced with flexible, interlocking metal plates, typically located on the wearer’s torso, upper arms, and legs. A suit of this armor comes with an undercoat of padded armor and a pair of gauntlets.",
        "prof": "Heavy Armor",
        "dexcap": 1,
        "skillpenalty": -3,
        "speedpenalty": -10,
        "strength": 16,
        "acbonus": 5,
        "gainItems": [
            {
                "name": "Gauntlet",
                "type": "weapons",
                "on": "equip"
            },
            {
                "name": "Padded Armor",
                "type": "armors",
                "on": "grant"
            }
        ],
        "traits": []
    },
    {
        "type": "armors",
        "level": 1,
        "price": 1800,
        "bulk": "3",
        "name": "Half Plate",
        "group": "Plate",
        "desc": "Half plate consists of most of the upper body plates used in full plate, with lighter or sparser steel plate protection for the arms and legs. This provides some of the protection of full plate with greater flexibility and speed. A suit of this armor comes with an undercoat of padded armor and a pair of gauntlets.",
        "prof": "Heavy Armor",
        "dexcap": 1,
        "skillpenalty": -3,
        "speedpenalty": -10,
        "strength": 16,
        "acbonus": 5,
        "gainItems": [
            {
                "name": "Gauntlet",
                "type": "weapons",
                "on": "equip"
            },
            {
                "name": "Padded Armor",
                "type": "armors",
                "on": "grant"
            }
        ],
        "traits": []
    },
    {
        "type": "armors",
        "level": 2,
        "price": 3000,
        "bulk": "4",
        "name": "Full Plate",
        "group": "Plate",
        "desc": "Plate mail consists of interlocking plates that encase nearly the entire body in a carapace of steel. It is costly and heavy, and the wearer often requires help to don it correctly, but it provides some of the best defense armor can supply. A suit of this armor comes with an undercoat of padded armor and a pair of gauntlets.",
        "prof": "Heavy Armor",
        "dexcap": 0,
        "skillpenalty": -3,
        "speedpenalty": -10,
        "strength": 18,
        "acbonus": 6,
        "gainItems": [
            {
                "name": "Gauntlet",
                "type": "weapons",
                "on": "equip"
            },
            {
                "name": "Padded Armor",
                "type": "armors",
                "on": "grant"
            }
        ],
        "traits": [
            "Bulwark"
        ]
    },
    {
        "type": "armors",
        "level": 2,
        "price": 3500,
        "bulk": "4",
        "name": "Hellknight Plate",
        "group": "Plate",
        "desc": "Few armors in the Inner Sea region are as memorable as the iconic Hellknight plate. While each order has its own flourishes, Hellknight plate is instantly recognizable to any who know of the Hellknights. Hellknights go to extreme measures to punish non-Hellknights who get their hands on Hellknight plate, and the reward is not usually worth the risk, since for non-Hellknights, the armor is functionally similar to full plate.",
        "prof": "Heavy Armor",
        "dexcap": 0,
        "skillpenalty": -3,
        "speedpenalty": -10,
        "strength": 18,
        "acbonus": 6,
        "gainItems": [
            {
                "name": "Gauntlet",
                "type": "weapons",
                "on": "equip"
            },
            {
                "name": "Padded Armor",
                "type": "armors",
                "on": "grant"
            }
        ],
        "traits": [
            "Bulwark",
            "Uncommon"
        ]
    }
]