[
    {
        "name": "Blinded",
        "type": "generic",
        "desc": "You can't see. All normal terrain is difficult terrain to you. You can't detect anything using vision. You automatically critically fail Perception checks that require you to be able to see, and if vision is your only precise sense, you take a -4 status penalty to Perception checks. You are immune to visual effects. Blinded overrides dazzled.",
        "overrideConditions": [
            "Dazzled"
        ],
        "showon": "Perception, Movement"
    },
    {
        "name": "Concealed",
        "type": "generic",
        "buff": true,
        "desc": "While you are concealed from a creature, such as in a thick fog, you are difficult for that creature to see. You can still be observed, but you're tougher to target. A creature that you're concealed from must succeed at a DC 5 flat check when targeting you with an attack, spell, or other effect. Area effects aren't subject to this flat check. If the check fails, the attack, spell, or effect doesn't affect you.",
        "showon": "AC"
    },
    {
        "name": "Clumsy",
        "hasValue": true,
        "type": "generic",
        "desc": "Your movements become clumsy and inexact. Clumsy always includes a value. You take a status penalty equal to the condition value to Dexterity-based checks and DCs, including AC, Reflex saves, ranged attack rolls, and skill checks using Acrobatics, Stealth, and Thievery.",
        "showon": "Dexterity",
        "effects": [
            {
                "affected": "AC",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Reflex",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Dexterity Attacks",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Acrobatics",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Stealth",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Thievery",
                "value": "-(object.value)",
                "type": "status"
            }
        ]
    },
    {
        "name": "Doomed",
        "hasValue": true,
        "type": "generic",
        "desc": "A powerful force has gripped your soul, calling you closer to death. Doomed always includes a value. The dying value at which you die is reduced by your doomed value. If your maximum dying value is reduced to 0, you instantly die. When you die, you’re no longer doomed.\n\nYour doomed value decreases by 1 each time you get a full night’s rest.",
        "effects": [
            {
                "affected": "Max Dying",
                "value": "-(object.value)"
            }
        ]
    },
    {
        "name": "Dying",
        "hasValue": true,
        "type": "generic",
        "desc": "You are bleeding out or otherwise at death's door. While you have this condition, you are unconscious. Dying always includes a value. If this value ever reaches dying 4, you die. If you're dying, you must attempt a recovery check at the start of your turn each round to determine whether you get better or worse.\n\nIf you lose the dying condition by succeeding at a recovery check and are still at 0 Hit Points, you remain unconscious, but you can wake up as described on page 460. You lose the dying condition automatically and wake up if you ever have 1 Hit Point or more. Anytime you lose the dying condition, you gain the wounded 1 condition, or increase your wounded value by 1 if you already have that condition.",
        "inputRequired": "If you're dying, you must attempt a recovery check at the start of your turn each round to determine whether you get better or worse.",
        "gainConditions": [
            {
                "name": "Unconscious",
                "source": "Dying"
            }
        ]
    },
    {
        "name": "Encumbered",
        "type": "generic",
        "desc": "You are carrying more weight than you can manage. While you're encumbered, you're clumsy 1 and take a 10-foot penalty to all your Speeds. As with all penalties to your Speed, this can't reduce your Speed below 5 feet.",
        "showon": "Movement, Bulk",
        "gainConditions": [
            {
                "name": "Clumsy",
                "value": 1,
                "source": "Encumbered",
                "applied": true
            }
        ],
        "effects": [
            {
                "affected": "Speed",
                "value": "-10"
            }
        ]
    },
    {
        "name": "Enfeebled",
        "hasValue": true,
        "type": "generic",
        "desc": "You're physically weakened. Enfeebled always includes a value. When you are enfeebled, you take a status penalty equal to the condition value to Strength-based rolls and DCs, including Strength-based melee attack rolls, Strength-based damage rolls, and Athletics checks.",
        "showon": "Strength",
        "effects": [
            {
                "affected": "Strength Attacks",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Athletics",
                "value": "-(object.value)",
                "type": "status"
            }
        ]
    },
    {
        "name": "Flat-Footed",
        "type": "generic",
        "desc": "You're distracted or otherwise unable to focus your full attention on defense. You take a -2 circumstance penalty to AC. Some effects give you the flat-footed condition only to certain creatures or against certain attacks. Others—especially conditions—can make you universally flat-footed against everything. If a rule doesn't specify that the condition applies only to certain circumstances, it applies to all of them; for example, many effects simply say “The target is flat-footed.”",
        "effects": [
            {
                "affected": "AC",
                "value": "-2",
                "type": "circumstance"
            }
        ]
    },
    {
        "name": "Frightened",
        "hasValue": true,
        "decreasingValue": true,
        "type": "generic",
        "desc": "You're gripped by fear and struggle to control your nerves. The frightened condition always includes a value. You take a status penalty equal to this value to all your checks and DCs. Unless specified otherwise, at the end of each of your turns, the value of your frightened condition decreases by 1.",
        "effects": [
            {
                "affected": "All Checks",
                "value": "-(object.value)"
            }
        ]
    },
    {
        "name": "Quickened",
        "type": "generic",
        "buff": true,
        "desc": "You gain 1 additional action at the start of your turn each round. Many effects that make you quickened specify the types of actions you can use with this additional action. If you become quickened from multiple sources, you can use the extra action you've been granted for any single action allowed by any of the effects that made you quickened. Because quickened has its effect at the start of your turn, you don't immediately gain actions if you become quickened during your turn."
    },
    {
        "name": "Unconscious",
        "type": "generic",
        "desc": "You're sleeping, or you've been knocked out. You can't act. You take a -4 status penalty to AC, Perception, and Reflex saves, and you have the blinded and flat-footed conditions. When you gain this condition, you fall prone and drop items you are wielding or holding unless the effect states otherwise or the GM determines you're in a position in which you wouldn't.\n\nIf you're unconscious because you're dying, you can't wake up as long as you have 0 Hit Points. If you're restored to 1 Hit Point or more via healing, you lose the dying and unconscious conditions and can act normally on your next turn.\n\nIf you are unconscious and at 0 Hit Points, but not dying, you naturally return to 1 Hit Point and awaken after sufficient time passes. The GM determines how long you remain unconscious, from a minimum of 10 minutes to several hours. If you receive healing during this time, you lose the unconscious condition and can act normally on your next turn.\n\nIf you're unconscious and have more than 1 Hit Point (typically because you are asleep or unconscious due to an effect), you wake up in one of the following ways. Each causes you to lose the unconscious condition.\n\nYou take damage, provided the damage doesn't reduce you to 0 Hit Points. (If the damage reduces you to 0 Hit Points, you remain unconscious and gain the dying condition as normal.)\nYou receive healing, other than the natural healing you get from resting.\nSomeone nudges or shakes you awake using an Interact action.\nLoud noise is being made around you—though this isn't automatic. At the start of your turn, you automatically attempt a Perception check against the noise's DC (or the lowest DC if there is more than one noise), waking up if you succeed. This is often DC 5 for a battle, but if creatures are attempting to stay quiet around you, this Perception check uses their Stealth DC. Some magical effects make you sleep so deeply that they don't allow you to attempt this Perception check.\nIf you are simply asleep, the GM decides you wake up either because you have had a restful night's sleep or something disrupted that rest.",
        "gainConditions": [
            {
                "name": "Blinded",
                "source": "Unconscious"
            },
            {
                "name": "Flat-Footed",
                "source": "Unconscious"
            }
        ],
        "effects": [
            {
                "affected": "AC",
                "value": "-4",
                "type": "status"
            },
            {
                "affected": "Perception",
                "value": "-4",
                "type": "status"
            },
            {
                "affected": "Reflex",
                "value": "-4",
                "type": "status"
            }
        ]
    },
    {
        "name": "Wounded",
        "hasValue": true,
        "type": "generic",
        "desc": "You have been seriously injured during a fight. Anytime you lose the dying condition, you become wounded 1 if you didn't already have the wounded condition. If you already have the wounded condition, your wounded condition value instead increases by 1. If you gain the dying condition while wounded, increase the dying condition's value by your wounded value. The wounded condition ends if someone successfully restores Hit Points to you with Treat Wounds, or if you are restored to full Hit Points and rest for 10 minutes."
    },
    {
        "name": "Dead",
        "type": "meta",
        "desc": "You are dead.",
        "overrideConditions": [
            "All"
        ]
    },
    {
        "name": "Eagle-Eye Elixir (Moderate)",
        "type": "alchemicalelixirs",
        "desc": "You gain an item bonus of +2 to Perception checks that is +3 when attempting to find secret doors and traps. ",
        "buff": true,
        "effects": [
            {
                "affected": "Perception",
                "value": "+2",
                "type": "item"
            }
        ],
        "showon": "Perception"
    },
    {
        "name": "Juggernaut Mutagen (Lesser)",
        "type": "alchemicalelixirs",
        "desc": "You gain an item bonus of +1 to Fortitude saves and 5 temporary Hit Points.\n\nYou take a -2 penalty to Will saves, Perception checks, and initiative rolls. Whenever you are at maximum Hit Points for at least 1 full minute, you regain the temporary Hit Points.",
        "inputRequired": "Whenever you are at maximum Hit Points for at least 1 full minute, you regain the temporary Hit Points.",
        "buff": true,
        "effects": [
            {
                "affected": "Fortitude",
                "value": "+1",
                "type": "item"
            },
            {
                "affected": "Will",
                "value": "-2"
            }
        ],
        "onceEffects": [
            {
                "affected": "Temporary HP",
                "value": "+5"
            }
        ]
    },
    {
        "name": "Leaper's Elixir (Lesser)",
        "type": "alchemicalelixirs",
        "desc": "You can High Jump or Long Jump as a single action instead of 2 actions. If you do, you don't perform the initial Stride (nor do you fail if you don't Stride 10 feet).",
        "buff": true,
        "showon": "Athletics"
    },
    {
        "name": "Dragon's Breath Potion (Silver, Young)",
        "type": "potions",
        "desc": "You can unleash a breath weapon as a 15-foot cone of cold that deals 4d6 cold damage. Each creature in the area must attempt a DC 23 basic Reflex save. Exhaling dragon breath uses a single action. After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "buff": true,
        "showon": "Attacks"
    },
    {
        "name": "Candle of Truth",
        "type": "otherconsumables",
        "desc": "Creatures within 10 feet of the candle receive a -4 status penalty to Lie.\n\nIn addition, when first entering the affected area, each creature (including you) must succeed at a DC 26 Will save or be unable to tell any deliberate lies while within 10 feet of the lit candle. This lasts for as long as the candle is lit.",
        "showon": "Deception"
    },
    {
        "name": "Slippers of Spider Climbing",
        "type": "wornitems",
        "desc": "You gain a 20-foot climb Speed and you don't need to use your hands to Climb. However, the slippers require decent traction for you to walk on a wall, so they provide no benefit when you're moving across greased, icy, or oiled surfaces.",
        "effects": [
            {
                "affected": "Climb Speed",
                "setValue": "20"
            }
        ],
        "buff": true,
        "showon": "Movement"
    },
    {
        "name": "Eye of the Arclords",
        "type": "activity",
        "desc": "While the eye is open, you gain the following benefits: you gain the effects of the detect magic arcane innate spell from your Arcane Sense at the start of each of your turns without needing to cast the spell; you gain darkvision; you gain a +2 status bonus to Perception checks to Seek undetected and hidden creatures and to your Perception DC against Hide and Sneak. After your third eye closes, you are dazzled for an amount of time equal to how long you had it open.",
        "inputRequired": "After your third eye closes, you are dazzled for an amount of time equal to how long you had it open.",
        "showon": "Perception",
        "senses": [
            "Darkvision"
        ],
        "buff": true
    },
    {
        "name": "Crane Stance",
        "type": "activity",
        "desc": "While in Crane Stance, reduce the DC for High Jump and Long Jump by 5, and when you Leap, you can move an additional 5 feet horizontally or 2 feet vertically.",
        "showon": "Athletics",
        "attackRestrictions": [
            "Crane Wing"
        ],
        "effects": [
            {
                "affected": "AC",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Dragon Stance",
        "type": "activity",
        "desc": "While in Dragon Stance, you can ignore the first square of difficult terrain while Striding.",
        "showon": "Movement",
        "buff": true
    },
    {
        "name": "Mountain Stance",
        "type": "activity",
        "desc": "While in Mountain Stance, you gain a +4 status bonus to AC and a +2 circumstance bonus to any defenses against being Shoved or Tripped. However, you have a Dexterity modifier cap to your AC of +0, meaning you don't add your Dexterity to your AC, and your Speeds are all reduced by 5 feet.",
        "showon": "Fortitude, Movement",
        "effects": [
            {
                "affected": "AC",
                "value": "+4",
                "type": "status"
            },
            {
                "affected": "AC",
                "value": "- Math.max(0, Math.min(Modifier('Dexterity'), DexCap()) - (Character.get_FeatsTaken(1, Level, 'Mountain Stronghold').length ? 1 : 0) - (Character.get_FeatsTaken(1, Level, 'Mountain Quake').length ? 1 : 0))"
            },
            {
                "affected": "Speed",
                "value": "-5"
            }
        ],
        "attackRestrictions": [
            "Falling Stone"
        ],
        "buff": true
    },
    {
        "name": "Rain of Embers Stance",
        "type": "activity",
        "desc": "While in Rain of Embers Stance, you gain a +1 status bonus to AC and fire resistance equal to half your level (minimum 1).",
        "effects": [
            {
                "affected": "AC",
                "value": "+1",
                "type": "status"
            },
            {
                "affected": "Fire Resistance",
                "value": "Math.max(Math.floor(Level / 2), 1)"
            }
        ],
        "attackRestrictions": [
            "Fire Talon"
        ],
        "buff": true
    },
    {
        "name": "Tiger Stance",
        "type": "activity",
        "desc": "As long as your Speed is at least 20 feet while in Tiger Stance, you can Step 10 feet.",
        "showon": "Movement",
        "buff": true
    },
    {
        "name": "Wolf Stance",
        "type": "activity",
        "desc": "If you're flanking a target while in Wolf Stance, your wolf jaw unarmed attacks also gain the trip trait.",
        "showon": "Wolf Jaw",
        "buff": true
    },
    {
        "name": "Mountain Stronghold",
        "type": "activity",
        "desc": "You gain a +2 circumstance bonus to AC until the beginning of your next turn.",
        "effects": [
            {
                "affected": "AC",
                "value": "+2",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Ironblood Stance",
        "type": "activity",
        "desc": "While in Ironblood Stance, you gain resistance 2 to all damage. The resistance increases to 3 at 12th level, to 4 at 16th level, and to 5 at 20th level.",
        "effects": [
            {
                "affected": "All Damage Resistance",
                "value": "1 + Math.floor((Level - 4) / 4)"
            }
        ],
        "buff": true
    },
    {
        "name": "Tangled Forest Stance",
        "type": "activity",
        "desc": "While you're in Tangled Forest Stance and can act, every enemy in your reach that tries to move away from you must succeed at a Reflex save, Acrobatics check, or Athletics check against your class DC or be immobilized for that action. If you prefer, you can allow the enemy to move.",
        "showon": "Athletics, Attacks, Lashing Branch",
        "buff": true
    },
    {
        "name": "Wild Winds Stance",
        "type": "spells",
        "desc": "While in wild winds stance, you gain a +2 circumstance bonus to AC against ranged attacks.",
        "showon": "AC",
        "buff": true
    },
    {
        "name": "Wind Jump",
        "type": "spells",
        "desc": "You gain a fly Speed equal to your Speed. You must end your turn on solid ground, or you fall.",
        "effects": [
            {
                "affected": "Fly Speed",
                "setValue": "Speed('Land Speed')"
            }
        ],
        "buff": true
    },
    {
        "name": "Ironblood Surge",
        "type": "activity",
        "desc": "You gain the benefits of your iron sweep's parry trait (a +1 circumstance bonus to AC until the start of your next turn) and your resistance from Ironblood Stance increases to your Strength modifier (if it's higher) for the same duration.",
        "effects": [
            {
                "affected": "AC",
                "value": "+1",
                "type": "circumstance"
            },
            {
                "affected": "All Damage Resistance",
                "value": "Math.max(Modifier('Strength') - (1 + Math.floor((Level - 4) / 4)), 0)"
            }
        ],
        "buff": true
    },
    {
        "name": "Ethereal Jaunt",
        "type": "spells",
        "desc": "You travel to the Ethereal Plane, which overlaps the Material Plane. Material Plane creatures can't see you, and you can move through things on the Material Plane. You move at half your normal Speeds, but can move in any direction (including up and down).\n\nYou can see onto the Material Plane within a radius of 60 feet; it is gray, hazy, and concealed from you. You can't affect the Material Plane, and you can't be affected by the Material Plane except by force effects and abjurations originating there.\n\nWhen the spell ends, you return to the Material Plane. If you're in the air, you fall (unless you can fly), and if you're inside an object, you're pushed into the nearest open space and take 1d6 damage per 5 feet you were pushed.\n\nIf you cast this spell when not on the Material Plane, it is lost.",
        "buff": true
    },
    {
        "name": "Barding of the Zephyr",
        "type": "wornitems",
        "desc": "Your companion wearing the barding is granted a fly Speed of 30 feet. Even if the companion doesn't have the mount special ability, it can still Fly while being ridden.",
        "effects": [
            {
                "affected": "Fly Speed",
                "setValue": "30"
            }
        ],
        "buff": true
    },
    {
        "name": "Feather Fall",
        "type": "spells",
        "desc": "Your fall slows to 60 feet per round, and the portion of the fall during the spell's duration doesn't count when calculating falling damage. If you reach the ground while the spell is in effect, you take no damage from the fall. The spell ends as soon as you land.",
        "showon": "Movement, Acrobatics",
        "buff": true
    },
    {
        "name": "Air Bubble",
        "type": "spells",
        "desc": "A bubble of pure air surrounds your head, allowing you to breathe normally.",
        "showon": "Health",
        "buff": true
    },
    {
        "name": "Elemental Blood Magic",
        "type": "bloodmagic",
        "desc": "Elemental energy surrounds you or a target. Either you gain a +1 status bonus to Intimidation checks for 1 round, or a target takes 1 damage per spell level. The damage is bludgeoning or fire, according to your elemental type (fire for fire, or else bludgeoning). If the spell already deals that kind of damage, combine it with the spell's initial damage before determining weaknesses and resistances.",
        "inputRequired": "If you choose to deal damage instead of gaining the Intimidation bonus, remove this condition.",
        "effects": [
            {
                "affected": "Intimidation",
                "value": "+1",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Speak with Animals",
        "type": "spells",
        "desc": "You can ask questions of, receive answers from, and use the Diplomacy skill with animals. The spell doesn't make them more friendly than normal. Cunning animals are likely to be terse and evasive, while less intelligent ones often make inane comments.",
        "showon": "Diplomacy",
        "buff": true
    },
    {
        "name": "Call on Ancient Blood: Fortitude",
        "type": "activity",
        "desc": "You gain a +1 circumstance bonus to Fortitude.",
        "effects": [
            {
                "affected": "Fortitude",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Call on Ancient Blood: Reflex",
        "type": "activity",
        "desc": "You gain a +1 circumstance bonus to Reflex.",
        "effects": [
            {
                "affected": "Reflex",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Call on Ancient Blood: Will",
        "type": "activity",
        "desc": "You gain a +1 circumstance bonus to Will.",
        "effects": [
            {
                "affected": "Will",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Bracelets of Dashing",
        "type": "wornitems",
        "desc": "You gain a +10-foot status bonus to Speed.",
        "effects": [
            {
                "affected": "Speed",
                "value": "+10",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Collar of Empathy",
        "type": "wornitems",
        "desc": "You perceive through your animal companion’s senses instead of your own. You can Sustain the Activation. You are unaware of your own surroundings for as long as you are using your animal companion’s senses. In addition to the obvious use when you are separated from your companion, this ability might allow you to notice sounds, scents, and other stimuli that your companion’s senses register but yours alone don’t.",
        "hint": "You perceive through your animal companion’s senses instead of your own. You can Sustain the Activation. You are unaware of your own surroundings for as long as you are using your animal companion’s senses. In addition to the obvious use when you are separated from your companion, this ability might allow you to notice sounds, scents, and other stimuli that your companion’s senses register but yours alone don’t.",
        "showon": "Animal Companion",
        "buff": true
    },
    {
        "name": "Pest Form",
        "type": "spells",
        "desc": "You transform into a the battle form of a Tiny animal, such as a cat, insect, lizard, or rat. On spell level 4, you can turn into a flying creature, such as a bird, which grants you a fly Speed of 20 feet. You can decide the specific type of animal (such as a rat or praying mantis), but this has no effect on the form's Size or statistics. While in this form, you gain the animal trait. You can Dismiss the spell.\n\nYou gain the following statistics and abilities:\n\nAC = 15 + your level. Ignore your armor's check penalty and Speed reduction.\nSpeed 10 feet.\nWeakness 5 to physical damage. (If you take physical damage in this form, you take 5 additional damage.)\nLow-Light Vision and imprecise scent 30 feet.\nAcrobatics and Stealth modifiers of +10, unless your own modifier is higher; Athletics modifier -4.",
        "effects": [
            {
                "affected": "Size",
                "setValue": "-2"
            },
            {
                "affected": "AC",
                "setValue": "15 + Level"
            },
            {
                "affected": "Land Speed",
                "setValue": "10"
            },
            {
                "affected": "Physical Damage Resistance",
                "value": "-5"
            },
            {
                "affected": "Acrobatics",
                "setValue": "Skill('Acrobatics') > 10 ? null : 10"
            },
            {
                "affected": "Stealth",
                "setValue": "Skill('Stealth') > 10 ? null : 10"
            },
            {
                "affected": "Athletics",
                "value": "-4"
            },
            {
                "affected": "Fly Speed",
                "setValue": "object.heightened >= 4 ? 20 : null"
            },
            {
                "affected": "Ignore Armor Penalty",
                "toggle": true
            }
        ],
        "senses": [
            "Low-Light Vision",
            "Scent 30 feet (imprecise)"
        ]
    },
    {
        "name": "Chameleon Gnome",
        "type": "activity",
        "desc": "The color of your hair and skin is designed to help you blend into your surroundings. This grants you a +2 circumstance bonus to Stealth checks until your surroundings shift in coloration or pattern.",
        "effects": [
            {
                "affected": "Stealth",
                "value": "+2",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Unseen Lizardfolk",
        "type": "activity",
        "desc": "Your skin color has changed to help you blend into your surroundings. This grants you a +2 circumstance bonus to Stealth checks until your surroundings change in coloration or pattern.",
        "effects": [
            {
                "affected": "Stealth",
                "value": "+2",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Rage",
        "type": "activity",
        "desc": "You gain a number of temporary Hit Points equal to your level plus your Constitution modifier. This frenzy lasts for 1 minute, until there are no enemies you can perceive, or until you fall unconscious, whichever comes first. You can’t voluntarily stop raging. While you are raging: \n\nYou deal 2 additional damage with melee weapons and unarmed attacks. This additional damage is halved if your weapon or unarmed attack is agile.\nYou take a –1 penalty to AC.\nYou can’t use actions with the concentrate trait unless they also have the rage trait. You can Seek while raging.\n\nAfter you stop raging, you lose any remaining temporary Hit Points from Rage, and you can’t Rage again for 1 minute.",
        "hint": "You can’t use actions with the concentrate trait unless they also have the rage trait. You can Seek while raging.",
        "showon": "Activities, Perception",
        "effects": [
            {
                "affected": "Melee Damage",
                "value": "+2"
            },
            {
                "affected": "Agile Melee Damage",
                "value": "+1"
            },
            {
                "affected": "AC",
                "value": "-1"
            }
        ],
        "onceEffects": [
            {
                "affected": "Temporary HP",
                "value": "Level + Modifier('Constitution')"
            }
        ],
        "inputRequired": "After you stop raging, you lose any remaining temporary Hit Points from Rage.",
        "buff": true
    }
]