[
    {
        "name": "Blinded",
        "type": "generic",
        "desc": "You can't see. All normal terrain is difficult terrain to you. You can't detect anything using vision. You automatically critically fail Perception checks that require you to be able to see, and if vision is your only precise sense, you take a -4 status penalty to Perception checks. You are immune to visual effects. Blinded overrides dazzled.",
        "overrideConditions": [
            "Dazzled"
        ],
        "showon": "Perception, Movement"
    },
    {
        "name": "Concealed",
        "type": "generic",
        "buff": true,
        "desc": "While you are concealed from a creature, such as in a thick fog, you are difficult for that creature to see. You can still be observed, but you're tougher to target. A creature that you're concealed from must succeed at a DC 5 flat check when targeting you with an attack, spell, or other effect. Area effects aren't subject to this flat check. If the check fails, the attack, spell, or effect doesn't affect you.",
        "showon": "AC"
    },
    {
        "name": "Clumsy",
        "hasValue": true,
        "type": "generic",
        "desc": "Your movements become clumsy and inexact. Clumsy always includes a value. You take a status penalty equal to the condition value to Dexterity-based checks and DCs, including AC, Reflex saves, ranged attack rolls, and skill checks using Acrobatics, Stealth, and Thievery.",
        "showon": "Dexterity",
        "effects": [
            {
                "affected": "AC",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Reflex",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Dexterity Attacks",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Acrobatics",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Stealth",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Thievery",
                "value": "-(object.value)",
                "type": "status"
            }
        ]
    },
    {
        "name": "Doomed",
        "hasValue": true,
        "type": "generic",
        "desc": "A powerful force has gripped your soul, calling you closer to death. Doomed always includes a value. The dying value at which you die is reduced by your doomed value. If your maximum dying value is reduced to 0, you instantly die. When you die, you’re no longer doomed.\n\nYour doomed value decreases by 1 each time you get a full night’s rest.",
        "effects": [
            {
                "affected": "Max Dying",
                "value": "-(object.value)"
            }
        ]
    },
    {
        "name": "Dying",
        "hasValue": true,
        "type": "generic",
        "desc": "You are bleeding out or otherwise at death's door. While you have this condition, you are unconscious. Dying always includes a value. If this value ever reaches dying 4, you die. If you're dying, you must attempt a recovery check at the start of your turn each round to determine whether you get better or worse.\n\nIf you lose the dying condition by succeeding at a recovery check and are still at 0 Hit Points, you remain unconscious, but you can wake up as described on page 460. You lose the dying condition automatically and wake up if you ever have 1 Hit Point or more. Anytime you lose the dying condition, you gain the wounded 1 condition, or increase your wounded value by 1 if you already have that condition.",
        "inputRequired": "If you're dying, you must attempt a recovery check at the start of your turn each round to determine whether you get better or worse.",
        "gainConditions": [
            {
                "name": "Unconscious",
                "source": "Dying"
            }
        ]
    },
    {
        "name": "Encumbered",
        "type": "generic",
        "desc": "You are carrying more weight than you can manage. While you're encumbered, you're clumsy 1 and take a 10-foot penalty to all your Speeds. As with all penalties to your Speed, this can't reduce your Speed below 5 feet.",
        "showon": "Movement, Bulk",
        "gainConditions": [
            {
                "name": "Clumsy",
                "value": 1,
                "source": "Encumbered",
                "applied": true
            }
        ],
        "effects": [
            {
                "affected": "Speed",
                "value": "-10"
            }
        ]
    },
    {
        "name": "Enfeebled",
        "hasValue": true,
        "type": "generic",
        "desc": "You're physically weakened. Enfeebled always includes a value. When you are enfeebled, you take a status penalty equal to the condition value to Strength-based rolls and DCs, including Strength-based melee attack rolls, Strength-based damage rolls, and Athletics checks.",
        "showon": "Strength",
        "effects": [
            {
                "affected": "Strength Attacks",
                "value": "-(object.value)",
                "type": "status"
            },
            {
                "affected": "Athletics",
                "value": "-(object.value)",
                "type": "status"
            }
        ]
    },
    {
        "name": "Flat-Footed",
        "type": "generic",
        "desc": "You're distracted or otherwise unable to focus your full attention on defense. You take a -2 circumstance penalty to AC. Some effects give you the flat-footed condition only to certain creatures or against certain attacks. Others—especially conditions—can make you universally flat-footed against everything. If a rule doesn't specify that the condition applies only to certain circumstances, it applies to all of them; for example, many effects simply say “The target is flat-footed.”",
        "effects": [
            {
                "affected": "AC",
                "value": "-2",
                "type": "circumstance"
            }
        ]
    },
    {
        "name": "Frightened",
        "hasValue": true,
        "decreasingValue": true,
        "type": "generic",
        "desc": "You're gripped by fear and struggle to control your nerves. The frightened condition always includes a value. You take a status penalty equal to this value to all your checks and DCs. Unless specified otherwise, at the end of each of your turns, the value of your frightened condition decreases by 1.",
        "effects": [
            {
                "affected": "All Checks",
                "value": "-(object.value)",
                "type": "status"
            }
        ]
    },
    {
        "name": "Quickened",
        "type": "generic",
        "buff": true,
        "desc": "You gain 1 additional action at the start of your turn each round. Many effects that make you quickened specify the types of actions you can use with this additional action. If you become quickened from multiple sources, you can use the extra action you've been granted for any single action allowed by any of the effects that made you quickened. Because quickened has its effect at the start of your turn, you don't immediately gain actions if you become quickened during your turn."
    },
    {
        "name": "Unconscious",
        "type": "generic",
        "desc": "You're sleeping, or you've been knocked out. You can't act. You take a -4 status penalty to AC, Perception, and Reflex saves, and you have the blinded and flat-footed conditions. When you gain this condition, you fall prone and drop items you are wielding or holding unless the effect states otherwise or the GM determines you're in a position in which you wouldn't.\n\nIf you're unconscious because you're dying, you can't wake up as long as you have 0 Hit Points. If you're restored to 1 Hit Point or more via healing, you lose the dying and unconscious conditions and can act normally on your next turn.\n\nIf you are unconscious and at 0 Hit Points, but not dying, you naturally return to 1 Hit Point and awaken after sufficient time passes. The GM determines how long you remain unconscious, from a minimum of 10 minutes to several hours. If you receive healing during this time, you lose the unconscious condition and can act normally on your next turn.\n\nIf you're unconscious and have more than 1 Hit Point (typically because you are asleep or unconscious due to an effect), you wake up in one of the following ways. Each causes you to lose the unconscious condition.\n\nYou take damage, provided the damage doesn't reduce you to 0 Hit Points. (If the damage reduces you to 0 Hit Points, you remain unconscious and gain the dying condition as normal.)\nYou receive healing, other than the natural healing you get from resting.\nSomeone nudges or shakes you awake using an Interact action.\nLoud noise is being made around you—though this isn't automatic. At the start of your turn, you automatically attempt a Perception check against the noise's DC (or the lowest DC if there is more than one noise), waking up if you succeed. This is often DC 5 for a battle, but if creatures are attempting to stay quiet around you, this Perception check uses their Stealth DC. Some magical effects make you sleep so deeply that they don't allow you to attempt this Perception check.\nIf you are simply asleep, the GM decides you wake up either because you have had a restful night's sleep or something disrupted that rest.",
        "gainConditions": [
            {
                "name": "Blinded",
                "source": "Unconscious"
            },
            {
                "name": "Flat-Footed",
                "source": "Unconscious"
            }
        ],
        "effects": [
            {
                "affected": "AC",
                "value": "-4",
                "type": "status"
            },
            {
                "affected": "Perception",
                "value": "-4",
                "type": "status"
            },
            {
                "affected": "Reflex",
                "value": "-4",
                "type": "status"
            }
        ]
    },
    {
        "name": "Wounded",
        "hasValue": true,
        "type": "generic",
        "desc": "You have been seriously injured during a fight. Anytime you lose the dying condition, you become wounded 1 if you didn't already have the wounded condition. If you already have the wounded condition, your wounded condition value instead increases by 1. If you gain the dying condition while wounded, increase the dying condition's value by your wounded value. The wounded condition ends if someone successfully restores Hit Points to you with Treat Wounds, or if you are restored to full Hit Points and rest for 10 minutes."
    },
    {
        "name": "Dead",
        "type": "generic",
        "desc": "You are dead.",
        "overrideConditions": [
            "All"
        ],
        "endConditions": [
            "Dying",
            "Doomed",
            "Wounded"
        ]
    },
    {
        "name": "Sickened",
        "hasValue": true,
        "type": "generic",
        "desc": "You feel ill. Sickened always includes a value. You take a status penalty equal to this value on all your checks and DCs. You can’t willingly ingest anything—including elixirs and potions—while sickened.\n\nYou can spend a single action retching in an attempt to recover, which lets you immediately attempt a Fortitude save against the DC of the effect that made you sickened. On a success, you reduce your sickened value by 1 (or by 2 on a critical success).",
        "effects": [
            {
                "affected": "All Checks",
                "value": "-(object.value)",
                "type": "status"
            }
        ]
    },
    {
        "name": "Eagle-Eye Elixir (Moderate)",
        "type": "alchemicalelixirs",
        "desc": "You gain an item bonus of +2 to Perception checks that is +3 when attempting to find secret doors and traps. ",
        "buff": true,
        "effects": [
            {
                "affected": "Perception",
                "value": "+2",
                "type": "item"
            }
        ],
        "showon": "Perception"
    },
    {
        "name": "Juggernaut Mutagen (Lesser)",
        "type": "alchemicalelixirs",
        "desc": "You gain an item bonus of +1 to Fortitude saves and 5 temporary Hit Points.\n\nYou take a -2 penalty to Will saves, Perception checks, and initiative rolls. Whenever you are at maximum Hit Points for at least 1 full minute, you regain the temporary Hit Points.",
        "inputRequired": "Whenever you are at maximum Hit Points for at least 1 full minute, you regain the temporary Hit Points.",
        "buff": true,
        "effects": [
            {
                "affected": "Fortitude",
                "value": "+1",
                "type": "item"
            },
            {
                "affected": "Will",
                "value": "-2"
            }
        ],
        "onceEffects": [
            {
                "affected": "Temporary HP",
                "value": "+5"
            }
        ]
    },
    {
        "name": "Leaper's Elixir (Lesser)",
        "type": "alchemicalelixirs",
        "desc": "You can High Jump or Long Jump as a single action instead of 2 actions. If you do, you don't perform the initial Stride (nor do you fail if you don't Stride 10 feet).",
        "buff": true,
        "showon": "Athletics"
    },
    {
        "name": "Dragon's Breath Potion (Silver, Young)",
        "type": "potions",
        "desc": "You can unleash a breath weapon as a 15-foot cone of cold that deals 4d6 cold damage. Each creature in the area must attempt a DC 23 basic Reflex save. Exhaling dragon breath uses a single action. After you use the breath weapon, you can't do so again for 1d4 rounds.",
        "buff": true,
        "showon": "Attacks"
    },
    {
        "name": "Candle of Truth",
        "type": "otherconsumables",
        "desc": "Creatures within 10 feet of the candle receive a -4 status penalty to Lie.\n\nIn addition, when first entering the affected area, each creature (including you) must succeed at a DC 26 Will save or be unable to tell any deliberate lies while within 10 feet of the lit candle. This lasts for as long as the candle is lit.",
        "showon": "Deception"
    },
    {
        "name": "Slippers of Spider Climbing",
        "type": "wornitems",
        "desc": "You gain a 20-foot climb Speed and you don't need to use your hands to Climb. However, the slippers require decent traction for you to walk on a wall, so they provide no benefit when you're moving across greased, icy, or oiled surfaces.",
        "effects": [
            {
                "affected": "Climb Speed",
                "setValue": "20"
            }
        ],
        "buff": true,
        "showon": "Movement"
    },
    {
        "name": "Eye of the Arclords",
        "type": "activity",
        "desc": "While the eye is open, you gain the following benefits: you gain the effects of the detect magic arcane innate spell from your Arcane Sense at the start of each of your turns without needing to cast the spell; you gain darkvision; you gain a +2 status bonus to Perception checks to Seek undetected and hidden creatures and to your Perception DC against Hide and Sneak. After your third eye closes, you are dazzled for an amount of time equal to how long you had it open.",
        "inputRequired": "After your third eye closes, you are dazzled for an amount of time equal to how long you had it open.",
        "showon": "Perception",
        "senses": [
            "Darkvision"
        ],
        "buff": true
    },
    {
        "name": "Crane Stance",
        "type": "activity",
        "desc": "While in Crane Stance, reduce the DC for High Jump and Long Jump by 5, and when you Leap, you can move an additional 5 feet horizontally or 2 feet vertically.",
        "showon": "Athletics",
        "attackRestrictions": [
            "Crane Wing"
        ],
        "effects": [
            {
                "affected": "AC",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Dragon Stance",
        "type": "activity",
        "desc": "While in Dragon Stance, you can ignore the first square of difficult terrain while Striding.",
        "showon": "Movement",
        "buff": true
    },
    {
        "name": "Mountain Stance",
        "type": "activity",
        "desc": "While in Mountain Stance, you gain a +4 status bonus to AC and a +2 circumstance bonus to any defenses against being Shoved or Tripped. However, you have a Dexterity modifier cap to your AC of +0, meaning you don't add your Dexterity to your AC, and your Speeds are all reduced by 5 feet.",
        "showon": "Fortitude, Movement",
        "effects": [
            {
                "affected": "AC",
                "value": "+4",
                "type": "status"
            },
            {
                "affected": "AC",
                "value": "- Math.max(0, Math.min(Modifier('Dexterity'), DexCap()) - (Character.get_FeatsTaken(1, Level, 'Mountain Stronghold').length ? 1 : 0) - (Character.get_FeatsTaken(1, Level, 'Mountain Quake').length ? 1 : 0))"
            },
            {
                "affected": "Speed",
                "value": "-5"
            }
        ],
        "attackRestrictions": [
            "Falling Stone"
        ],
        "buff": true
    },
    {
        "name": "Rain of Embers Stance",
        "type": "activity",
        "desc": "While in Rain of Embers Stance, you gain a +1 status bonus to AC and fire resistance equal to half your level (minimum 1).",
        "effects": [
            {
                "affected": "AC",
                "value": "+1",
                "type": "status"
            },
            {
                "affected": "Fire Resistance",
                "value": "Math.max(Math.floor(Level / 2), 1)"
            }
        ],
        "attackRestrictions": [
            "Fire Talon"
        ],
        "buff": true
    },
    {
        "name": "Tiger Stance",
        "type": "activity",
        "desc": "As long as your Speed is at least 20 feet while in Tiger Stance, you can Step 10 feet.",
        "showon": "Movement",
        "buff": true
    },
    {
        "name": "Wolf Stance",
        "type": "activity",
        "desc": "If you're flanking a target while in Wolf Stance, your wolf jaw unarmed attacks also gain the trip trait.",
        "showon": "Wolf Jaw",
        "buff": true
    },
    {
        "name": "Mountain Stronghold",
        "type": "activity",
        "desc": "You gain a +2 circumstance bonus to AC until the beginning of your next turn.",
        "effects": [
            {
                "affected": "AC",
                "value": "+2",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Ironblood Stance",
        "type": "activity",
        "desc": "While in Ironblood Stance, you gain resistance 2 to all damage. The resistance increases to 3 at 12th level, to 4 at 16th level, and to 5 at 20th level.",
        "effects": [
            {
                "affected": "All Damage Resistance",
                "value": "1 + Math.floor((Level - 4) / 4)"
            }
        ],
        "buff": true
    },
    {
        "name": "Tangled Forest Stance",
        "type": "activity",
        "desc": "While you're in Tangled Forest Stance and can act, every enemy in your reach that tries to move away from you must succeed at a Reflex save, Acrobatics check, or Athletics check against your class DC or be immobilized for that action. If you prefer, you can allow the enemy to move.",
        "showon": "Athletics, Attacks, Lashing Branch",
        "buff": true
    },
    {
        "name": "Wild Winds Stance",
        "type": "spells",
        "desc": "While in wild winds stance, you gain a +2 circumstance bonus to AC against ranged attacks.",
        "showon": "AC",
        "buff": true
    },
    {
        "name": "Wind Jump (5th level)",
        "type": "spells",
        "desc": "You gain a fly Speed equal to your Speed. You must end your turn on solid ground, or you fall.",
        "effects": [
            {
                "affected": "Fly Speed",
                "setValue": "Speed('Land Speed')"
            }
        ],
        "buff": true
    },
    {
        "name": "Wind Jump (6th level)",
        "type": "spells",
        "desc": "You gain a fly Speed equal to your Speed. You must end your turn on solid ground, or you fall. At the end of your turn, you can attempt a DC 30 Acrobatics check to find purchase in midair. If you succeed, you don't fall.",
        "effects": [
            {
                "affected": "Fly Speed",
                "setValue": "Speed('Land Speed')"
            }
        ],
        "buff": true
    },
    {
        "name": "Ironblood Surge",
        "type": "activity",
        "desc": "You gain the benefits of your iron sweep's parry trait (a +1 circumstance bonus to AC until the start of your next turn) and your resistance from Ironblood Stance increases to your Strength modifier (if it's higher) for the same duration.",
        "effects": [
            {
                "affected": "AC",
                "value": "+1",
                "type": "circumstance"
            },
            {
                "affected": "All Damage Resistance",
                "value": "Math.max(Modifier('Strength') - (1 + Math.floor((Level - 4) / 4)), 0)"
            }
        ],
        "buff": true
    },
    {
        "name": "Ethereal Jaunt",
        "type": "spells",
        "desc": "You travel to the Ethereal Plane, which overlaps the Material Plane. Material Plane creatures can't see you, and you can move through things on the Material Plane. You move at half your normal Speeds, but can move in any direction (including up and down).\n\nYou can see onto the Material Plane within a radius of 60 feet; it is gray, hazy, and concealed from you. You can't affect the Material Plane, and you can't be affected by the Material Plane except by force effects and abjurations originating there.\n\nWhen the spell ends, you return to the Material Plane. If you're in the air, you fall (unless you can fly), and if you're inside an object, you're pushed into the nearest open space and take 1d6 damage per 5 feet you were pushed.\n\nIf you cast this spell when not on the Material Plane, it is lost.",
        "hint": "Material Plane creatures can't see you, and you can move through things on the Material Plane. You move at half your normal Speeds, but can move in any direction (including up and down).\n\nYou can see onto the Material Plane within a radius of 60 feet; it is gray, hazy, and concealed from you. You can't affect the Material Plane, and you can't be affected by the Material Plane except by force effects and abjurations originating there.\n\nWhen the spell ends, you return to the Material Plane.",
        "showon": "Movement, Perception",
        "buff": true
    },
    {
        "name": "Barding of the Zephyr",
        "type": "wornitems",
        "desc": "Your companion wearing the barding is granted a fly Speed of 30 feet. Even if the companion doesn't have the mount special ability, it can still Fly while being ridden.",
        "effects": [
            {
                "affected": "Fly Speed",
                "setValue": "30"
            }
        ],
        "buff": true
    },
    {
        "name": "Feather Fall",
        "type": "spells",
        "desc": "Your fall slows to 60 feet per round, and the portion of the fall during the spell's duration doesn't count when calculating falling damage. If you reach the ground while the spell is in effect, you take no damage from the fall. The spell ends as soon as you land.",
        "showon": "Movement, Acrobatics",
        "buff": true
    },
    {
        "name": "Air Bubble",
        "type": "spells",
        "desc": "A bubble of pure air surrounds your head, allowing you to breathe normally.",
        "showon": "Health",
        "buff": true
    },
    {
        "name": "Elemental Blood Magic",
        "type": "bloodmagic",
        "desc": "Elemental energy surrounds you or a target. Either you gain a +1 status bonus to Intimidation checks for 1 round, or a target takes 1 damage per spell level. The damage is bludgeoning or fire, according to your elemental type (fire for fire, or else bludgeoning). If the spell already deals that kind of damage, combine it with the spell's initial damage before determining weaknesses and resistances.",
        "inputRequired": "If you choose to deal damage instead of gaining the Intimidation bonus, remove this condition.",
        "effects": [
            {
                "affected": "Intimidation",
                "value": "+1",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Speak with Animals",
        "type": "spells",
        "desc": "You can ask questions of, receive answers from, and use the Diplomacy skill with animals. The spell doesn't make them more friendly than normal. Cunning animals are likely to be terse and evasive, while less intelligent ones often make inane comments.",
        "showon": "Diplomacy",
        "buff": true
    },
    {
        "name": "Call on Ancient Blood: Fortitude",
        "type": "activity",
        "desc": "You gain a +1 circumstance bonus to Fortitude.",
        "effects": [
            {
                "affected": "Fortitude",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Call on Ancient Blood: Reflex",
        "type": "activity",
        "desc": "You gain a +1 circumstance bonus to Reflex.",
        "effects": [
            {
                "affected": "Reflex",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Call on Ancient Blood: Will",
        "type": "activity",
        "desc": "You gain a +1 circumstance bonus to Will.",
        "effects": [
            {
                "affected": "Will",
                "value": "+1",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Bracelets of Dashing",
        "type": "wornitems",
        "desc": "You gain a +10-foot status bonus to Speed.",
        "effects": [
            {
                "affected": "Speed",
                "value": "+10",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Collar of Empathy",
        "type": "wornitems",
        "desc": "You perceive through your animal companion’s senses instead of your own. You can Sustain the Activation. You are unaware of your own surroundings for as long as you are using your animal companion’s senses. In addition to the obvious use when you are separated from your companion, this ability might allow you to notice sounds, scents, and other stimuli that your companion’s senses register but yours alone don’t.",
        "hint": "You perceive through your animal companion’s senses instead of your own. You can Sustain the Activation. You are unaware of your own surroundings for as long as you are using your animal companion’s senses. In addition to the obvious use when you are separated from your companion, this ability might allow you to notice sounds, scents, and other stimuli that your companion’s senses register but yours alone don’t.",
        "showon": "Animal Companion",
        "buff": true
    },
    {
        "name": "Pest Form",
        "type": "spells",
        "desc": "You transform into a the battle form of a Tiny animal, such as a cat, insect, lizard, or rat. On spell level 4, you can turn into a flying creature, such as a bird, which grants you a fly Speed of 20 feet. You can decide the specific type of animal (such as a rat or praying mantis), but this has no effect on the form's Size or statistics. While in this form, you gain the animal trait. You can Dismiss the spell.\n\nYou gain the following statistics and abilities:\n\nAC = 15 + your level. Ignore your armor's check penalty and Speed reduction.\nSpeed 10 feet.\nWeakness 5 to physical damage. (If you take physical damage in this form, you take 5 additional damage.)\nLow-Light Vision and imprecise scent 30 feet.\nAcrobatics and Stealth modifiers of +10, unless your own modifier is higher; Athletics modifier -4.",
        "effects": [
            {
                "affected": "Size",
                "setValue": "-2"
            },
            {
                "affected": "AC",
                "setValue": "15 + Level"
            },
            {
                "affected": "Land Speed",
                "setValue": "10"
            },
            {
                "affected": "Physical Damage Resistance",
                "value": "-5"
            },
            {
                "affected": "Acrobatics",
                "setValue": "Skill('Acrobatics') > 10 ? null : 10"
            },
            {
                "affected": "Stealth",
                "setValue": "Skill('Stealth') > 10 ? null : 10"
            },
            {
                "affected": "Athletics",
                "value": "-4"
            },
            {
                "affected": "Fly Speed",
                "setValue": "object.heightened >= 4 ? 20 : null"
            },
            {
                "affected": "Ignore Armor Penalty",
                "toggle": true
            }
        ],
        "senses": [
            "Low-Light Vision",
            "Scent 30 feet (imprecise)"
        ]
    },
    {
        "name": "Chameleon Gnome",
        "type": "activity",
        "desc": "The color of your hair and skin is designed to help you blend into your surroundings. This grants you a +2 circumstance bonus to Stealth checks until your surroundings shift in coloration or pattern.",
        "effects": [
            {
                "affected": "Stealth",
                "value": "+2",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Unseen Lizardfolk",
        "type": "activity",
        "desc": "Your skin color has changed to help you blend into your surroundings. This grants you a +2 circumstance bonus to Stealth checks until your surroundings change in coloration or pattern.",
        "effects": [
            {
                "affected": "Stealth",
                "value": "+2",
                "type": "circumstance"
            }
        ],
        "buff": true
    },
    {
        "name": "Rage",
        "type": "activity",
        "desc": "You gain a number of temporary Hit Points equal to your level plus your Constitution modifier. This frenzy lasts for 1 minute, until there are no enemies you can perceive, or until you fall unconscious, whichever comes first. You can’t voluntarily stop raging. While you are raging: \n\nYou deal 2 additional damage with melee weapons and unarmed attacks. This additional damage is halved if your weapon or unarmed attack is agile.\nYou take a –1 penalty to AC.\nYou can’t use actions with the concentrate trait unless they also have the rage trait. You can Seek while raging.\n\nAfter you stop raging, you lose any remaining temporary Hit Points from Rage, and you can’t Rage again for 1 minute.",
        "hint": "You can’t use actions with the concentrate trait unless they also have the rage trait. You can Seek while raging.",
        "showon": "Activities, Perception",
        "effects": [
            {
                "affected": "Melee Damage",
                "value": "+2"
            },
            {
                "affected": "Agile Melee Damage",
                "value": "+1"
            },
            {
                "affected": "AC",
                "value": "-1"
            }
        ],
        "onceEffects": [
            {
                "affected": "Temporary HP",
                "value": "Level + Modifier('Constitution')"
            }
        ],
        "inputRequired": "After you stop raging, you lose any remaining temporary Hit Points from Rage.",
        "buff": true
    },
    {
        "name": "Inspire Courage",
        "type": "spells",
        "desc": "You and all allies in the area gain a +1 status bonus to attack rolls, damage rolls, and saves against fear effects.",
        "hint": "You and all allies in the area gain a +1 status bonus to saves against fear effects.",
        "showon": "Will",
        "effects": [
            {
                "affected": "Attack Rolls",
                "value": "+1",
                "type": "status"
            },
            {
                "affected": "Damage Rolls",
                "value": "+1",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Quivering Palm Immunity",
        "type": "spells",
        "desc": "You cannot be killed by quivering palm for the duration.",
        "buff": true
    },
    {
        "name": "Dancing Lights",
        "type": "spells",
        "desc": "You have created up to four floating lights, no two of which are more than 10 feet apart. Each sheds light like a torch. When you Sustain the Spell, you can move any number of lights up to 60 feet. Each light must remain within 120 feet of you and within 10 feet of all others, or it winks out.",
        "buff": true
    },
    {
        "name": "Ghost Sound",
        "type": "spells",
        "desc": "You have created an auditory illusion of simple sounds that has a maximum volume equal to four normal humans shouting. The sounds emanate from a square you designate within range. You can't create intelligible words or other intricate sounds (such as music).",
        "buff": true
    },
    {
        "name": "Light",
        "type": "spells",
        "desc": "The targeted object glows, casting bright light in a 20 (60 on 4th level)-foot radius (and dim light for the next 20 feet) like a torch. If you cast this spell again on a second object, the light spell on the first object ends.",
        "buff": true
    },
    {
        "name": "Mage Hand",
        "type": "spells",
        "desc": "You have created a single magical hand, either invisible or ghostlike, that grasps the target object and moves it slowly up to 20 feet. Because you're levitating the object, you can move it in any direction. When you Sustain the Spell, you can move the object an additional 20 feet. If the object is in the air when the spell ends, the object falls.",
        "buff": true
    },
    {
        "name": "Prestidigitation",
        "type": "spells",
        "desc": "The simplest magic does your bidding. You can perform simple magical effects for as long as you Sustain the Spell. Each time you Sustain the Spell, you can choose one of four options.\n\nCook: Cool, warm, or flavor 1 pound of nonliving material.\nLift: Slowly lift an unattended object of light Bulk or less 1 foot off the ground.\nMake: Create a temporary object of negligible Bulk, made of congealed magical substance. The object looks crude and artificial and is extremely fragile—it can't be used as a tool, weapon, or spell component.\nTidy: Color, clean, or soil an object of light Bulk or less. You can affect an object of 1 Bulk with 10 rounds of concentration, and a larger object a 1 minute per Bulk.\n\nPrestidigitation can't deal damage or cause adverse conditions. Any actual change to an object (beyond what is noted above) persists only as long as you Sustain the Spell.",
        "buff": true
    },
    {
        "name": "Forbidding Ward (1st level)",
        "type": "spells",
        "desc": "You gain a +1 status bonus to Armor Class and saving throws against the target enemy's attacks, spells, and other effects.",
        "hint": "You gain a +1 status bonus to Armor Class and saving throws against the target enemy's attacks, spells, and other effects.",
        "showon": "AC, Fortitude, Reflex, Will",
        "buff": true
    },
    {
        "name": "Forbidding Ward (6th level)",
        "type": "spells",
        "desc": "You gain a +2 status bonus to Armor Class and saving throws against the target enemy's attacks, spells, and other effects.",
        "hint": "You gain a +2 status bonus to Armor Class and saving throws against the target enemy's attacks, spells, and other effects.",
        "showon": "AC, Fortitude, Reflex, Will",
        "buff": true
    },
    {
        "name": "Guidance",
        "type": "spells",
        "desc": "Divine guidance is granting you a +1 status bonus to one attack roll, Perception check, saving throw, or skill check you attempt before the duration ends. You choose which roll to use the bonus on before rolling. If you use the bonus, the spell ends.",
        "hint": "Divine guidance is granting you a +1 status bonus to one attack roll, Perception check, saving throw, or skill check you attempt before the duration ends. You choose which roll to use the bonus on before rolling. If you use the bonus, the spell ends.",
        "showon": "AC, Fortitude, Reflex, Will, Attacks, Perception, Skills",
        "buff": true
    },
    {
        "name": "Guidance Immunity",
        "type": "spells",
        "desc": "You cannot gain the bonus granted by the Guidance spell for the duration."
    },
    {
        "name": "Join Pasts",
        "type": "spells",
        "desc": "You can share thoughts and experiences with the other targets of the spell, but not words. When one target attempts to Recall Knowledge, the other can Aid the first target’s skill check, using any Lore skill (even if that Lore wouldn’t normally apply) without having made any preparations to Aid.",
        "hint": "When one target attempts to Recall Knowledge, the other can Aid the first target’s skill check, using any Lore skill (even if that Lore wouldn’t normally apply) without having made any preparations to Aid.",
        "showon": "Skills",
        "buff": true
    },
    {
        "name": "Alarm (1st level)",
        "type": "spells",
        "desc": "You have warded an area to alert you when creatures enter without your permission. Whenever a Small or larger corporeal creature enters the spell's area without speaking the password, alarm sends your choice of a mental alert (in which case the spell gains the mental trait) or an audible alarm with the sound and volume of a hand bell (in which case the spell gains the auditory trait). Either option automatically awakens you, and the bell allows each creature in the area to attempt a DC 15 Perception check to wake up. A creature aware of the alarm must succeed at a Stealth check against the spell's DC or trigger the spell when moving into the area.",
        "buff": true
    },
    {
        "name": "Alarm (3rd level)",
        "type": "spells",
        "desc": "You have warded an area to alert you when creatures enter without your permission. Whenever a Small or larger corporeal creature enters the spell's area without speaking the password, alarm sends your choice of a mental alert (in which case the spell gains the mental trait) or an audible alarm with the sound and volume of a hand bell (in which case the spell gains the auditory trait). You can specify criteria for which creatures sound the alarm spell—for instance, orcs or masked people. Either option automatically awakens you, and the bell allows each creature in the area to attempt a DC 15 Perception check to wake up. A creature aware of the alarm must succeed at a Stealth check against the spell's DC or trigger the spell when moving into the area.",
        "buff": true
    },
    {
        "name": "Ant Haul",
        "type": "spells",
        "desc": "Your musculoskeletal system is reinforced to bear more weight. The target can carry 3 more Bulk than normal before becoming encumbered and up to a maximum of 6 more Bulk.",
        "effects": [
            {
                "affected": "Encumbered Limit",
                "value": "+3"
            },
            {
                "affected": "Max Bulk",
                "value": "+6"
            }
        ],
        "buff": true
    },
    {
        "name": "Anticipate Peril (1st level)",
        "type": "spells",
        "desc": "You gain a +1 status bonus to your next initiative roll, after which the spell ends.",
        "hint": "You gain a +1 status bonus to your next initiative roll, after which the spell ends.",
        "showon": "Perception",
        "buff": true
    },
    {
        "name": "Anticipate Peril (3rd level)",
        "type": "spells",
        "desc": "You gain a +2 status bonus to your next initiative roll, after which the spell ends.",
        "hint": "You gain a +2 status bonus to your next initiative roll, after which the spell ends.",
        "showon": "Perception",
        "buff": true
    },
    {
        "name": "Anticipate Peril (5th level)",
        "type": "spells",
        "desc": "You gain a +3 status bonus to your next initiative roll, after which the spell ends.",
        "hint": "You gain a +3 status bonus to your next initiative roll, after which the spell ends.",
        "showon": "Perception",
        "buff": true
    },
    {
        "name": "Anticipate Peril (7th level)",
        "type": "spells",
        "desc": "You gain a +4 status bonus to your next initiative roll, after which the spell ends.",
        "hint": "You gain a +4 status bonus to your next initiative roll, after which the spell ends.",
        "showon": "Perception",
        "buff": true
    },
    {
        "name": "Bane (Caster)",
        "type": "spells",
        "desc": "You fill the minds of your enemies with doubt. Targets that fail their Will saves take a –1 status penalty to attack rolls as long as they are in the area. Once per turn, starting the turn after you cast bane, you can use a single action, which has the concentrate trait, to increase the emanation's radius by 5 feet and force enemies in the area that weren't yet affected to attempt another saving throw. Bane can counteract bless.",
        "buff": true
    },
    {
        "name": "Bane",
        "type": "spells",
        "desc": "Your mind is filled with doubt. You take a –1 status penalty to attack rolls as long as you are in the emanation area.",
        "effects": [
            {
                "affected": "Attack Rolls",
                "value": "-1",
                "type": "status"
            }
        ]
    },
    {
        "name": "Bless (Caster)",
        "type": "spells",
        "desc": "Blessings from beyond help your companions strike true. You and your allies in the area gain a +1 status bonus to attack rolls. Once per turn, starting the turn after you cast bless, you can use a single action, which has the concentrate trait, to increase the emanation's radius by 5 feet. Bless can counteract bane.",
        "effects": [
            {
                "affected": "Attack Rolls",
                "value": "+1",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Bless",
        "type": "spells",
        "desc": "Blessings from beyond help you strike true. You gain a +1 status bonus to attack rolls while in the emanation area.",
        "effects": [
            {
                "affected": "Attack Rolls",
                "value": "+1",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Endure",
        "type": "spells",
        "desc": "You have been granted a number of temporary Hit Points equal to 5 times the spell level for the duration of the spell.",
        "inputRequired": "When the condition ends, remove the temporary Hit Points.",
        "onceEffects": [
            {
                "affected": "Temporary HP",
                "value": "(object.heightened) * 5"
            }
        ],
        "buff": true
    },
    {
        "name": "Fleet Step",
        "type": "spells",
        "desc": "You gain a +30-foot status bonus to your Speed.",
        "effects": [
            {
                "affected": "Land Speed",
                "value": "+30",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Floating Disk",
        "type": "spells",
        "desc": "This disk is 2 feet in diameter and follows 5 feet behind you, floating just above the ground. It holds up to 5 Bulk of objects (though they must be able to fit and balance on its surface). Any objects atop the disk fall to the ground when the spell ends.\n\nThe spell ends if a creature tries to ride atop the disk, if the disk is overloaded, if anyone tries to lift or force the disk higher above the ground, or if you move more than 30 feet away from the disk.",
        "hint": "This disk is 2 feet in diameter and follows 5 feet behind you, floating just above the ground. It holds up to 5 Bulk of objects (though they must be able to fit and balance on its surface).",
        "showon": "Bulk",
        "effects": [
            {
                "affected": "Encumbered Limit",
                "value": "+5"
            },
            {
                "affected": "Max Bulk",
                "value": "+5"
            }
        ],
        "buff": true
    },
    {
        "name": "Grease",
        "type": "spells",
        "desc": "Grease affects an area or object of your choice.\n\n<strong>Area</strong> All solid ground in the area is covered with grease. Each creature standing on the greasy surface must succeed at a Reflex save or an Acrobatics check against your spell DC or fall prone. Creatures using an action to move onto the greasy surface during the spell's duration must attempt either a Reflex save or an Acrobatics check to Balance. A creature that Steps or Crawls doesn't have to attempt a check or save.\n<strong>Target</strong> If you cast the spell on an unattended object, anyone trying to pick up the object must succeed at an Acrobatics check or Reflex save against your spell DC to do so. If you target an attended object, the creature that has the object must attempt an Acrobatics check or Reflex save. On a failure, the holder or wielder takes a –2 circumstance penalty to all checks that involve using the object; on a critical failure, the holder or wielder releases the item. The object lands in an adjacent square of the GM's choice. If you cast this spell on a worn object, the wearer gains a +2 circumstance bonus to Fortitude saves against attempts to grapple them.",
        "buff": true
    },
    {
        "name": "Gust of Wind",
        "type": "spells",
        "desc": "A violent wind issues forth from your palm, blowing from the point where you are when you cast the spell to the line's opposite end. The wind extinguishes small non-magical fires, disperses fog and mist, blows objects of light Bulk or less around, and pushes larger objects. Large or smaller creatures in the area must attempt a Fortitude save. Large or smaller creatures that later move into the gust must attempt the save on entering.\n\n<strong>Critical Success</strong> The creature is unaffected.\nSuccess The creature can't move against the wind.\n<strong>Failure</strong> The creature is knocked prone. If it was flying, it suffers the effects of critical failure instead.\n<strong>Critical Failure</strong> The creature is pushed 30 feet in the wind's direction, knocked prone, and takes 2d6 bludgeoning damage.",
        "buff": true
    },
    {
        "name": "Agitate",
        "type": "spells",
        "desc": "Your mind and body are sent into overdrive, forcing you to become restless and hyperactive. During the duration, you must Stride at least once each turn or take mental damage according to the spell level that turn."
    },
    {
        "name": "Command (failure)",
        "type": "spells",
        "desc": "For the first action on your next turn, you must use a single action to do as you were commanded."
    },
    {
        "name": "Command (critical failure)",
        "type": "spells",
        "desc": "You must use all your actions on your next turn to obey the command you were given.",
        "hint": "You must use all your actions on your next turn to obey the command you were given.",
        "showon": "Attacks, Skills"
    },
    {
        "name": "Ill Omen (failure)",
        "type": "spells",
        "desc": "Every time during the duration that you roll an attack roll or skill check, you must roll twice and take the worse result.",
        "hint": "Every time during the duration that you roll an attack roll or skill check, you must roll twice and take the worse result.",
        "showon": "Attacks, Skills"
    },
    {
        "name": "Ill Omen (critical failure)",
        "type": "spells",
        "desc": "The first time during the duration that you roll an attack roll or skill check, you must roll twice and take the worse result.",
        "hint": "The first time during the duration that you roll an attack roll or skill check, you must roll twice and take the worse result.",
        "showon": "Attacks, Skills"
    },
    {
        "name": "Illusory Disguise (1st level)",
        "type": "spells",
        "desc": "You appear as another creature of your body shape, and with roughly similar height (within 6 inches) and weight (within 50 pounds), as yourself. The disguise is typically good enough to hide your identity, but not to impersonate a specific individual. The spell doesn't change your voice, scent, or mannerisms. You can change the appearance of your clothing and worn items, such as making your armor look like a dress. Held items are unaffected, and any worn item you remove returns to its true appearance.\n\nCasting illusory disguise counts as setting up a disguise for the Impersonate use of Deception; it ignores any circumstance penalties you might take for disguising yourself as a dissimilar creature, it gives you a +4 status bonus to Deception checks to prevent others from seeing through your disguise, and you add your level even if you're untrained. You can Dismiss this spell.",
        "hint": "Casting illusory disguise counts as setting up a disguise for the Impersonate use of Deception; it ignores any circumstance penalties you might take for disguising yourself as a dissimilar creature, it gives you a +4 status bonus to Deception checks to prevent others from seeing through your disguise, and you add your level even if you're untrained.",
        "showon": "Deception",
        "buff": true
    },
    {
        "name": "Illusory Disguise (2nd level)",
        "type": "spells",
        "desc": "You appear as another creature of your body shape, and with roughly similar height (within 6 inches) and weight (within 50 pounds), as yourself. The disguise is typically good enough to hide your identity, but not to impersonate a specific individual. The spell also disguises your voice and scent, and it gains the auditory trait. It doesn't disguise your mannerisms. You can change the appearance of your clothing and worn items, such as making your armor look like a dress. Held items are unaffected, and any worn item you remove returns to its true appearance.\n\nCasting illusory disguise counts as setting up a disguise for the Impersonate use of Deception; it ignores any circumstance penalties you might take for disguising yourself as a dissimilar creature, it gives you a +4 status bonus to Deception checks to prevent others from seeing through your disguise, and you add your level even if you're untrained. You can Dismiss this spell.",
        "hint": "Casting illusory disguise counts as setting up a disguise for the Impersonate use of Deception; it ignores any circumstance penalties you might take for disguising yourself as a dissimilar creature, it gives you a +4 status bonus to Deception checks to prevent others from seeing through your disguise, and you add your level even if you're untrained.",
        "showon": "Deception",
        "buff": true
    },
    {
        "name": "Illusory Disguise (3rd level)",
        "type": "spells",
        "desc": "You appear as another creature of your body shape, and with roughly similar height (within 6 inches) and weight (within 50 pounds), as yourself. The disguise is typically good enough to hide your identity, but not to impersonate a specific individual. The spell also disguises your voice and scent, and it gains the auditory trait. It doesn't disguise your mannerisms. You can change the appearance of your clothing and worn items, such as making your armor look like a dress. Held items are unaffected, and any worn item you remove returns to its true appearance.\n\nCasting illusory disguise counts as setting up a disguise for the Impersonate use of Deception; it ignores any circumstance penalties you might take for disguising yourself as a dissimilar creature, it gives you a +4 status bonus to Deception checks to prevent others from seeing through your disguise, and you add your level even if you're untrained. You can Dismiss this spell.",
        "hint": "Casting illusory disguise counts as setting up a disguise for the Impersonate use of Deception; it ignores any circumstance penalties you might take for disguising yourself as a dissimilar creature, it gives you a +4 status bonus to Deception checks to prevent others from seeing through your disguise, and you add your level even if you're untrained.",
        "showon": "Deception",
        "buff": true
    },
    {
        "name": "Illusory Object (1st level)",
        "type": "spells",
        "desc": "You have created an illusory visual image of a stationary object. The object appears to animate naturally, but it doesn't make sounds or generate smells. For example, water would appear to pour down an illusory waterfall, but it would be silent.\n\nAny creature that touches the image or uses the Seek action to examine it can attempt to disbelieve your illusion.",
        "buff": true
    },
    {
        "name": "Illusory Object (2nd level)",
        "type": "spells",
        "desc": "You have created an illusory visual image of a stationary object. Your image makes appropriate sounds, generates normal smells, and feels right to the touch. The spell gains the auditory trait.\n\nAny creature that touches the image or uses the Seek action to examine it can attempt to disbelieve your illusion.",
        "buff": true
    },
    {
        "name": "Illusory Object (5th level)",
        "type": "spells",
        "desc": "You have created an illusory visual image of a stationary object. Your image makes appropriate sounds, generates normal smells, and feels right to the touch. The spell gains the auditory trait.\n\nAny creature that touches the image or uses the Seek action to examine it can attempt to disbelieve your illusion.",
        "inputRequired": "Since the duration is permanent, remove the condition when you no longer need this information.",
        "buff": true
    },
    {
        "name": "Item Facade",
        "type": "spells",
        "desc": "You have made the target object look and feel as though it were in much better or worse physical condition. When you cast this spell, decide whether you want to make the object look decrepit or perfect. An item made to look decrepit appears broken and shoddy. An intact item made to look better appears as though it's brand new and highly polished or well maintained. A broken item appears to be intact and functional. Destroyed items can't be affected by this spell. A creature that Interacts with the item can attempt to disbelieve the illusion.",
        "buff": true
    },
    {
        "name": "Jump",
        "type": "spells",
        "desc": "Your legs surge with strength, ready to leap high and far. Whenever you take the Leap action, You jump 30 feet in any direction without touching the ground. You must land on a space of solid ground within 30 feet of you, or else you fall after using your next action.",
        "buff": true
    },
    {
        "name": "Lock",
        "type": "spells",
        "desc": "You have magically locked a target, setting an Athletics and Thievery DC to open it equal to your spell DC or the base lock DC with a +4 status bonus, whichever is higher. Any key or combination that once opened a lock affected by this spell does not do so for the duration of the spell, though the key or combination does grant a +4 circumstance bonus to checks to open the door.\n\nIf the target is opened, the spell ends. Assuming the target is not barred or locked in some additional way, you can unlock and open it with an Interact action during which you touch the target. This does not end the spell. You can Dismiss this spell at any time and from any distance.",
        "buff": true
    },
    {
        "name": "Longstrider",
        "type": "spells",
        "desc": "You lengthen your stride beyond what should be possible. You gain a +10-foot status bonus to your Speed.",
        "effects": [
            {
                "affected": "Land Speed",
                "value": "+10",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Magic Aura (1st level)",
        "type": "spells",
        "desc": "You have altered the appearance of an item's magic aura, choosing to have the target's aura appear as that of common magic item of twice magic aura's level or lower, or to have it register as being under the effects of a spell of your choice of magic aura's level or lower.\n\nA caster using detect magic or read aura of an equal or higher spell level can attempt to disbelieve the illusion from magic aura. Magic aura doesn't mask the aura of spells that are 9th level or higher or of items that are 19th level or higher.",
        "buff": true
    },
    {
        "name": "Magic Aura (3rd level)",
        "type": "spells",
        "desc": "You have altered the appearance of an item's magic aura, choosing to have the target's aura appear as that of common magic item of twice magic aura's level or lower, or to have it register as being under the effects of a spell of your choice of magic aura's level or lower. Alternatively, you have targeted a creature instead of an object, choosing to either conceal the auras of all magic items it has or have that creature's aura appear as if it were under the effect of a spell you know.\n\nA caster using detect magic or read aura of an equal or higher spell level can attempt to disbelieve the illusion from magic aura. Magic aura doesn't mask the aura of spells that are 9th level or higher or of items that are 19th level or higher.",
        "buff": true
    },
    {
        "name": "Magic Weapon",
        "type": "spells",
        "desc": "The targeted non-magical weapon has become a +1 striking weapon, gaining a +1 item bonus to attack rolls and increasing the number of weapon damage dice to two.",
        "hint": "One non-magical weapon in your equipment has become a +1 striking weapon, gaining a +1 item bonus to attack rolls and increasing the number of weapon damage dice to two.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Message Rune",
        "type": "spells",
        "desc": "You have recorded a message up to 5 minutes long and inscribe a special rune on any flat unattended surface within reach. The nature of the rune’s appearance is up to you, but it is visible to everyone and it must be no smaller than 2 inches in diameter. You have also specified a trigger that creatures must meet to activate the rune. For the duration of the spell, creatures who meet the criteria of the trigger can touch the rune to hear the recorded message in their head as though you were speaking to them telepathically. You know when someone is listening to the message, but you do not know who is listening to it. You can Dismiss the spell.",
        "buff": true
    },
    {
        "name": "Imprint Message",
        "type": "spells",
        "desc": "You have projected psychic vibrations onto the target object, imprinting it with a short message or emotional theme of your design. This imprinted sensation is revealed to anyone casting object reading on the target object, replacing any emotional events the item was present for. If the object is in the area of a retrocognition spell, the imprinted messages appear as major events in the timeline, but they don’t interfere with any other visions. If the object is targeted with read aura of a higher spell level than imprint message, the caster learns that the object has been modified. When you Cast this Spell, any prior vibrations placed in an object by previous castings of imprint message fade.",
        "buff": true
    },
    {
        "name": "Persistent Damage",
        "type": "generic",
        "desc": "Persistent damage comes from effects like acid, being on fire, or many other situations. It appears as “X persistent [type] damage,” where “X” is the amount of damage dealt and “[type]” is the damage type. Instead of taking persistent damage immediately, you take it at the end of each of your turns as long as you have the condition, rolling any damage dice anew each time. After you take persistent damage, roll a DC 15 flat check to see if you recover from the persistent damage. If you succeed, the condition ends.",
        "inputRequired": "Take the appropriate amount of damage at the end of each of your turns as long as you have the condition, rolling any damage dice anew each time. After you take persistent damage, roll a DC 15 flat check to see if you recover from the persistent damage. If you succeed, the condition ends."
    },
    {
        "name": "Negate Aroma",
        "type": "spells",
        "desc": "You have lost your odor, preventing creatures from passively noticing your presence via smell alone, even if the creatures have precise or imprecise scent. A creature attempting a Perception check to Seek with scent and other senses might notice the lack of natural scent. If the target has any abilities that result from its smell, such as an overpowering scent, those abilities are also negated.",
        "inputRequired": "Take the appropriate amount of damage at the end of each of your turns as long as you have the condition, rolling any damage dice anew each time. After you take persistent damage, roll a DC 15 flat check to see if you recover from the persistent damage. If you succeed, the condition ends.",
        "buff": true
    },
    {
        "name": "Penumbral Shroud",
        "type": "spells",
        "desc": "You are enveloped in a shroud of shadow. You perceive light as one step lower than it actually is (bright light becomes dim light, for example), affecting your ability to sense creatures and objects accordingly. The shroud also provides a +1 status bonus to saving throws against light effects.",
        "hint": "You perceive light as one step lower than it actually is (bright light becomes dim light, for example), affecting your ability to sense creatures and objects accordingly. The shroud also provides a +1 status bonus to saving throws against light effects.",
        "showon": "Perception, Fortitude, Reflex, Will",
        "buff": true
    },
    {
        "name": "Personal Rain Cloud",
        "type": "spells",
        "desc": "A 5-foot-wide rain cloud follows you wherever you go. It stays roughly an arm’s length overhead, unless it must drift lower to fit under a ceiling. The cloud rains constantly on you, keeping you wet and dampening the ground in the wake of any movement. The rain extinguishes non-magical flames. You gain twice the spell level as fire resistance. If you have a weakness to water, you take damage equal to your weakness at the end of each turn. You can attempt a Reflex save to avoid the cloud.",
        "effects": [
            {
                "affected": "Fire Resistance",
                "value": "(object.heightened) * 2"
            }
        ],
        "buff": true
    },
    {
        "name": "Phantom Pain (Failure)",
        "type": "spells",
        "desc": "You are wracked by illusory pain, dealing 2d4 mental damage and 1d4 persistent mental damage per spell level. You are sickened 1. If you recover from being sickened, the persistent damage ends and the spell ends.",
        "gainConditions": [
            {
                "name": "Sickened",
                "value": 1,
                "source": "Phantom Pain"
            },
            {
                "name": "Persistent Damage",
                "source": "Phantom Pain",
                "persistentDamage": "Mental 1d4 per spell level"
            }
        ]
    },
    {
        "name": "Phantom Pain (Critical Failure)",
        "type": "spells",
        "desc": "You are wracked by illusory pain, dealing 2d4 mental damage and 1d4 persistent mental damage per spell level. You are sickened 2. If you recover from being sickened, the persistent damage ends and the spell ends.",
        "gainConditions": [
            {
                "name": "Sickened",
                "value": 2,
                "source": "Phantom Pain"
            },
            {
                "name": "Persistent Damage",
                "source": "Phantom Pain",
                "persistentDamage": "Mental 1d4 per spell level"
            }
        ]
    },
    {
        "name": "Protection",
        "type": "spells",
        "desc": "You are warded against a specified alignment, chosen from chaotic, evil, good, and lawful when the spell was cast. You gain a +1 status bonus to Armor Class and saving throws against creatures and effects of the chosen alignment. This bonus increases to +3 against effects from such creatures that would directly control you and against attacks made by summoned creatures of the chosen alignment.",
        "hint": "You gain a +1 status bonus to Armor Class and saving throws against creatures and effects of the chosen alignment. This bonus increases to +3 against effects from such creatures that would directly control you and against attacks made by summoned creatures of the chosen alignment.",
        "showon": "AC, Fortitude, Reflex, Will",
        "buff": true
    },
    {
        "name": "Sanctuary",
        "type": "spells",
        "desc": "You are warded with protective energy that deters enemy attacks. Creatures attempting to attack you must attempt a Will save each time. If you use a hostile action, the spell ends.\n\n<strong>Critical Success</strong> Sanctuary ends.\n<strong>Success</strong> The creature can attempt its attack and any other attacks against the target this turn.\n<strong>Failure</strong> The creature can't attack the target and wastes the action. It can't attempt further attacks against the target this turn.\n<strong>Critical Failure</strong> The creature wastes the action and can't attempt to attack the target for the rest of sanctuary's duration.",
        "buff": true
    },
    {
        "name": "Scouring Sand (1st level)",
        "type": "spells",
        "desc": "You are blasting the area with grit that scours away soil and gets into creatures’ eyes. For the duration of the spell, any plant-based difficult terrain smaller than a tree becomes loose, allowing each 5-foot square of it to be cleared with a single Interact action. In addition, scouring sand attempts to counteract entangle and other effects that create or manipulate plant-based terrain in its area. Successfully counteracting an effect removes only the portion of its area that overlaps with scouring sand’s area. After one such attempt, the effect is temporarily immune to scouring sand’s counteract for 24 hours. Each creature in the area when you Cast this Spell or that ends its turn in the area must attempt a Reflex save.\n\n<strong>Success</strong> The creature is unaffected.\n<strong>Failure</strong> The creature is dazzled for 1 minute or until it uses an Interact action to get the sand out of its eyes.\n<strong>Critical Failure</strong> As failure, but the creature is also blinded for its next action.",
        "buff": true
    },
    {
        "name": "Scouring Sand (3rd level)",
        "type": "spells",
        "desc": "You are blasting the area with grit that scours away soil and gets into creatures’ eyes. For the duration of the spell, any plant-based difficult terrain smaller than a tree becomes loose, allowing each 5-foot square of it to be cleared with a single Interact action. In addition, scouring sand attempts to counteract entangle and other effects that create or manipulate plant-based terrain in its area. Successfully counteracting an effect removes only the portion of its area that overlaps with scouring sand’s area. After one such attempt, the effect is temporarily immune to scouring sand’s counteract for 24 hours. Each creature in the area when you Cast this Spell or that ends its turn in the area must attempt a Reflex save.\n\n<strong>Success</strong> The creature is unaffected.\n<strong>Failure</strong> The creature is dazzled for 1 minute or until it uses an Interact action to get the sand out of its eyes.\n<strong>Critical Failure</strong> As failure, but the creature is also blinded for its next action. Once per round when you Sustain the Spell, you can move the center of the burst to a spot within range.",
        "buff": true
    },
    {
        "name": "Share Lore (1st level)",
        "type": "spells",
        "desc": "You are sharing your knowledge with the touched creatures. All targets become trained in one chosen Lore skill in which the caster is trained for the duration of the spell.",
        "hint": "All targets become trained in one chosen Lore skill in which the caster is trained for the duration of the spell.",
        "showon": "Skills",
        "buff": true
    },
    {
        "name": "Share Lore (5th level)",
        "type": "spells",
        "desc": "You are sharing your knowledge with the touched creatures. All targets become trained in up to two chosen Lore skills in which the caster is trained for the duration of the spell.",
        "hint": "All targets become trained in two chosen Lore skills in which the caster is trained for the duration of the spell.",
        "showon": "Skills",
        "buff": true
    },
    {
        "name": "Shattering Gem",
        "type": "spells",
        "desc": "A large gem floats around you in an erratic pattern. The gem has 5 Hit Points per spell level. Each time a creature Strikes you, you attempts a DC 11 flat check. On a success, the gem blocks the attack, so the attack first damages the gem and then applies any remaining damage to you. If the gem is reduced to 0 Hit Points, it shatters, immediately dealing the creature that destroyed it 1d8 slashing damage per spell level (basic Reflex save), as long as that creature is within 10 feet of you.",
        "hint": "A large gem floats around you in an erratic pattern. The gem has 5 Hit Points per spell level. Each time a creature Strikes you, you attempts a DC 11 flat check. On a success, the gem blocks the attack, so the attack first damages the gem and then applies any remaining damage to you. If the gem is reduced to 0 Hit Points, it shatters, immediately dealing the creature that destroyed it 1d8 slashing damage per spell level (basic Reflex save), as long as that creature is within 10 feet of you.",
        "showon": "AC",
        "buff": true
    },
    {
        "name": "Soothe",
        "type": "spells",
        "desc": "Your mind's mental defenses are boosted, and your wounds are healed. You regain 1d10+4 Hit Points per spell level when the Spell is Cast and gain a +2 status bonus to saves against mental effects for the duration.",
        "hint": "You gain a +2 status bonus to saves against mental effects for the duration.",
        "showon": "Will",
        "inputRequired": "You regain 1d10+4 Hit Points per spell level when the Spell is Cast.",
        "buff": true
    },
    {
        "name": "Spirit Link (Caster)",
        "type": "spells",
        "desc": "You have formed a spiritual link with another creature, allowing you to take in its pain. When you Cast this Spell and at the start of each of your turns, if the target is below maximum Hit Points, it regains 2 Hit Points per spell level (or the difference between its current and maximum Hit Points, if that's lower). You lose as many Hit Points as the target regained.\n\nThis is a spiritual transfer, so no effects apply that would increase the Hit Points the target regains or decrease the Hit Points you lose. This transfer also ignores any temporary Hit Points you or the target have. Since this effect doesn't involve positive or negative energy, spirit link works even if you or the target is undead. While the duration persists, you gain no benefit from regeneration or fast healing. You can Dismiss this spell, and if you're ever at 0 Hit Points, spirit link ends automatically.",
        "hint": "At the start of each of your turns, if the target is below maximum Hit Points, it regains 2 Hit Points per spell level (or the difference between its current and maximum Hit Points, if that's lower). You lose as many Hit Points as the target regained.",
        "showon": "Health",
        "inputRequired": "When you Cast this Spell and at the start of each of your turns, if the target is below maximum Hit Points, it regains 2 Hit Points per spell level (or the difference between its current and maximum Hit Points, if that's lower). You lose as many Hit Points as the target regained.",
        "buff": true
    },
    {
        "name": "Spirit Link",
        "type": "spells",
        "desc": "You have formed a spiritual link with the caster, allowing them to take in your pain. When the Spell is Cast and at the start of each of your turns, if the you are below maximum Hit Points, you regains 2 Hit Points per spell level (or the difference between your current and maximum Hit Points, if that's lower). The caster loses as many Hit Points as you regained.\n\nThis is a spiritual transfer, so no effects apply that would increase the Hit Points you regain or decrease the Hit Points the caster loses. This transfer also ignores any temporary Hit Points you or the caster have. Since this effect doesn't involve positive or negative energy, spirit link works even if you or the caster is undead.",
        "hint": "At the start of each of your turns, if you are below maximum Hit Points, you regains 2 Hit Points per spell level (or the difference between its current and maximum Hit Points, if that's lower). The caster loses as many Hit Points as you regained.",
        "showon": "Health",
        "inputRequired": "When you Cast this Spell and at the start of each of your turns, if you are below maximum Hit Points, you regain 2 Hit Points per spell level (or the difference between its current and maximum Hit Points, if that's lower). The caster loses as many Hit Points as you regained.",
        "buff": true
    },
    {
        "name": "Summon Animal",
        "type": "spells",
        "desc": "You have summoned an animal to fight for you.\n\nA creature called by a conjuration spell or effect gains the summoned trait. A summoned creature can’t summon other creatures, create things of value, or cast spells that require a cost. It has the minion trait. If it tries to cast a spell of equal or higher level than the spell that summoned it, it overpowers the summoning magic, causing the summoned creature’s spell to fail and the summon spell to end. Otherwise, the summoned creature uses the standard abilities for a creature of its kind. It generally attacks your enemies to the best of its abilities. If you can communicate with it, you can attempt to command it, but the GM determines the degree to which it follows your commands.\n\nImmediately when you finish Casting the Spell, the summoned creature uses its 2 actions for that turn. Summoned creatures can be banished by various spells and effects. They are automatically banished if reduced to 0 Hit Points or if the spell that called them ends.",
        "buff": true
    },
    {
        "name": "Summon Construct",
        "type": "spells",
        "desc": "You have conjured a construct to fight for you.\n\nA creature called by a conjuration spell or effect gains the summoned trait. A summoned creature can’t summon other creatures, create things of value, or cast spells that require a cost. It has the minion trait. If it tries to cast a spell of equal or higher level than the spell that summoned it, it overpowers the summoning magic, causing the summoned creature’s spell to fail and the summon spell to end. Otherwise, the summoned creature uses the standard abilities for a creature of its kind. It generally attacks your enemies to the best of its abilities. If you can communicate with it, you can attempt to command it, but the GM determines the degree to which it follows your commands.\n\nImmediately when you finish Casting the Spell, the summoned creature uses its 2 actions for that turn. Summoned creatures can be banished by various spells and effects. They are automatically banished if reduced to 0 Hit Points or if the spell that called them ends.",
        "buff": true
    },
    {
        "name": "Summon Plant or Fungus",
        "type": "spells",
        "desc": "You have conjured a plant or fungus to fight for you.\n\nA creature called by a conjuration spell or effect gains the summoned trait. A summoned creature can’t summon other creatures, create things of value, or cast spells that require a cost. It has the minion trait. If it tries to cast a spell of equal or higher level than the spell that summoned it, it overpowers the summoning magic, causing the summoned creature’s spell to fail and the summon spell to end. Otherwise, the summoned creature uses the standard abilities for a creature of its kind. It generally attacks your enemies to the best of its abilities. If you can communicate with it, you can attempt to command it, but the GM determines the degree to which it follows your commands.\n\nImmediately when you finish Casting the Spell, the summoned creature uses its 2 actions for that turn. Summoned creatures can be banished by various spells and effects. They are automatically banished if reduced to 0 Hit Points or if the spell that called them ends.",
        "buff": true
    },
    {
        "name": "Summon Plant or Fungus",
        "type": "spells",
        "desc": "You have conjured a fey to fight for you.\n\nA creature called by a conjuration spell or effect gains the summoned trait. A summoned creature can’t summon other creatures, create things of value, or cast spells that require a cost. It has the minion trait. If it tries to cast a spell of equal or higher level than the spell that summoned it, it overpowers the summoning magic, causing the summoned creature’s spell to fail and the summon spell to end. Otherwise, the summoned creature uses the standard abilities for a creature of its kind. It generally attacks your enemies to the best of its abilities. If you can communicate with it, you can attempt to command it, but the GM determines the degree to which it follows your commands.\n\nImmediately when you finish Casting the Spell, the summoned creature uses its 2 actions for that turn. Summoned creatures can be banished by various spells and effects. They are automatically banished if reduced to 0 Hit Points or if the spell that called them ends.",
        "buff": true
    },
    {
        "name": "Temporary Tool",
        "type": "spells",
        "desc": "You have conjured a temporary simple tool, such as a shovel or rope into your hands. It lasts until it is used for a single activity or for 1 minute, whichever comes first, after which it disappears. The tool is obviously temporarily conjured, and thus can’t be sold or passed off as a genuine item.",
        "buff": true
    },
    {
        "name": "Tether",
        "type": "spells",
        "desc": "You have used magical chains, vines, or other tethers to bind your target to you. The creature can still try to Escape, and it or others can break the tethers by attacking them. The tethers have AC 15 (plus 3 per spell level) and 10 Hit Points (plus 10 per spell level). You must stay within 30 feet of the target while it is tethered; moving more than 30 feet away from your target ends the spell. The target must attempt a Reflex save.\n\n<strong>Critical Success</strong> The target is unaffected.\n<strong>Success</strong> The target takes a –5-foot circumstance penalty to its Speed as long as it is within 30 feet of you.\n<strong>Failure</strong> The target takes a –10-foot circumstance penalty to its Speed and cannot move more than 30 feet away from you until it Escapes or the spell ends.\n<strong>Critical Failure</strong> The target is immobilized until it Escapes or the spell ends.",
        "buff": true
    },
    {
        "name": "True Strike",
        "type": "spells",
        "desc": "A glimpse into the future ensures your next blow strikes true. The next time you make an attack roll before the end of your turn, roll the attack twice and use the better result. The attack ignores circumstance penalties to the attack roll and any flat check required due to the target being concealed or hidden.",
        "hint": "The next time you make an attack roll before the end of your turn, roll the attack twice and use the better result. The attack ignores circumstance penalties to the attack roll and any flat check required due to the target being concealed or hidden.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Unseen Servant",
        "type": "spells",
        "desc": "You have summoned an unseen servant (Core Rulebook pg. 380), which you can command as part of Sustaining the Spell. It serves you until its Hit Points are reduced to 0, at which point the spell ends, or until you stop Sustaining the Spell. The unseen servant gains the summoned trait.\n\nA creature called by a conjuration spell or effect gains the summoned trait. A summoned creature can’t summon other creatures, create things of value, or cast spells that require a cost. It has the minion trait. If it tries to cast a spell of equal or higher level than the spell that summoned it, it overpowers the summoning magic, causing the summoned creature’s spell to fail and the summon spell to end. Otherwise, the summoned creature uses the standard abilities for a creature of its kind. It generally attacks your enemies to the best of its abilities. If you can communicate with it, you can attempt to command it, but the GM determines the degree to which it follows your commands.\n\nImmediately when you finish Casting the Spell, the summoned creature uses its 2 actions for that turn. Summoned creatures can be banished by various spells and effects. They are automatically banished if reduced to 0 Hit Points or if the spell that called them ends.",
        "buff": true
    },
    {
        "name": "Ventriloquism (1st level)",
        "type": "spells",
        "desc": "Whenever you speak or make any other sound vocally, you can make your vocalization seem to originate from somewhere else within 60 feet, and you can change that apparent location freely as you vocalize. Any creature that hears the sound can attempt to disbelieve your illusion.",
        "buff": true
    },
    {
        "name": "Ventriloquism (2nd level)",
        "type": "spells",
        "desc": "Whenever you speak or make any other sound vocally, you can make your vocalization seem to originate from somewhere else within 60 feet, and you can change that apparent location freely as you vocalize. You can also change the tone, quality, and other aspects of your voice. Before a creature can attempt to disbelieve your illusion, it must actively attempt a Perception check or otherwise use actions to interact with the sound.",
        "buff": true
    },
    {
        "name": "Stabilize",
        "type": "spells",
        "desc": "Positive energy shuts death's door. The target loses the dying condition, though it remains unconscious at 0 Hit Points.",
        "buff": true,
        "endConditions": [
            "Dying"
        ]
    },
    {
        "name": "Disrupting Weapons (1st level)",
        "type": "spells",
        "desc": "Two of your weapons are infused with positive energy. Attacks with these weapons deal an extra 1d4 positive damage to undead.",
        "hint": "Two of your weapons are infused with positive energy. Attacks with these weapons deal an extra 1d4 positive damage to undead.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Disrupting Weapons (3rd level)",
        "type": "spells",
        "desc": "Two of your weapons are infused with positive energy. Attacks with these weapons deal an extra 2d4 positive damage to undead.",
        "hint": "Two of your weapons are infused with positive energy. Attacks with these weapons deal an extra 2d4 positive damage to undead.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Disrupting Weapons (5th level)",
        "type": "spells",
        "desc": "Three of your weapons are infused with positive energy. Attacks with these weapons deal an extra 3d4 positive damage to undead.",
        "hint": "Three of your weapons are infused with positive energy. Attacks with these weapons deal an extra 3d4 positive damage to undead.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Magic Fang",
        "type": "spells",
        "desc": "One of your unarmed attacks shines with primal energy. The unarmed attack becomes a +1 striking unarmed attack, gaining a +1 item bonus to attack rolls and increasing the number of damage dice to two if it had only one.",
        "hint": "One of your unarmed attacks becomes a +1 striking unarmed attack, gaining a +1 item bonus to attack rolls and increasing the number of damage dice to two if it had only one.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Pass without Trace",
        "type": "spells",
        "desc": "You obscure the tracks you leave behind and make it harder for others to find you. The DC of checks to Track you gains a +4 status bonus or is equal to your spell DC, whichever results in a higher DC. You can benefit from only one pass without trace spell at a time.",
        "hint": "You obscure the tracks you leave behind and make it harder for others to find you. The DC of checks to Track you gains a +4 status bonus or is equal to your spell DC, whichever results in a higher DC. You can benefit from only one pass without trace spell at a time.",
        "showon": "Movement",
        "buff": true
    },
    {
        "name": "Magic Fang",
        "type": "spells",
        "desc": "One non-magical club or staff you hold becomes a +1 striking weapon while in your hands, gaining a +1 item bonus to attack rolls and increasing the number of weapon damage dice to two. Additionally, as long as you are on your home plane, attacks you make with the target against aberrations, extraplanar creatures, and undead increase the number of weapon damage dice to three.",
        "hint": "One non-magical club or staff you hold becomes a +1 striking weapon while in your hands, gaining a +1 item bonus to attack rolls and increasing the number of weapon damage dice to two. Additionally, as long as you are on your home plane, attacks you make with the target against aberrations, extraplanar creatures, and undead increase the number of weapon damage dice to three.",
        "showon": "Attacks",
        "buff": true
    },
    {
        "name": "Hero's Defiance Cooldown",
        "type": "spells",
        "desc": "Cheating death is difficult, and you can't use hero's defiance again until you Refocus or the next time you prepare.",
        "inputRequired": "If you Refocus, remove this condition."
    },
    {
        "name": "Shifting Form (Speed bonus)",
        "type": "spells",
        "desc": "You gain a 20-foot status bonus to your Speed.",
        "effects": [
            {
                "affected": "Land Speed",
                "value": "+20",
                "type": "status"
            }
        ],
        "buff": true
    },
    {
        "name": "Shifting Form (climb Speed)",
        "type": "spells",
        "desc": "You gain a climb Speed equal to half your Speed.",
        "effects": [
            {
                "affected": "Climb Speed",
                "setValue": "Speed('Land Speed') / 2"
            }
        ],
        "buff": true
    },
    {
        "name": "Shifting Form (swim Speed)",
        "type": "spells",
        "desc": "You gain a climb Speed equal to half your Speed.",
        "effects": [
            {
                "affected": "Swim Speed",
                "setValue": "Speed('Land Speed') / 2"
            }
        ],
        "buff": true
    },
    {
        "name": "Shifting Form (darkvision)",
        "type": "spells",
        "desc": "You gain darkvision.",
        "senses": [
            "Darkvision"
        ],
        "buff": true
    },
    {
        "name": "Shifting Form (scent)",
        "type": "spells",
        "desc": "You gain scent 60 feet (imprecise).",
        "senses": [
            "Scent 60 feet (imprecise)"
        ],
        "buff": true
    }
]