[
    {
        "name": "Flurry of Blows",
        "desc": "You can attack rapidly with fists, feet, elbows, knees, and other unarmed attacks. You gain the Flurry of Blows action.",
        "gainActivities": [
            "Flurry of Blows"
        ]
    },
    {
        "name": "Rage",
        "desc": "You can attack rapidly with fists, feet, elbows, knees, and other unarmed attacks. You gain the Flurry of Blows action.",
        "gainActivities": [
            "Rage"
        ]
    },
    {
        "name": "Quick Rage",
        "desc": "You recover from your Rage quickly, and are soon ready to begin anew. After you spend a full turn without raging, you can Rage again without needing to wait 1 minute.",
        "hint": "After you spend a full turn without raging, you can Rage again without needing to wait 1 minute.",
        "showon": "Rage"
    },
    
    {
        "name": "Powerful Fist",
        "desc": "You know how to wield your fists as deadly weapons. The damage die for your fist increases to 1d6 instead of 1d4. Most people take a -2 circumstance penalty when making a lethal attack with nonlethal unarmed attacks, because they find it hard to use their fists with deadly force. You don't take this penalty when making a lethal attack with your fist or any other unarmed attacks.",
        "hint": "You don't take the usual -2 circumstance penalty when making a lethal attack with your fist or any other unarmed attacks.",
        "showon": "Unarmed Attacks"
    },
    {
        "name": "Incredible Movement",
        "desc": "You move like the wind. You gain a +10-foot status bonus to your Speed whenever you're not wearing armor. The bonus increases by 5 feet for every 4 levels you have beyond 3rd.",
        "hint": "You gain a +10-foot status bonus to your Speed whenever you're not wearing armor. The bonus increases by 5 feet for every 4 levels you have beyond 3rd.",
        "showon": "Land Speed"
    },
    {
        "name": "Mystic Strikes",
        "desc": "Focusing your will into your physical attacks imbues them with mystical energy. Your unarmed attacks become magical, allowing them to get past resistances to non-magical attacks. However, you still need an item such as handwraps of mighty blows to gain an item bonus to attack rolls or increase your attacks' weapon damage dice.",
        "hint": "Your unarmed attacks become magical, allowing them to get past resistances to non-magical attacks.",
        "showon": "Unarmed Attacks"
    },
    {
        "name": "Alertness",
        "desc": "You remain alert to threats around you. Your proficiency rank for Perception increases to expert.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Expert Strikes",
        "desc": "You've practiced martial arts and have now surpassed your former skill. Your proficiency ranks for unarmed attacks and simple weapons increase to expert.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Path to Perfection",
        "desc": "You have progressed along your own path to enlightenment. Choose your Fortitude, Reflex, or Will saving throw. Your proficiency rank for the chosen saving throw increases to master. When you roll a success on the chosen saving throw, you get a critical success instead.",
        "hint": "When you roll a success on this saving throw, you get a critical success instead.",
        "showon": "Path to Perfection",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Weapon Specialization",
        "desc": "You've learned how to inflict greater injuries with the weapons you know best. You deal 2 additional damage with weapons and unarmed attacks in which you are an expert. This damage increases to 3 if you're a master, and 4 if you're legendary.",
        "internalNote": "The effect is hardcoded."
    },
    {
        "name": "Metal Strikes",
        "desc": "You can adjust your body to make unarmed attacks infused with the mystic energy of rare metals. Your unarmed attacks are treated as cold iron and silver. This allows you to deal more damage to a variety of supernatural creatures, such as demons, devils, and fey.",
        "hint": "Your unarmed attacks are treated as cold iron and silver. This allows you to deal more damage to a variety of supernatural creatures, such as demons, devils, and fey.",
        "showon": "Unarmed Attacks"
    },
    {
        "name": "Monk Expertise",
        "desc": "Your proficiency rank for your monk class DC increases to expert. If you have ki spells, your proficiency rank for spell attacks and spell DCs with the tradition of magic you use for your ki spells increases to expert.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Second Path to Perfection",
        "desc": "You've learned to find perfection in every success. Choose a different saving throw than the one you chose for your path to perfection. Your proficiency rank for the chosen saving throw increases to master. If you roll a success with the chosen saving throw, you instead critically succeed.",
        "hint": "If you roll a success with this saving throw, you instead critically succeed.",
        "showon": "Second Path to Perfection",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Graceful Mastery",
        "desc": "You move with perpetual grace in battle, eluding and turning aside blows. Your proficiency rank for unarmored defense increases to master.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Master Strikes",
        "desc": "You have honed your skill in using your body as a weapon. Your proficiency ranks for unarmed attacks and simple weapons increase to master.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Greater Weapon Specialization",
        "desc": "Your damage from weapon specialization increases to 4 with weapons and unarmed attacks in which you're an expert, 6 if you're a master, and 8 if you're legendary.",
        "internalNote":"The effect is hardcoded."
    },
    {
        "name": "Third Path to Perfection",
        "desc": "You have made great progress in your personal studies of enlightenment. Choose one of the saving throws you selected for path to perfection or second path to perfection. Your proficiency rank for the chosen type of save increases to legendary. When you roll a critical failure on the chosen type of save, you get a failure instead. When you roll a failure on the chosen type of save against an effect that deals damage, you take half damage.",
        "hint": "When you roll a critical failure on this type of save, you get a failure instead. When you roll a failure on this type of save against an effect that deals damage, you take half damage.",
        "showon": "Third Path to Perfection",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Adamantine Strikes",
        "desc": "When you focus your will into your limbs, your blows are as unyielding as the hardest of metals. Your unarmed attacks are treated as adamantine.",
        "hint": "Your unarmed attacks are treated as adamantine.",
        "showon": "Unarmed Attacks"
    },
    {
        "name": "Graceful Legend",
        "desc": "Your sublime movement grants you unparalleled protection and offense. Your proficiency rank for unarmored defense increases to legendary, and your proficiency rank for your monk class DC increases to master. If you have ki spells, your proficiency rank for spell attack rolls and spell DCs with the tradition of magic you use for your ki spells increases to master.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name": "Perfected Form",
        "desc": "You have purged incompetence from your techniques. On your first Strike of your turn, if you roll lower than 10, you can treat the attack roll as a 10. This is a fortune effect.",
        "hint": "On your first Strike of your turn, if you roll lower than 10, you can treat the attack roll as a 10. This is a fortune effect.",
        "showon": "Attacks"
    },
    {
        "name": "Hunt Prey",
        "desc": "When you focus your attention on a single foe, you become unstoppable in your pursuit. You gain the Hunt Prey action.",
        "gainActivities":[
            "Hunt Prey"
        ]
    },
    {
        "name":"Hunter's Edge",
        "desc":"You have trained for countless hours to become a more skilled hunter and tracker, gaining an additional benefit when you Hunt Prey depending on the focus of your training.",
        "internalNote":"A feat choice for your hunter's edge focus is written into the class class."
    },
    {
        "name":"Iron Will",
        "desc":"Your training has hardened your resolve. Your proficiency rank for Will saves increases to expert.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Ranger Weapon Expertise",
        "desc":"You've dedicated yourself to learning the intricacies of your weapons. Your proficiency ranks for simple and martial weapons and unarmed attacks increases to expert. You gain access to the critical specialization effects of all simple and martial weapons and unarmed attacks when attacking your hunted prey.",
        "gainSpecialization": [
            {
                "proficiency": "Simple Weapons, Martial Weapons, Unarmed Attacks",
                "condition": "hunted prey only"
            }
        ],
        "internalNote": "Skill increases through class features are handled in the class object. The limitation to the hunted prey is hardcoded in the weapon class."
    },
    {
        "name":"Trackless Step",
        "desc":"When you move through natural terrains, you are difficult to track. You always gain the benefits of the Cover Tracks action in such terrains, without moving at half your Speed.",
        "hint":"You always gain the benefits of the Cover Tracks action in natural terrains, without moving at half your Speed.",
        "showon":"Survival"
    },
    {
        "name":"Evasion",
        "desc":"You've learned to move quickly to avoid explosions, dragons' breath, and worse. Your proficiency rank for Reflex saves increases to master. When you roll a success on a Reflex save, you get a critical success instead.",
        "hint":"When you roll a success on a Reflex save, you get a critical success instead.",
        "showon":"Reflex",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Vigilant Senses",
        "desc":"Through your adventuring, you've developed keen awareness and attention to detail. Your proficiency rank for Perception increases to master.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Nature's Edge",
        "desc":"You always find the weak points in your foes' defenses when they're on unfavorable terrain. Enemies are flat-footed to you if they're in natural difficult terrain or in difficult terrain resulting from a snare.",
        "hint":"Enemies are flat-footed to you if they're in natural difficult terrain or in difficult terrain resulting from a snare.",
        "showon":"Attacks"
    },
    {
        "name":"Ranger Expertise",
        "desc":"You've practiced your techniques to make them harder to resist. Your proficiency rank for your ranger class DC increases to expert.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Juggernaut",
        "desc":"Your body is accustomed to physical hardship and resistant to ailments. Your proficiency rank for Fortitude saves increases to master. When you roll a success on a Fortitude save, you get a critical success instead.",
        "hint":"When you roll a success on a Fortitude save, you get a critical success instead.",
        "showon":"Fortitude",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Medium Armor Expertise",
        "desc":"You've learned to defend yourself better against attacks. Your proficiency ranks for light armor, medium armor, and unarmored defense increase to expert.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Wild Stride",
        "desc":"You move quickly through obstacles, whether they're tumbled stone, tangled undergrowth, or sucking mud. You can ignore the effects of non-magical difficult terrain. As normal for ignoring difficult terrain, this also lets you treat the hindrances of greater difficult terrain as those of difficult terrain.",
        "hint":"You can ignore the effects of non-magical difficult terrain. As normal for ignoring difficult terrain, this also lets you treat the hindrances of greater difficult terrain as those of difficult terrain.",
        "showon":"Movement"
    },
    {
        "name":"Weapon Mastery",
        "desc":"You fully understand the intricacies of your weapons. Your proficiency ranks for simple and martial weapons and unarmed attacks increase to master.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Improved Evasion",
        "desc":"Your ability to elude danger is matchless. Your proficiency rank for Reflex saves increases to legendary. When you roll a critical failure on a Reflex save, you get a failure instead. When you roll a failure on a Reflex save against a damaging effect, you take half damage.",
        "hint":"When you roll a critical failure on a Reflex save, you get a failure instead. When you roll a failure on a Reflex save against a damaging effect, you take half damage.",
        "showon":"Reflex",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Incredible Senses",
        "desc":"You notice things almost impossible for an ordinary person to detect. Your proficiency rank for Perception increases to legendary.",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Masterful Hunter",
        "desc":"You have honed your abilities as a hunter to incredible levels. Your proficiency rank for your ranger class DC increases to master. When using a ranged weapon that you have master proficiency in, you can ignore the penalty if attacking your hunted prey within the weapon's second and third range increments.\n\nIf you have master proficiency in Perception, you gain a +4 circumstance bonus to Perception checks when you Seek your prey, and if you have master proficiency in Survival, you gain a +4 circumstance bonus to Survival checks when you Track your prey. You also gain an additional benefit depending on your hunter's edge.",
        "hint":"When using a ranged weapon that you have master proficiency in, you can ignore the penalty if attacking your hunted prey within the weapon's second and third range increments.\n\nIf you have master proficiency in Perception, you gain a +4 circumstance bonus to Perception checks when you Seek your prey, and if you have master proficiency in Survival, you gain a +4 circumstance bonus to Survival checks when you Track your prey.",
        "showon":"Attacks, Survival",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
       "name":"Masterful Hunter: Flurry",
       "desc":"You can blend your weapon mastery with skillful targeting to make a series of precise attacks. If you have master proficiency with your weapon, your multiple attack penalty for attacks against your hunted prey is -2 (-1 with an agile weapon) on your second attack of the turn, and -4 (-2 with an agile weapon) on your third and subsequent attacks of the turn.",
       "hint":"If you have master proficiency with your weapon, your multiple attack penalty for attacks against your hunted prey is -2 (-1 with an agile weapon) on your second attack of the turn, and -4 (-2 with an agile weapon) on your third and subsequent attacks of the turn.",
       "showon":"Hunt Prey, Attacks"
    },
    {
       "name":"Masterful Hunter: Outwit",
       "desc":"Your mastery of skills allows you to overwhelm your prey. If you have master proficiency in Deception, Intimidation, Stealth, or the skill you use to Recall Knowledge about your prey, increase the circumstance bonus against the prey with that skill from +2 to +4. If you have master proficiency with your armor, increase the circumstance bonus to AC against the prey from +1 to +2.",
       "hint":"If you have master proficiency in Deception, Intimidation, Stealth, or the skill you use to Recall Knowledge about your prey, increase the circumstance bonus against the prey with that skill from +2 to +4. If you have master proficiency with your armor, increase the circumstance bonus to AC against the prey from +1 to +2.",
       "showon":"Hunt Prey, AC, Arcana, Crafting, Deception, Intimidation, Nature, Occultism, Religion, Society, Stealth"
    },
    {
       "name":"Masterful Hunter: Precision",
       "desc":"Your weapon mastery allows you to hit your prey's vital areas multiple times. The second time in a round you hit your hunted prey, you also deal 1d8 precision damage. At 19th level, your second hit in a round against your hunted prey deals 2d8 precision damage, and your third hit in a round against your hunted prey deals 1d8 precision damage.",
       "hint":"The second time in a round you hit your hunted prey, you also deal 1d8 precision damage. At 19th level, your second hit in a round against your hunted prey deals 2d8 precision damage, and your third hit in a round against your hunted prey deals 1d8 precision damage.",
       "showon":"Hunt Prey, Attacks"
    },
    {
        "name":"Second Skin",
        "desc":"Your armor has become akin to a second skin for you. Your proficiency ranks for light armor, medium armor, and unarmored defense increase to master. When wearing light or medium armor, you can rest normally, rather than receiving poor rest that leaves you fatigued.",
        "hint":"When wearing light or medium armor, you can rest normally, rather than receiving poor rest that leaves you fatigued.",
        "showon":"Defense",
        "internalNote": "Skill increases through class features are handled in the class object."
    },
    {
        "name":"Swift Prey",
        "desc":"You size up your prey with only a glance. You can use Hunt Prey as a free action if it's your first action of your turn.",
        "showon":"Hunt Prey"
    }
]