[
    {
        "id": "2c1ce9e4-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Alarm Snare",
        "level": 1,
        "price": 300,
        "desc": "You create an alarm snare by rigging one or more noisy objects to a trip wire or pressure plate. When you create an alarm snare, you designate a range between 100 to 500 feet at which it can be heard. When a Small or larger creature enters the square, the snare makes a noise loud enough that it can be heard by all creatures in the range you designated.",
        "traits": [
            "Auditory",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cefca-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Caltrop Snare",
        "level": 1,
        "price": 300,
        "desc": "This snare consists of a hidden canister of caltrops attached to a trip wire. When the snare is triggered, it flings the caltrops into either the snare's square or a square adjacent to the snare. You choose which square when you set up the snare.\n\nIf the caltrops scatter into the same square as a creature, that creature must attempt the Acrobatics check immediately.",
        "craftRequirement": "Supply a container of caltrops.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf0ec-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Hampering Snare",
        "level": 1,
        "price": 300,
        "desc": "You arrange brambles, wires, sticky goo, or other materials to interfere with a creature's movement. The square with this snare, as well as three adjacent squares (to form a 10-foot-by-10-foot area), become difficult terrain when the first creature enters the snare's square. The difficult terrain affects the creature's movement right away, including its movement into the triggering square, and it lasts for 1d4 rounds after the snare is triggered. A creature can use an Interact action to clear the difficult terrain out of a single square early.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf1c8-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Marking Snare",
        "level": 1,
        "price": 300,
        "desc": "This snare is often used to mark intruders for later tracking or identification. When you create this snare, you must decide whether to make it a dye or a scent marker. Either type of marking grants a +2 circumstance bonus to Track the creature for up to 24 hours or until the dye or scent is washed off (requiring at least a gallon of water and 10 minutes of scrubbing). A creature that enters a square of the snare must attempt a DC 17 Reflex save.",
        "success": "The creature is unaffected.",
        "failure": "The snare marks the creature.",
        "critfailure": "The snare marks the creature, and the creature is blinded until the end of its next turn.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf29a-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Signaling Snare",
        "level": 1,
        "price": 300,
        "desc": "A subtle snare used in hunting or tracking, a signaling snare often consists of carefully prepared earth, piled sand or stones, specific arrangements of vegetation, and so forth. When a creature enters a square of a signaling snare, nothing happens to the creature, but instead it causes a small, unobtrusive disruption to the terrain that allows the snare's creator or another creature who knows what to look for to determine whether a creature of the appropriate size entered the square.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf36c-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Spike Snare",
        "level": 1,
        "price": 300,
        "desc": "This basic snare consists of hidden spikes that rely on a creature's momentum to lacerate or potentially impale it as it enters the snare's square, dealing |dice=2d8 P| 2d8 piercing damage. The creature must attempt a DC 17 basic Reflex saving throw.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf434-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Dust Pods",
        "level": 1,
        "price": 300,
        "desc": "You hide fragile pods of pollen or other clinging powder that get in the eyes of the first creature that enters the snare's square. The creature must attempt a DC 17 Reflex saving throw. A creature dazzled by the pollen can use an Interact action to attempt a DC 5 flat check to remove the condition.",
        "critsuccess": "The creature is unaffected.",
        "success": "The creature is dazzled for 1 round.",
        "failure": "The creature is dazzled for 10 minutes.",
        "critfailure": "The creature is blinded for 1 round and dazzled for 10 minutes after.",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf68c-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Thunder Snare",
        "level": 2,
        "price": 600,
        "desc": "The snare makes a thunderous noise when a creature enters the snare's square, which can be heard up to 1,000 feet away. The creature must attempt a DC 18 Fortitude saving throw.",
        "critsuccess": "The target is unaffected.",
        "success": "The target is deafened until the end of its next turn.",
        "failure": "As success, and the target also takes |dice=1 Sonic| 1 sonic damage.",
        "critfailure": "As success, and the target also takes |dice=1d4 Sonic| 1d4 sonic damage.",
        "craftRequirement": "1 lesser thunderstone",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf75e-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Grasping Tree",
        "level": 3,
        "price": 900,
        "desc": "You rig tree branches, thin strands of bark, or other plant matter to close in on a creature that enters the snare's square. The first creature to enter the square must attempt a DC 19 Reflex saving throw.",
        "critsuccess": "The target is unaffected.",
        "success": "The target takes |dice=1d4 S| 1d4 slashing damage.",
        "failure": "As success, plus the target is flat-footed.",
        "critfailure": "The target takes |dice=2d4 S| 2d4 slashing damage and is immobilized until it destroys the snare (AC 16, HP 25) or Escapes (DC 19).",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ],
        "sourceBook": "Pathfinder #151: The Show Must Go On"
    },
    {
        "id": "2c1cf81c-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Torrent Snare",
        "level": 3,
        "price": 900,
        "desc": "You pile waterlogged plants or access a nearby source of water to rain down on a Medium or smaller creature that enters the snare's square. When a creature enters the square, the snare's square and all adjacent squares become slippery difficult terrain, and the triggering creature must attempt a DC 19 Reflex saving throw, with the following effects.",
        "success": "The target is unaffected.",
        "failure": "The target falls prone.",
        "critfailure": "The target falls prone and is forced into one of the other squares soaked by the snare.",
        "craftRequirement": "1 lesser thunderstone",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf8da-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Biting Snare",
        "level": 4,
        "price": 1500,
        "desc": "The snare's jaws shut on the leg of a creature that steps on it. The snare deals |dice=5d6 P| 5d6 piercing damage to the first creature that enters its square; that creature must attempt a DC 18 Reflex save.",
        "critsuccess": "The target is unaffected.",
        "success": "The creature takes half damage.",
        "failure": "The creature takes full damage.",
        "critfailure": "The creature takes double damage and takes a -10-foot status penalty to its Speed until it recovers at least 1 Hit Point.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cf998-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Hobbling Snare",
        "level": 4,
        "price": 1500,
        "desc": "You rig vines, ropes, or wires to cinch tight around a creature that triggers this snare. The first creature to enter the square must attempt a DC 20 Reflex save.",
        "critsuccess": "The target is unaffected.",
        "success": "The creature takes a -5-foot status penalty to its Speed for 1 minute or until it Escapes (DC 18).",
        "failure": "As success, but the penalty is -10 feet.",
        "critfailure": "As success, but the penalty is -20 feet.",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cfa56-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Stalker Bane Snare",
        "level": 4,
        "price": 1500,
        "desc": "This snare explodes in a burst of cloying powder that can cling to a creature stepping into its square. A creature that enters the square of a stalker bane snare must attempt a DC 20 Reflex save.",
        "critsuccess": "The target is unaffected.",
        "success": "Powder sticks to the target, causing it to leave behind telltale footprints. Being invisible makes the target hidden, rather than undetected, to creatures that could see it if it weren't invisible.",
        "failure": "Powder clumps on the target, constantly flaking away. Being invisible makes the target concealed, rather than hidden or undetected, to creatures that could see it if it weren't invisible.",
        "critfailure": "As failure, and the creature is blinded until the end of its next turn.",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cfb1e-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Trip Snare",
        "level": 4,
        "price": 1500,
        "desc": "You set a cunning wire to trip a creature. A Medium or smaller creature that enters this snare's square must attempt a DC 20 Reflex save.\n\nIf you want to create a trip snare to trip a larger creature, you must create a group of contiguous snares of a length equal to the edge of that larger creature's space, and the creature must be moving such that it moves into the full set of snares. For example, three trip snares in a 15-foot-line can trip a Huge creature coming down a corridor into the line of snares.",
        "critsuccess": "The target is unaffected.",
        "success": "The creature is flat-footed until the start of its next turn.",
        "failure": "The creature falls prone.",
        "critfailure": "The creature falls prone and takes |dice=1d6 B| 1d6 bludgeoning damage.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "2c1cfbe6-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Warning Snare",
        "level": 4,
        "price": 1500,
        "desc": "Using materials specific to the area, you connect a sound‑making component to a trip wire or a pressure plate. This snare is like an alarm snare, but its subtle sound blends into ambient noise. You can detect this sound as long as you're within 1,000 feet of the snare and aren't prevented from hearing it. Other creatures in that area who are searching might notice the sound if their Perception check result meets or exceeds your Craft DC.",
        "traits": [
            "Auditory",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5db24-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Fang Snare",
        "level": 4,
        "price": 1500,
        "desc": "You set snake fangs, poison stingers, or other venomous animal parts in the ground where they can be touched or stepped on by a creature that enters the snare's square. The first creature to enter the square must attempt a DC 20 Reflex saving throw.",
        "success": "The target is unaffected.",
        "failure": "The target takes |dice=1 P + 2d8 Poison| 1 piercing damage and 2d8 poison damage.",
        "critfailure": "The target takes |dice=2 P + 4d8 Poison| 2 piercing damage and 4d8 poison damage.",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ],
        "sourceBook": "Pathfinder #151: The Show Must Go On"
    },
    {
        "id": "63e5dd36-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Bomb Snare",
        "level": 8,
        "price": 7500,
        "desc": "You create a snare that catalyzes three 3rd-level moderate alchemical bombs of the same type to explode when a creature enters the snare's square. The target and all creatures in adjacent squares must attempt a DC 26 Reflex save, as the snare deals damage equal to three times the direct hit damage from one of the component bombs (for example, 6d6 electricity damage from bottled lightning) with no splash damage or other effects.",
        "critsuccess": "The target is unaffected.",
        "success": "The creature takes half damage and no other effects.",
        "failure": "The creature takes full damage. It also takes all other effects of a direct hit from one of the component bombs (such as flat-footed from bottled lightning or persistent damage from an acid flask).",
        "critfailure": "The creature takes double damage, plus all other effects of a direct hit (as failure).",
        "craftRequirement": "Supply six of the same damaging 3rd-level moderate alchemical bomb.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5de3a-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Grasping Snare",
        "level": 8,
        "price": 7500,
        "desc": "You rig vines and ropes to hold a creature in place. The first creature to enter the square must attempt a DC 26 Reflex save, with the following effects.",
        "critsuccess": "The target is unaffected.",
        "success": "The creature takes a -5-foot status penalty to its Speed for 1 minute or until it Escapes (DC 26).",
        "failure": "The creature is immobilized for 1 round, then takes a -5-foot status penalty to its Speed for 1 minute. Both effects end early if it Escapes (DC 26).",
        "critfailure": "The creature is immobilized for 1 minute or until it Escapes (DC 26).",
        "traits": [
            "Uncommon",
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5df16-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Striking Snare",
        "level": 8,
        "price": 7500,
        "desc": "You affix a trip line or other trigger to a group of either stones or wooden stakes to strike a creature that enters the snare's square. The creature must attempt a DC 26 basic Reflex saving throw. If you choose stones, the snare deals |dice=9d8 B| 9d8 bludgeoning damage; if you choose spikes, it deals |dice=9d8 P| 9d8 piercing damage.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5dfe8-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Bleeding Spines Snare",
        "level": 12,
        "price": 32000,
        "desc": "When a creature enters the square, spines covered in numerous jagged thorns protrude out to stab it, dealing |dice=8d8 P + 2d8 Persistent Bleed| 8d8 piercing damage and 2d8 persistent bleed damage. The creature must attempt a DC 31 basic Reflex saving throw. After the initial trigger, the spines retract and protrude again repeatedly for 1 minute, forcing any creature that enters the space or ends its turn in the space to attempt a Reflex save against the spines' damage.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5e0b0-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Bleeding Spines Snare",
        "level": 12,
        "price": 32000,
        "desc": "This snare sends a powerful series of scything blades to slice through a creature entering the snare's square, dealing |dice=14d8 S| 14d8 slashing damage (DC 31 basic Reflex).",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5e2b8-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Stunning Snare",
        "level": 12,
        "price": 32000,
        "desc": "You rig a snare to disorient a creature with a quick bash, leaving it with little ability to defend itself. The trap deals |dice=6d6 B| 6d6 bludgeoning damage to the first creature to enter its square; that creature must attempt a DC 31 Reflex save.",
        "critsuccess": "The target is unaffected.",
        "success": "The creature takes half damage and is flat-footed for 1 round and stunned 1.",
        "failure": "The creature takes full damage and is flat-footed for 1 round and stunned 2.",
        "critfailure": "The creature takes double damage and is flat-footed for 1 minute and stunned 4.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5e38a-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Hail of Arrows Snare",
        "level": 16,
        "price": 150000,
        "desc": "When a creature enters the snare's square, it releases hundreds upon hundreds of carefully prepared arrows, blanketing a 20-foot radius around the snare's square with massive arrow fire that deals |dice=18d6 P| 18d6 piercing damage. Creatures in the area must attempt a DC 37 basic Reflex saving throw.",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5e45c-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Omnidirectional Spear Snare",
        "level": 16,
        "price": 150000,
        "desc": "As soon as a creature enters the snare's square, the snare unleashes wickedly powerful spears at the creature from all directions, dealing |dice=19d8 P| 19d8 piercing damage (DC 37 basic Reflex).",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5e51a-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Flying Blade Wheel Snare",
        "level": 20,
        "price": 1000000,
        "desc": "When a creature enters the square, a deadly flying wheel of spinning blades launches at it, making a Strike with an attack modifier of +33 and dealing |dice=8d8 S| 8d8 slashing damage. Once on each of your turns, you can use an Interact action within 120 feet of the wheel to cause it to Fly up to 60 feet toward the creature it's chasing and make another Strike if it's within 5 feet of its target after it moves. After 1 minute, the spinning ceases and the wheel falls to the ground. Creatures can destroy the wheel to stop it (AC 37, Fort +29, Ref +20, HP 200, Hardness 10, object immunities).",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    },
    {
        "id": "63e5e65a-b0e2-11ea-b3de-0242ac130004",
        "_className": "Snare",
        "name": "Instant Evisceration Snare",
        "level": 20,
        "price": 1000000,
        "desc": "When a creature enters the snare's square, the snare releases an unbelievable arsenal of blades, dealing |dice=24d8 P| 24d8 piercing damage (DC 45 basic Reflex).",
        "traits": [
            "Consumable",
            "Mechanical",
            "Snare",
            "Trap"
        ]
    }
]