[
    {
        "name": "Acute Scent",
        "desc": "When you Rage, your sense of smell improves. You gain imprecise scent with a range of 30 feet.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "hide": true,
        "senses": [
            {
                "name": "Scent 30 feet (imprecise)"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Acute Vision",
        "desc": "When you are raging, your visual senses improve, granting you darkvision.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "hide": true,
        "senses": [
            {
                "name": "Darkvision"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Animal Skin",
        "desc": "Your proficiency in unarmored defense increases to expert. While you are raging and unarmored, your skin transforms into a thick hide. You gain a +2 item bonus to AC (+3 if you have the greater juggernaut class feature). The thickness of your hide gives you a Dexterity modifier cap to your AC of +3. This item bonus to AC is cumulative with armor potency runes on your explorer's clothing, mage armor, and bracers of armor.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "hide": true,
        "effects": [
            {
                "affected": "AC",
                "cumulative": [
                    "Potency",
                    "Bracers of Armor",
                    "Mage Armor"
                ],
                "type": "item",
                "value": "(Armor().get_Proficiency() == 'Unarmored Defense') ? (Has_Feat(Creature.type, 'Greater Juggernaut') ? 3 : 2) : 0"
            },
            {
                "affected": "Dexterity Modifier Cap",
                "setValue": "(Armor().get_Proficiency() == 'Unarmored Defense') ? 3 : null"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Battleforger",
        "desc": "Your ally can sharpen weapons, polish armor, and apply special techniques to temporarily gain better effects from armaments. By spending 1 hour working on a weapon or armor, they can grant it the effects of a +1 potency rune until your next daily preparations, gaining a +1 item bonus to attack rolls for a weapon or increasing armor's item bonus to AC by 1. This has no effect if the weapon or armor already had a potency rune.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "inputRequired": "While this condition is active, you can apply the Battleforged property to your weapons and armor.",
        "effects": [
            {
                "affected": "Allow Battleforger",
                "toggle": true
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Eternal Bane",
        "desc": "A life of evil has made you a nexus for your deity's vile power. You're continuously surrounded by a bane spell with a spell level equal to half your level (rounded up). The radius is 15 feet, and you can't increase it. You can Dismiss the spell; if you do, it returns automatically after 1 minute.\n\n<header class='spellHeader'>Bane</header>\n\nYou fill the minds of your enemies with doubt. Targets that fail their Will saves take a -1 status penalty to attack rolls as long as they are in the area. Bane can counteract bless.",
        "type": "feats",
        "sortLevel": 0,
        "radius": 15,
        "buff": true,
        "defaultDurations": [
            {
                "duration": -1
            }
        ],
        "inputRequired": "You can dismiss Eternal Bane for 1 minute as an activity.",
        "_extensionFileName": "feats"
    },
    {
        "name": "Eternal Bane Dismissed",
        "desc": "You have Dismissed the bane spell that surrounds you constantly. It will return automatically after 1 minute.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "defaultDurations": [
            {
                "duration": 100
            }
        ],
        "overrideConditions": [
            {
                "name": "Eternal Bane"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Eternal Blessing",
        "desc": "Your good deeds have brought your deity's grace to you for all of eternity. You're continuously surrounded by a bless spell with a spell level equal to half your level (rounded up). The radius is 15 feet, and you can't increase it. You can Dismiss the spell; if you do, it returns automatically after 1 minute.\n\n<header class='spellHeader'>Bless</header>\n\nBlessings from beyond help your companions strike true. You and your allies gain a +1 status bonus to attack rolls while within the emanation. Bless can counteract bane.",
        "type": "feats",
        "sortLevel": 0,
        "radius": 15,
        "buff": true,
        "defaultDurations": [
            {
                "duration": -1
            }
        ],
        "inputRequired": "You can grant Bless to your allies as an activity as needed, and you can dismiss Eternal Blessing for 1 minute as an activity.",
        "effects": [
            {
                "affected": "Attack Rolls",
                "type": "status",
                "value": "1"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Eternal Blessing Dismissed",
        "desc": "You have Dismissed the bless spell that surrounds you constantly. It will return automatically after 1 minute.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "defaultDurations": [
            {
                "duration": 100
            }
        ],
        "overrideConditions": [
            {
                "name": "Eternal Blessing"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Furious Bully",
        "desc": "You bully foes across the battlefield. While raging, you gain a +2 circumstance bonus to Athletics checks for attack actions.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "hide": true,
        "hints": [
            {
                "desc": "While raging, you gain a +2 circumstance bonus to Athletics checks for attack actions.",
                "showon": "Athletics",
                "effects": [
                    {
                        "affected": "Athletics",
                        "type": "circumstance",
                        "value": "2"
                    }
                ]
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Green Tongue",
        "desc": "You share a special kinship with all things green and living. You (and your leshy familiar, if you have one) are constantly under the effects of speak with plants. Most non-creature plants recognize you as a druid of the leaf order and are friendly to you.\n\nYou can ask questions of and receive answers from plants, but the spell doesn't make them more friendly or intelligent than normal. Most normal plants have a distinctive view of the world around them, so they don't recognize details about creatures or know anything about the world beyond their immediate vicinity. Cunning plant monsters are likely to be terse and evasive, while less intelligent ones often make inane comments.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "hints": [
            {
                "desc": "You can ask questions of and receive answers from plants. Most non-creature plants recognize you as a druid of the leaf order and are friendly to you. The spell doesn't make other plants more friendly or intelligent than normal. Most normal plants have a distinctive view of the world around them, so they don't recognize details about creatures or know anything about the world beyond their immediate vicinity. Cunning plant monsters are likely to be terse and evasive, while less intelligent ones often make inane comments.",
                "showon": "Languages, Diplomacy"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Quickened (Enduring Quickness)",
        "desc": "You gain 1 additional action at the start of your turn each round. You can use your extra action to Stride or Leap, or to provide one of the actions needed for a High Jump or Long Jump. If you become quickened from multiple sources, you can use the extra action you've been granted for any single action allowed by any of the effects that made you quickened.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "effects": [
            {
                "affected": "Actions per Turn",
                "value": "1"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Quickened (Eternal Composition)",
        "desc": "You gain 1 additional action at the start of your turn each round. You can use your extra action only to cast a composition cantrip that requires 1 action to cast. If you become quickened from multiple sources, you can use the extra action you've been granted for any single action allowed by any of the effects that made you quickened.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "effects": [
            {
                "affected": "Actions per Turn",
                "value": "1"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Quickened (Weapon Supremacy)",
        "desc": "You gain 1 additional action at the start of your turn each round. You can use your extra action only to Strike. If you become quickened from multiple sources, you can use the extra action you've been granted for any single action allowed by any of the effects that made you quickened.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "effects": [
            {
                "affected": "Actions per Turn",
                "value": "1"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Raging Athlete",
        "desc": "Physical obstacles can't hold back your fury. While you are raging, you gain a climb Speed and swim Speed equal to your land Speed and the DC of High Jumps and Long Jumps decreases by 10. Your distance for a vertical Leap increases to 5 feet vertically, and your distance for a horizontal Leap increases to 15 feet if your Speed is at least 15 feet and to 20 feet if your Speed is at least 30 feet.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "hide": true,
        "hints": [
            {
                "desc": "The DC of High Jumps and Long Jumps decreases by 10. Your distance for a vertical Leap increases to 5 feet vertically, and your distance for a horizontal Leap increases to 15 feet if your Speed is at least 15 feet and to 20 feet if your Speed is at least 30 feet.",
                "showon": "Athletics"
            }
        ],
        "effects": [
            {
                "affected": "Climb Speed",
                "setValue": "Speed('Land Speed')"
            },
            {
                "affected": "Swim Speed",
                "setValue": "Speed('Land Speed')"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Second Wind",
        "desc": "You can enter a second rage, but afterward you need to catch your breath. You can Rage without waiting for 1 minute after the previous Rage (or 1 round, with quick rage), but when you end this second Rage, you're fatigued until you rest for 10 minutes.",
        "type": "feats",
        "sortLevel": 0,
        "buff": true,
        "defaultDurations": [
            {
                "duration": 0
            }
        ],
        "inputRequired": "While this is activated, you can enter Rage without waiting.",
        "endsWithConditions": [
            {
                "name": "Rage"
            }
        ],
        "effects": [
            {
                "affected": "Rage Cooldown",
                "setValue": "0"
            }
        ],
        "gainConditions": [
            {
                "name": "Second Wind Fatigue",
                "persistent": true
            }
        ],
        "overrideConditions": [
            {
                "name": "Second Wind Fatigue"
            }
        ],
        "_extensionFileName": "feats"
    },
    {
        "name": "Second Wind Fatigue",
        "desc": "You need to catch your breath after entering a second rage. You are fatigued until you rest for 10 minutes.",
        "type": "feats",
        "sortLevel": 0,
        "inputRequired": "Remove the condition after you rest for 10 minutes.",
        "gainConditions": [
            {
                "ignorePersistent": true,
                "name": "Fatigued"
            }
        ],
        "_extensionFileName": "feats"
    }
]
