[
    {
        "name": "Secret-Keeper's Mask (Father Skinsaw)",
        "desc": "You have been dealt a bleeding wound that is particularly mutilating. The DC of flat checks to recover from the persistent bleed damage is increased by 2, and you have a -2 status penalty to Deception, Diplomacy, and Performance checks while you are bleeding and for 1 minute after you cease bleeding.",
        "sourceBook": "GM's Toolkit: Secret Keeper's Mask",
        "_extensionFileName": "GMToolkit_SecretKeepersMask",
        "type": "wornitems",
        "sortLevel": 0,
        "defaultDurations": [
            {
                "duration": -1
            }
        ],
        "inputRequired": "Remove the condition 1 minute after you stop bleeding.",
        "hints": [
            {
                "desc": "You have been dealt a bleeding wound that is particularly mutilating. The DC of flat checks to recover from the persistent bleed damage is increased by 2.",
                "showon": "Effects"
            }
        ],
        "effects": [
            {
                "affected": "Deception",
                "type": "status",
                "value": "-2"
            },
            {
                "affected": "Diplomacy",
                "type": "status",
                "value": "-2"
            },
            {
                "affected": "Performance",
                "type": "status",
                "value": "-2"
            }
        ]
    },
    {
        "name": "Secret-Keeper's Mask (Father Skinsaw) (Caster)",
        "desc": "The bleeding wound you have caused is particularly mutilating. The DC of flat checks to recover from the persistent bleed damage is increased by 2, and the target creature has a -2 status penalty to Deception, Diplomacy, and Performance checks while it is bleeding and for 1 minute after it ceases bleeding.",
        "sourceBook": "GM's Toolkit: Secret Keeper's Mask",
        "_extensionFileName": "GMToolkit_SecretKeepersMask",
        "type": "wornitems",
        "sortLevel": 0,
        "buff": true,
        "defaultDurations": [
            {
                "duration": -1
            }
        ],
        "inputRequired": "Remove the condition 1 minute after the target stops bleeding."
    },
    {
        "name": "Secret-Keeper's Mask (Gray Master)",
        "desc": "You have created an illusory duplicate of the item you just stole. This duplicate has the appropriate appearance and weight, but it doesn't make sounds or generate smells. The illusion vanishes after 10 minutes, or earlier if anyone examines or manipulates the illusory duplicate (such as to try to use it).",
        "sourceBook": "GM's Toolkit: Secret Keeper's Mask",
        "_extensionFileName": "GMToolkit_SecretKeepersMask",
        "type": "wornitems",
        "sortLevel": 0,
        "buff": true,
        "defaultDurations": [
            {
                "duration": 1000
            }
        ],
        "inputRequired": "Remove the condition if anyone examines or manipulates the illusory duplicate (such as to try to use it)."
    },
    {
        "name": "Secret-Keeper's Mask (Reaper of Reputation)",
        "desc": "For the duration, any normal speech you utter can, at your discretion, be inaudible to all creatures except the target creature, who can hear you clearly regardless of ambient sound so long as it is within 1 mile. This ability doesn't silence magical words, such as the verbal component of spellcasting or commands to activate magic items.",
        "sourceBook": "GM's Toolkit: Secret Keeper's Mask",
        "_extensionFileName": "GMToolkit_SecretKeepersMask",
        "type": "wornitems",
        "sortLevel": 0,
        "buff": true,
        "defaultDurations": [
            {
                "duration": 1000
            }
        ],
        "hints": [
            {
                "desc": "Any normal speech you utter can, at your discretion, be inaudible to all creatures except the target creature, who can hear you clearly regardless of ambient sound so long as it is within 1 mile. This ability doesn't silence magical words, such as the verbal component of spellcasting or commands to activate magic items.",
                "showon": "Languages"
            }
        ]
    }
]
