[
    {
        "key": "effects",
        "priority": "00",
        "name": "Add effects",
        "desc": "You can add numeral effects here that are applied for the given duration."
    },
    {
        "parent": "effects",
        "key": "source",
        "priority": "00",
        "name": "Source",
        "desc": "Give a useful descriptor of the source of the effect, or a name for the effect."
    },
    {
        "parent": "effects",
        "key": "affected",
        "priority": "01",
        "name": "Affected attribute",
        "desc": "The effect will be applied to this attribute. This can be a skill, an ability or certain aspects of the character (like AC, Max Bulk etc.). Positive effects will be considered bonuses, and negative effects penalties, except for effects on Bulk.",
        "examples": "effects affected"
    },
    {
        "parent": "effects",
        "key": "setValue",
        "priority": "02",
        "name": "Absolute effect value",
        "desc": "If this field has a number value (even 0), the attribute will be set to this exact value before circumstance and status bonuses are applied. You can use simple calculations and variables like: Level, Modifier('Strength'), Skill_Level('Acrobatics'). If this field resolves to any number, any relative value on this effect will not be applied.",
        "examples": "effects setvalue"
    },
    {
        "parent": "effects",
        "key": "value",
        "priority": "03",
        "name": "Relative effect value",
        "desc": "This is the amount by which the attribute will change. You can use simple calculations and variables like: Level, Modifier('Strength'), Skill_Level('Acrobatics'). If this field resolves to 0, the effect will not be applied.",
        "examples": "effects value"
    },
    {
        "parent": "effects",
        "key": "title",
        "priority": "04",
        "group": "",
        "name": "Effect title",
        "desc": "You can choose to show a word instead of a number on the effect. This is useful, for example, in Size effects, where you might want to set Size to 2 (for Large), but show 'Size: Large' instead. The title is also used for extra damage on attacks and to change weapon traits. This title can be calculated like values, and use 'value' and 'setValue' as variables to reference the relative or absolute value of the effect.",
        "examples": "effects title"
    },
    {
        "parent": "effects",
        "key": "toggle",
        "priority": "05",
        "name": "On/Off effect",
        "desc": "If this is set, the effect doesn't need a value, but just sets a certain state. Some effects like 'Ignore Armor Penalty' use this. This overrides both absolute and relative values on this effect.",
        "type": "checkbox"
    },
    {
        "parent": "effects",
        "key": "type",
        "priority": "06",
        "name": "Effect type",
        "desc": "Bonuses and penalties of the same type do not stack, except for untyped effects. Keep the field blank for an untyped bonus.",
        "locked": true,
        "examples": "effects type"
    }
]