[
    {
        "_className": "AlchemicalBomb",
        "id": "85e00a17-cd1e-43a3-87fb-e1c823046343",
        "name": "Holy Water",
        "actions": "1A",
        "activationType": "Strike",
        "bulk": "L",
        "desc": "This vial contains water blessed by a good deity. You activate a vial of holy water by throwing it as a Strike. It’s a simple thrown weapon with a range increment of 20 feet. Unlike an alchemical bomb, it doesn’t add the manipulate trait to the attack made with it.\n\nHoly water deals 1d6 good damage and 1 good splash damage. It damages only fiends, undead, and creatures that have a weakness to good damage.",
        "dicenum": 1,
        "dicesize": 6,
        "dmgType": "Good",
        "extraDamage": "+1 Good Splash",
        "group": "Bomb",
        "hands": 1,
        "level": 1,
        "price": 300,
        "prof": "Simple Weapons",
        "ranged": 20,
        "subType": "Lesser",
        "subTypeDesc": "The bomb deals 1d8 fire damage, 1 persistent fire damage, and 1 fire splash damage.",
        "traits": [
            "Consumable",
            "Divine",
            "Good",
            "Splash",
            "Thrown 20 ft."
        ],
        "usage": "held in 1 hand"
    },
    {
        "desc": "This token can be activated only on an unoccupied patch of earth or soil. When activated, this token transforms into an oak tree, 60 feet tall with a 5-foot-wide trunk. The tree continues to live and grow if conditions are favorable.",
        "id": "a99db049-c745-4751-9062-676a757232c3",
        "level": 7,
        "name": "Feather Token (Tree)",
        "price": 3800,
        "traits": [
            "Conjuration",
            "Consumable",
            "Magical"
        ],
        "_className": "OtherConsumable",
        "activationType": "Interact"
    },
    {
        "desc": "This tapered candle has a golden wick that burns with white fire. You activate the candle by lighting it, which causes creatures within 10 feet of the candle to find it difficult to tell falsehoods. Creatures in the area receive a -4 status penalty to Lie.\n\nIn addition, when first entering the affected area, each creature (including you) must succeed at a DC 26 Will save or be unable to tell any deliberate lies while within 10 feet of the lit candle. This lasts for as long as the candle is lit. Once lit, the candle burns for 10 minutes, and it cannot be extinguished.",
        "id": "89bee3a1-8e09-11ea-9fab-e92c63c14723",
        "level": 8,
        "name": "Candle of Truth",
        "price": 7500,
        "traits": [
            "Consumable",
            "Enchantment",
            "Magical",
            "Mental",
            "Uncommon"
        ],
        "_className": "OtherConsumable",
        "activationType": "Interact",
        "gainConditions": [
            {
                "_className": "ConditionGain",
                "duration": 1000,
                "name": "Candle of Truth",
                "source": "Candle of Truth"
            }
        ]
    }
]