[
    {
        "name": "Gourd Head",
        "id": "082244c0-e1fd-4f48-8053-d09da1e388fc",
        "desc": "You have a large gourd for a skull. Your knowledge comes from within your spirit, rather than a physical brain, and you have found a handier use for the space inside your head. You can store a collection of up to 1 Bulk of objects within your head. The DC of checks to Steal objects from inside your head increases by 4. Additionally, if you store only one object within your head, you can draw it effortlessly into your hand as part of another action to use the object. Drawing the item grants this other action the manipulate trait.",
        "hide": true,
        "gainInventory": [
            {
                "bulkLimit": 1
            }
        ]
    },
    {
        "name": "Iron Gut",
        "id": "00d7f12b-0dd1-4559-a596-22185ec7fa52",
        "desc": "Your mouth, esophagus, and stomach are incredibly elastic and tougher than metal. For the duration of the spell, you can reach down your throat to store or retrieve a single object of light or negligible Bulk in your stomach, as though your stomach were a backpack or other container. Storing and retrieving an item in this way requires an Interact action. The object must be small enough to reasonably fit within your stomach. It is very difficult for other creatures to notice that you are hiding an object in this way; passive observers can't possibly notice and you gain a +4 circumstance bonus to your Stealth checks to Conceal the Object unless the searcher specifically searches your mouth and stomach. If at the end of the spell's duration you still have an object stored in your stomach, it is violently expelled, dealing |dice=1d6| 1d6 damage to you.",
        "hide": true,
        "gainInventory": [
            {
                "bulkLimit": 0.1
            }
        ]
    },
    {
        "name": "Aeon Stone (Dull Gray)",
        "id": "8a187528-2072-4e6b-8c18-1b8f10c9ae38",
        "desc": "A dull gray aeon stone has lost its special magical properties, sometimes as a result of overusing a tourmaline sphere or pale lavender ellipsoid aeon stone. It still orbits your head like any other aeon stone and can thus serve as a stylish, hands-free option for various spells that target an object, like continual flame.\n\nDull gray aeon stones have no resonant power.",
        "level": 1,
        "price": 900,
        "traits": [
            "Uncommon",
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn",
        "isAeonStone": true
    },
    {
        "name": "Ring of Discretion",
        "id": "68dade25-080b-48ed-bfe5-018a3ee15f15",
        "desc": "This ring magically conceals any armor and sheathed weapons you're wearing by either turning them invisible or creating the illusion of ordinary clothes. The ring doesn't change your appearance beyond concealing weapons and armor. As soon as you wield a weapon, the weapon becomes obvious to onlookers and is no longer affected by the ring until you sheathe the weapon for at least 1 minute. A creature can disbelieve this illusion by Seeking or any time it hits you with an attack.",
        "sourceBook": "Pathfinder #157: Devil at the Dreaming Palace",
        "level": 1,
        "price": 1500,
        "traits": [
            "Uncommon",
            "Illusion",
            "Invested",
            "Magical",
            "Visual"
        ],
        "usage": "worn ring",
        "hints": [
            {
                "desc": "The ring of discretion magically conceals any armor and sheathed weapons you're wearing by either turning them invisible or creating the illusion of ordinary clothes. The ring doesn't change your appearance beyond concealing weapons and armor. As soon as you wield a weapon, the weapon becomes obvious to onlookers and is no longer affected by the ring until you sheathe the weapon for at least 1 minute. A creature can disbelieve this illusion by Seeking or any time it hits you with an attack.",
                "showon": "Deception"
            }
        ]
    },
    {
        "name": "Archaic Wayfinder",
        "id": "7625bac1-e435-4536-947a-af51caa9d402",
        "desc": "An archaic wayfinder functions as a compass and acts as a repository for one cantrip cast into it. To fill an archaic wayfinder, a spellcaster casts the chosen cantrip into the empty device, providing any necessary cost; the spell cannot be one that is normally cast as a free action or reaction. Activating an archaic wayfinder is the same as the casting for the relevant spell. Once it has been activated, it becomes empty again. An archaic wayfinder can hold an aeon stone and activate its resonant power. An archaic wayfinder counts against the limit of one wayfinder with a slotted resonant aeon stone.",
        "sourceBook": "World Guide",
        "level": 2,
        "price": 3000,
        "traits": [
            "Uncommon",
            "Evocation",
            "Magical"
        ],
        "usage": "held in 1 hand",
        "isWayfinder": 1,
        "storedSpells": [
            {
                "available": 1,
                "level": 0
            }
        ]
    },
    {
        "name": "Brooch of Shielding",
        "id": "21db4d88-1b38-4beb-b4c5-28e5483cb5b0",
        "desc": "This piece of silver or gold jewelry is adorned with miniature images of kite shields and can be used to fasten a cloak or cape. The brooch automatically absorbs magic missile spells targeting you. A brooch of shielding can absorb 30 individual magic missiles before it melts and becomes useless. Sometimes when found, a brooch of shielding has already absorbed a number of missiles.",
        "level": 2,
        "price": 3000,
        "traits": [
            "Uncommon",
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "The brooch automatically absorbs magic missile spells targeting you. A brooch of shielding can absorb 30 individual magic missiles before it melts and becomes useless.",
                "showon": "Defense"
            }
        ]
    },
    {
        "name": "Hand of the Mage",
        "id": "a5aa952e-7eab-4f49-9955-fd19ce8b3e1f",
        "desc": "This mummified elf hand hangs on a golden chain, its gnarled fingers locked in a peculiar pattern.",
        "level": 2,
        "bulk": "L",
        "price": 3000,
        "traits": [
            "Evocation",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "activities": [
            {
                "name": "Hand of the Mage",
                "source": "a5aa952e-7eab-4f49-9955-fd19ce8b3e1f",
                "actions": "2A",
                "activationType": "Command, Envision",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "desc": "You cast mage hand.",
                "castSpells": [
                    {
                        "name": "Mage Hand"
                    }
                ],
                "traits": [
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Handwraps of Mighty Blows",
        "id": "89c3c5a2-8e09-11ea-9fab-e92c63c14723",
        "desc": "As you invest these embroidered strips of cloth, you must meditate and slowly wrap them around your hands. These handwraps have weapon runes etched into them to give your unarmed attacks the benefits of those runes, making your unarmed attacks work like magic weapons. For example, +1 striking handwraps of mighty blows would give you a +1 item bonus to attack rolls with your unarmed attacks and increase the damage of your unarmed attacks from one weapon die to two (normally 2d4 instead of 1d4, but if your fists have a different weapon damage die or you have other unarmed attacks, use two of that die size instead).\n\nYou can upgrade, add, and transfer runes to and from the handwraps just as you would for a weapon, and you can attach talismans to the handwraps. Treat the handwraps as melee weapons of the brawling group with light Bulk for these purposes. Property runes apply only when they would be applicable to the unarmed attack you're using. For example, a property that must be applied to a slashing weapon wouldn't function when you attacked with a fist, but you would gain its benefits if you attacked with a claw or some other slashing unarmed attack.",
        "level": 2,
        "price": 3500,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn gloves",
        "isHandwrapsOfMightyBlows": true,
        "moddable": true,
        "potencyRune": 1
    },
    {
        "name": "Hat of Disguise",
        "id": "d320c1ca-396f-4d9a-a1c5-775800cde0ab",
        "desc": "This ordinary-looking hat allows you to cloak yourself in illusions.",
        "level": 2,
        "price": 3000,
        "traits": [
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn headwear",
        "activities": [
            {
                "name": "Hat of Disguise",
                "source": "d320c1ca-396f-4d9a-a1c5-775800cde0ab",
                "actions": "1 minute",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "The hat casts a 1st-level illusory disguise spell on you. While setting up the disguise, you can magically alter the hat to appear as a comb, ribbon, helm, or other piece of headwear.",
                "castSpells": [
                    {
                        "level": 1,
                        "name": "Illusory Disguise"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Wayfinder",
        "id": "4c5d0fa0-fb67-4e5a-80af-dd450eba7cf4",
        "desc": "This compact compass repurposes ancient technology to draw fantastic powers from the mysterious magical items called aeon stones. It serves as a badge of office for agents of the Pathfinder Society and as a status symbol among adventurers of any stripe. A wayfinder functions as a compass.\n\nAn indentation in the middle of the wayfinder can hold a single aeon stone. Placing an aeon stone in this indentation provides you all the benefits of having the aeon stone orbiting your head, but it protects the stone from being noticed or stolen as easily. You invest a wayfinder and the aeon stone within it simultaneously, and they count as only one item toward your investiture limit. An invested aeon stone slotted in a wayfinder also grants its resonant power.\n\nIf you have more than one wayfinder with an invested aeon stone on your person at a given time, destructive interference from their resonance prevents you from gaining benefits from any of them. You can still benefit from additional aeon stones orbiting your head, just not in wayfinders.\n\nAll Pathfinders have access.",
        "level": 2,
        "price": 2800,
        "traits": [
            "Uncommon",
            "Evocation",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isWayfinder": 1,
        "activities": [
            {
                "name": "Wayfinder",
                "source": "4c5d0fa0-fb67-4e5a-80af-dd450eba7cf4",
                "actions": "1A",
                "activationType": "Command",
                "desc": "The wayfinder is targeted by a 1st-level light spell.",
                "castSpells": [
                    {
                        "level": 1,
                        "name": "Light"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Aeon Stone (Dusty Rose Prism)",
        "id": "83dcde89-4e2e-432f-b794-a6ef45950b90",
        "desc": "This aeon stone allows you to cast the 1st-level shield cantrip as an arcane innate spell, surrounding yourself in pink energy.\n\nThe resonant power increases the damage prevented by your aeon stone's shield spell from 5 to 10.",
        "access": "Member of the Pathfinder Society.",
        "sourceBook": "Pathfinder Society Guide",
        "level": 3,
        "price": 5000,
        "traits": [
            "Uncommon",
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn",
        "isAeonStone": true,
        "hints": [
            {
                "desc": "The resonant power increases the damage prevented by your aeon stone's shield spell from 5 to 10.",
                "showon": "Shield",
                "resonant": true
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Arcane",
                "spells": [
                    {
                        "locked": true,
                        "name": "Shield"
                    }
                ]
            }
        ]
    },
    {
        "name": "Aeon Stone (Pearly White Spindle)",
        "id": "faeec444-da09-4439-908d-84e271c2db5c",
        "desc": "When you invest this aeon stone, it slowly starts healing your wounds, restoring 1 HP every minute.\n\nThe resonant power grants you resistance 1 to negative damage.",
        "access": "Member of the Pathfinder Society.",
        "sourceBook": "Pathfinder Society Guide",
        "level": 3,
        "price": 6000,
        "traits": [
            "Uncommon",
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn",
        "isAeonStone": true,
        "hints": [
            {
                "desc": "The pearly white spindle aeon stone slowly heals your wounds, restoring 1 HP every minute. (Manually restore HP as needed.)",
                "showon": "Health"
            }
        ],
        "effects": [
            {
                "affected": "Negative Damage Resistance",
                "value": "1",
                "resonant": true
            }
        ]
    },
    {
        "name": "Bracelet of Dashing",
        "id": "88de530a-913b-11ea-bb37-0242ac130002",
        "desc": "This jangling, silvery bracelet makes you lighter on your feet, giving you a +1 item bonus to Acrobatics checks.",
        "level": 3,
        "bulk": "L",
        "price": 5800,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Acrobatics",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Bracelet of Dashing",
                "source": "88de530a-913b-11ea-bb37-0242ac130002",
                "actions": "1A",
                "activationType": "Command",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You gain a +10-foot status bonus to Speed for 1 minute.",
                "gainConditions": [
                    {
                        "duration": 100,
                        "name": "Bracelet of Dashing",
                        "source": "Bracelet of Dashing"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Bracers of Missile Deflection",
        "id": "f9eb15ad-fccf-4682-b35a-2eba31964d78",
        "desc": "These bracers are made from plates of durable mithral and gleam like the summer sun.",
        "level": 3,
        "bulk": "L",
        "price": 52000,
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn bracers",
        "activities": [
            {
                "name": "Bracers of Missile Deflection",
                "source": "f9eb15ad-fccf-4682-b35a-2eba31964d78",
                "actions": "Reaction",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "trigger": "A ranged weapon attack hits you but doesn't critically hit",
                "requirements": "You are aware of the attack and not flat-footed",
                "desc": "The bracers send the missile off-course. You gain a +2 circumstance bonus to AC against the triggering attack. If this would cause the attack to be a failure, the attack misses you.",
                "traits": [
                    "Abjuration",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Channel Protection Amulet",
        "id": "a312982e-a189-4637-ac9b-fbcca9a23cbc",
        "desc": "This nugget of polished tektite is trapped in a cage of braided wire and hangs from a silken cord. When wearing this amulet, you gain resistance 5 against damage from harm spells if you're living, or against heal spells if you're undead.",
        "level": 3,
        "price": 5600,
        "traits": [
            "Uncommon",
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "When wearing the amulet, you gain resistance 5 against damage from harm spells if you're living, or against heal spells if you're undead.",
                "showon": "Resistances"
            }
        ],
        "effects": [
            {
                "affected": "Harm/Heal Spell Damage Resistance",
                "value": 5
            }
        ]
    },
    {
        "name": "Coyote Cloak",
        "id": "825c4ba2-616f-4f74-9148-c740e14544a6",
        "desc": "This dusty coat is made of mangy brown-and-gray coyote fur. You gain a +1 item bonus to Survival checks. If you critically succeed at your Survival check to Subsist, you can feed twice as many additional creatures.",
        "level": 3,
        "price": 6000,
        "traits": [
            "Divination",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "hints": [
            {
                "desc": "If you critically succeed at your Survival check to Subsist, you can feed twice as many additional creatures.",
                "showon": "Survival"
            }
        ],
        "effects": [
            {
                "affected": "Survival",
                "type": "item",
                "value": 1
            }
        ]
    },
    {
        "name": "Crafter's Eyepiece",
        "id": "66c0f3c3-3922-4c0a-b368-076213a1d1e8",
        "desc": "This rugged metal eyepiece etched with square patterns is designed to be worn over a single eye. Twisting the lens reveals a faint three-dimensional outline of an item you plan to build or repair, with helpful labels on the component parts. While worn, this eyepiece gives you a +1 item bonus to Crafting checks. When you Repair an item, increase the Hit Points restored by 15 per proficiency rank instead of 10.",
        "level": 3,
        "price": 6000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "When you Repair an item, increase the Hit Points restored by 15 per proficiency rank instead of 10.",
                "showon": "Crafting"
            }
        ],
        "effects": [
            {
                "affected": "Crafting",
                "type": "item",
                "value": 1
            }
        ]
    },
    {
        "name": "Dancing Scarf",
        "id": "6f799cb3-0ec6-4ea3-aafb-c530bf85db82",
        "desc": "This long and billowing scarf is typically woven of silk or sheer fabric and adorned with bells or other jangling bits of shiny metal. It grants a +1 item bonus to Performance checks to dance.",
        "level": 3,
        "price": 6000,
        "traits": [
            "Illusion",
            "Invested",
            "Magical",
            "Visual"
        ],
        "usage": "worn belt",
        "hints": [
            {
                "desc": "This dancing scarf grants a +1 item bonus to Performance checks to dance.",
                "showon": "Performance",
                "effects": [
                    {
                        "affected": "Performance",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Dancing Scarf",
                "source": "6f799cb3-0ec6-4ea3-aafb-c530bf85db82",
                "actions": "1A",
                "activationType": "Interact",
                "requirements": "On your most recent action, you succeeded at a Performance check to dance",
                "desc": "You become concealed until the beginning of your next turn.",
                "gainConditions": [
                    {
                        "duration": 10,
                        "name": "Concealed",
                        "source": "Dancing Scarf"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical",
                    "Visual"
                ]
            }
        ]
    },
    {
        "name": "Doubling Rings",
        "id": "89c3ecb6-8e09-11ea-9fab-e92c63c14723",
        "desc": "This item consists of two magically linked rings: an intricate, gleaming golden ring with a square-cut ruby, and a thick, plain iron ring. When you wield a melee weapon in the hand wearing the golden ring, the weapon's fundamental runes are replicated onto any melee weapon you wield in the hand wearing the iron ring. (The fundamental runes are weapon potency and striking, which add an item bonus to attack rolls and extra weapon damage dice, respectively.) Any fundamental runes on the weapon in the hand wearing the iron ring are suppressed.\n\nThe replication functions only if you wear both rings, and it ends as soon as you cease wielding a melee weapon in one of your hands. Consequently, the benefit doesn't apply to thrown attacks or if you're holding a weapon but not wielding it (such as holding in one hand a weapon that requires two hands to wield).",
        "level": 3,
        "price": 5000,
        "traits": [
            "Evocation",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isDoublingRings": "Doubling Rings",
        "data": [
            {
                "name": "gold",
                "show": false
            },
            {
                "name": "iron",
                "show": false
            },
            {
                "name": "propertyRunes",
                "show": false,
                "value": "FALSE"
            }
        ]
    },
    {
        "name": "Everyneed Pack",
        "id": "a01501e1-cf5f-44e1-b632-6cc51a358c67",
        "desc": "Constructed of green material and decorated with a white Glyph of the Open Road, a dozen or more small pockets line the inside of this pack. The pack is enchanted so that each pocket contains common, mundane gear, each item worth no more than 1 gp, such as chalk, flint and steel, and string. It doesn't contain any armor, shields, weapons, or items made of any kind of precious material. Keep track of the exact value of the gear you retrieve from the pack. The pack empties after 8 gp worth of items of your choice are removed, after which it becomes a mundane backpack.\n\n(The everyneed pack comes with a backpack. When the everyneed pack empties, you can drop it and keep the backpack.)",
        "sourceBook": "Pathfinder Society Guide",
        "level": 3,
        "price": 2000,
        "traits": [
            "Uncommon",
            "Conjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn on belt",
        "activities": [
            {
                "name": "Everyneed Pack",
                "source": "a01501e1-cf5f-44e1-b632-6cc51a358c67",
                "actions": "1 minute",
                "activationType": "Interact",
                "frequency": "once per hour",
                "cooldown": 6000,
                "desc": "You draw any number of pieces of mundane gear from the pack with a combined value of 1 gp or less.",
                "traits": [
                    "Uncommon",
                    "Conjuration",
                    "Invested",
                    "Magical"
                ]
            }
        ],
        "gainItems": [
            {
                "name": "Backpack",
                "type": "adventuringgear"
            }
        ]
    },
    {
        "name": "Fashionable Wayfinder",
        "id": "f80c72bf-2387-416e-b095-d002e59d7276",
        "desc": "Fashionable wayfinders allow you to be dressed for success in almost any situation. In addition to the effects of a wayfinder, a fashionable wayfinder can attune to up to three sets of mundane clothing in your possession during your daily preparations. A fashionable wayfinder has the following activation.",
        "access": "Member of the Pathfinder Society.",
        "sourceBook": "Pathfinder Society Guide",
        "level": 3,
        "price": 5000,
        "traits": [
            "Uncommon",
            "Conjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isWayfinder": 1,
        "activities": [
            {
                "name": "Fashionable Wayfinder",
                "source": "f80c72bf-2387-416e-b095-d002e59d7276",
                "actions": "1A",
                "activationType": "Envision",
                "desc": "You call one of the attuned sets of clothing onto yourself, changing clothes instantly and leaving you either holding the old set of clothing or with the old set folded neatly on the floor if you don't have a free hand to hold it. This activation can't change you into or out of a suit of armor of any kind. While the activation can transport the chosen attuned set of clothing onto you from up to 60 feet away, it can't transport any other creatures or items that might have been stored in the clothing.",
                "traits": [
                    "Uncommon",
                    "Conjuration",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Golden Legion Epaulet",
        "id": "53350a40-03f2-402d-b196-6be2ffc4ade4",
        "desc": "These gleaming golden epaulets are issued to Eagle Knight officers and worn as part of the uniform. While they can be enchanted to provide a variety of effects, the Golden Legion epaulet remains the most common.",
        "sourceBook": "World Guide",
        "level": 3,
        "bulk": "L",
        "price": 5500,
        "traits": [
            "Uncommon",
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn epaulet",
        "activities": [
            {
                "name": "Golden Legion Epaulet",
                "source": "53350a40-03f2-402d-b196-6be2ffc4ade4",
                "actions": "1A",
                "activationType": "Command",
                "frequency": "once per day",
                "cooldown": 144000,
                "target": "area",
                "desc": "Issue an order as part of the command. You and each ally within 60 feet who follows that order gain a +1 status bonus to attack rolls, damage rolls, and saving throws against fear until the beginning of your next turn.",
                "gainConditions": [
                    {
                        "duration": 10,
                        "name": "Golden Legion Epaulet",
                        "source": "Golden Legion Epaulet",
                        "targetFilter": "caster"
                    },
                    {
                        "duration": 10,
                        "name": "Golden Legion Epaulet",
                        "source": "Golden Legion Epaulet",
                        "targetFilter": "target"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Hag Eye",
        "id": "36e08a07-d905-4f6b-9d8b-aa02c86d0ab4",
        "desc": "This item appears to be an ordinary semiprecious stone and is typically mounted on a brooch or ring, but the stone is, in fact, an eyeball. This illusion can be seen through with true seeing or similar magic, and anyone who interacts with the item feels its wet and sticky surface, allowing them to attempt to disbelieve the illusion (DC 19). Many hags claim a hag eye is more effective if plucked from a living, awake creature, but this is likely just a convenient excuse for sadism.\n\nThe hag eye produces no direct benefit for the wearer, but allows the hag who created it, or any member of her coven, to peer through the eye using the Seek action. This has no range limit, provided the hag is on the same plane.\n\nAny damage dealt to the eye destroys it. If this happens while a hag is looking through it, the hag is blinded for 1 hour.",
        "sourceBook": "Bestiary 3",
        "level": 3,
        "price": 5000,
        "traits": [
            "Rare",
            "Divination",
            "Invested",
            "Occult",
            "Scrying"
        ],
        "usage": "worn",
        "craftRequirement": "You must be a hag.",
        "hints": [
            {
                "desc": "The hag eye allows the hag who created it, or any member of her coven, to peer through the eye using the Seek action. This has no range limit, provided the hag is on the same plane.",
                "showon": "Perception"
            }
        ]
    },
    {
        "name": "Hat of the Magi",
        "id": "16fbd1dd-c85f-401e-8c99-46052e2dc0b0",
        "desc": "This hat comes in many forms, such as a colorful turban or a pointy hat with a brim, and can bear symbols or runes. It grants you a +1 item bonus to Arcana checks and allows you to cast the prestidigitation cantrip as an arcane innate spell.",
        "level": 3,
        "price": 5000,
        "traits": [
            "Arcane",
            "Conjuration",
            "Invested"
        ],
        "usage": "worn headwear",
        "effects": [
            {
                "affected": "Arcana",
                "type": "item",
                "value": 1
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Arcane",
                "spells": [
                    {
                        "locked": true,
                        "name": "Prestidigitation"
                    }
                ]
            }
        ]
    },
    {
        "name": "Manacles of Persuasion",
        "id": "261d1551-7333-464b-8531-3cce086e79f3",
        "desc": "These sturdy, average manacles are connected by a thick iron chain that is much heavier than its appearance suggests at a glance. Followers of Zon-Kuthon sometimes employ manacles of persuasion against captured enemies and spies. When the manacles are locked around an immobilized creature's wrists, they begin to sap the life out of the victim, dealing 2 negative damage per hour until the creature falls unconscious. The effect is nonlethal, so the damage doesn't cause the creature to become dying. While the creature is unconscious, the manacles deal no damage and allow the creature to recover Hit Points normally to a maximum of 10 Hit Points, at which point the manacles begin to deal damage once more. The manacles have no effect on a creature that is not immobilized.\n\n<strong>Manacles (Average)</strong> You can manacle someone who is willing or otherwise at your mercy as an exploration activity taking 10-30 seconds depending on the creature's size and how many manacles you apply. A two-legged creature with its legs bound takes a -15-foot circumstance penalty to its Speeds, and a two-handed creature with its wrists bound has to succeed at a DC 5 flat check any time it uses a manipulate action or else that action fails. This DC may be higher depending on how tightly the manacles constrain the hands. A creature bound to a stationary object is immobilized. For creatures with more or fewer limbs, the GM determines what effect manacles have, if any. Freeing a creature from average manacles requires four successful DC 27 Thievery checks.",
        "access": "follower of Zon-Kuthon",
        "sourceBook": "Gods & Magic",
        "level": 3,
        "bulk": "1",
        "price": 4500,
        "traits": [
            "Uncommon",
            "Magical",
            "Necromancy",
            "Nonlethal"
        ],
        "usage": "worn on wrists"
    },
    {
        "name": "Pendant of the Occult",
        "id": "b0f14149-f835-4671-8a4c-a9ff72a7f162",
        "desc": "This amulet is hollow and shaped in the form of an unblinking eye. Its cavity typically holds some fragment of occult text. While wearing the pendant, you gain a +1 item bonus to Occultism checks, and you can cast the guidance cantrip as an occult innate spell.",
        "level": 3,
        "price": 6000,
        "traits": [
            "Divination",
            "Invested",
            "Occult"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Occultism",
                "type": "item",
                "value": 1
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Occult",
                "spells": [
                    {
                        "locked": true,
                        "name": "Guidance"
                    }
                ]
            }
        ]
    },
    {
        "name": "Persona Mask",
        "id": "b351a292-bace-4581-9df7-1d81c2648936",
        "desc": "Despite covering the entire face, this alabaster mask does not hinder vision or other senses. Wearing the mask grants a +1 item bonus to Performance checks while acting, orating, performing comedy, or singing.",
        "level": 3,
        "price": 5000,
        "traits": [
            "Fortune",
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn mask",
        "hints": [
            {
                "desc": "Wearing the mask grants a +1 item bonus to Performance checks while acting, orating, performing comedy, or singing.",
                "showon": "Performance",
                "effects": [
                    {
                        "affected": "Performance",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Persona Mask",
                "source": "b351a292-bace-4581-9df7-1d81c2648936",
                "actions": "1A",
                "activationType": "Envision",
                "toggle": true,
                "desc": "You change the mask's appearance into an artistic rendition of a dramatic character of your choice.",
                "traits": [
                    "Fortune",
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Secret-Keeper's Mask (Blackfingers)",
        "id": "bb4c3c0f-3ab0-4f74-87ad-c5e69bba01c8",
        "desc": "Each of these full-face masks is made of stitched materials - often including humanoid skin - and has a single, bulbous eye. While wearing the mask, you gain a +1 item bonus to Deception checks to Lie and the mask doesn't impair your vision. The mask can also be activated, with an ability based on its type.",
        "sourceBook": "GM's Toolkit: Secret Keeper's Mask",
        "level": 3,
        "price": 6000,
        "subType": "Blackfingers",
        "subTypeDesc": "This featureless mask is made of thin, papery skin. Its single eye is a fragile bubble of venom-filled glass.",
        "traits": [
            "Rare",
            "Divination",
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "You gain a +1 item bonus to Deception checks to Lie, and the mask doesn't impair your vision.",
                "showon": "Deception",
                "effects": [
                    {
                        "affected": "Deception",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Secret-Keeper's Mask (Blackfingers)",
                "source": "bb4c3c0f-3ab0-4f74-87ad-c5e69bba01c8",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You twist the mask's eye and peer at an object. You know whether the object is poison or has been poisoned, but you don't learn the number or type of poisons present in the object.",
                "traits": [
                    "Rare",
                    "Divination",
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Secret-Keeper's Mask (Reaper of Reputation)",
        "id": "f06b352e-3664-4043-92cc-890375a13c37",
        "desc": "Each of these full-face masks is made of stitched materials - often including humanoid skin - and has a single, bulbous eye. While wearing the mask, you gain a +1 item bonus to Deception checks to Lie and the mask doesn't impair your vision. The mask can also be activated, with an ability based on its type.",
        "sourceBook": "GM's Toolkit: Secret Keeper's Mask",
        "level": 3,
        "price": 6000,
        "subType": "Reaper of Reputation",
        "subTypeDesc": "This mask is made of gray and black tiles sewn together. It has a messy, inky spiral over the mouth.",
        "traits": [
            "Rare",
            "Divination",
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "You gain a +1 item bonus to Deception checks to Lie, and the mask doesn't impair your vision.",
                "showon": "Deception",
                "effects": [
                    {
                        "affected": "Deception",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Secret-Keeper's Mask (Reaper of Reputation)",
                "source": "f06b352e-3664-4043-92cc-890375a13c37",
                "actions": "1A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You touch the mask's spiral and identify a target creature within 30 feet. For the next 10 minutes, any normal speech you utter can, at your discretion, be inaudible to all creatures except the target creature, who can hear you clearly regardless of ambient sound so long as it is within 1 mile. This ability doesn't silence magical words, such as the verbal component of spellcasting or commands to activate magic items.",
                "gainConditions": [
                    {
                        "duration": 1000,
                        "name": "Secret-Keeper's Mask (Reaper of Reputation)",
                        "source": "Secret-Keeper's Mask (Reaper of Reputation)"
                    }
                ],
                "traits": [
                    "Rare",
                    "Auditory",
                    "Divination",
                    "Enchantment",
                    "Invested",
                    "Linguistic",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Skinsaw Mask",
        "id": "bda52508-8006-4aec-be93-3e7687edeb65",
        "desc": "A patchwork of humanoid flesh makes up this grotesque mask stitched together with black silk or wire. It is distinctive for its bulbous orange eye - crafted from a magical glass bauble - and wide row of teeth. When worn, the mask amplifies your ability to sense fear in other creatures. You automatically know the value of the frightened condition of any observed creature, and you gain a +1 item bonus to Perception checks to Seek frightened creatures. Whenever you deal precision damage to a frightened creature, you deal 1 additional precision damage. If you are not evil, you are drained 2 while wearing the Skinsaw mask.",
        "sourceBook": "Pathfinder #158: Sixty Feet Under",
        "level": 3,
        "bulk": "L",
        "price": 3000,
        "traits": [
            "Uncommon",
            "Divination",
            "Divine",
            "Evil",
            "Invested",
            "Magical"
        ],
        "usage": "worn mask",
        "hints": [
            {
                "desc": "You automatically know the value of the frightened condition of any observed creature, and you gain a +1 item bonus to Perception checks to Seek frightened creatures.",
                "showon": "Perception",
                "effects": [
                    {
                        "affected": "Perception",
                        "type": "item",
                        "value": "1"
                    }
                ]
            },
            {
                "desc": "Whenever you deal precision damage to a frightened creature, you deal 1 additional precision damage.",
                "showon": "Attacks"
            }
        ],
        "gainConditions": [
            {
                "alignmentFilter": "!Evil",
                "name": "Drained",
                "source": "Skinsaw Mask",
                "value": 2
            }
        ]
    },
    {
        "name": "Tracker's Goggles",
        "id": "90b291d0-437f-4a9a-8a3b-35cda85266c0",
        "desc": "These lenses of forest-green glass are bound in rough leather stitched with crude twine. While wearing these goggles, you gain a +1 bonus to Survival checks to Sense Direction and Track. If you fail a check to Track, you can try again after 30 minutes rather than an hour.",
        "level": 3,
        "price": 6000,
        "traits": [
            "Divination",
            "Invested",
            "Magical"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "You gain a +1 bonus to Survival checks to Sense Direction and Track. If you fail a check to Track, you can try again after 30 minutes rather than an hour.",
                "showon": "Survival",
                "effects": [
                    {
                        "affected": "Survival",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ]
    },
    {
        "name": "Ventriloquist's Ring",
        "id": "91746825-8973-4f42-806f-024b26475878",
        "desc": "This elegant copper ring has miniature images of songbirds engraved around its circumference. You gain a +1 item bonus to Deception checks.",
        "level": 3,
        "price": 6000,
        "traits": [
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Deception",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Ventriloquist's Ring",
                "source": "91746825-8973-4f42-806f-024b26475878",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "Twisting the ring around your finger allows you to magically throw your voice, with the effects of a ventriloquism spell (DC 19).",
                "castSpells": [
                    {
                        "name": "Ventriloquism"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Alchemist Goggles",
        "id": "e889c9cd-f3ab-4ffa-ac2e-783b19474e74",
        "desc": "These brass goggles are engraved with flame patterns and have thick, heavy lenses. While worn, they give you a +1 item bonus to Crafting checks to Craft alchemical items and a +1 item bonus to attack rolls with alchemical bombs. You can also ignore lesser cover when making Strikes with alchemical bombs.",
        "level": 4,
        "price": 10000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "You gain a +1 item bonus to Crafting checks to Craft alchemical items.",
                "showon": "Crafting",
                "effects": [
                    {
                        "affected": "Crafting",
                        "type": "item",
                        "value": "1"
                    }
                ]
            },
            {
                "desc": "You can ignore lesser cover when making Strikes with alchemical bombs.",
                "showon": "Attacks"
            }
        ],
        "effects": [
            {
                "affected": "Alchemical Attack Rolls",
                "type": "item",
                "value": 1
            }
        ]
    },
    {
        "name": "Belt of Good Health",
        "id": "339d9ac6-39b2-47b0-a91f-3660d5bfda63",
        "desc": "When you put on this belt, its silver buckle begins to glow, which slowly spreads into the heart-shaped jewel in the center. You increase your maximum Hit Points and current Hit Points by 4.",
        "sourceBook": "Pathfinder Beginner Box: Game Master's Guide",
        "level": 4,
        "bulk": "L",
        "price": 8500,
        "traits": [
            "Invested",
            "Magical",
            "Necromancy"
        ],
        "usage": "worn belt",
        "effects": [
            {
                "affected": "Max HP",
                "value": 4
            }
        ]
    },
    {
        "name": "Cloak of Repute",
        "id": "d984d72c-e68e-4067-921d-e9f908273e44",
        "desc": "This gaudy and extravagant cloak is adorned with brilliant gems and a fur trim. While wearing the cloak, you gain instant fame and notoriety, granting you a +1 item bonus to Diplomacy checks to Make an Impression. Creatures attempting to learn about you gain the same bonus to Gather Information about you.",
        "level": 4,
        "bulk": "1",
        "price": 9000,
        "traits": [
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "hints": [
            {
                "desc": "You gain a +1 item bonus to Diplomacy checks to Make an Impression. Creatures attempting to learn about you gain the same bonus to Gather Information about you.",
                "showon": "Diplomacy",
                "effects": [
                    {
                        "affected": "Diplomacy",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Cloak of Repute",
                "source": "d984d72c-e68e-4067-921d-e9f908273e44",
                "actions": "2A",
                "activationType": "Command",
                "frequency": "once per day",
                "cooldown": 144000,
                "showonSkill": "Diplomacy",
                "desc": "You wield your great stature to make a Request of a creature. If you roll a success on the check, you get a critical success instead.",
                "traits": [
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Demon Mask",
        "id": "01adbda8-9131-11ea-bb37-0242ac130002",
        "desc": "This terrifying mask is crafted in the visage of a leering demon and grants a +1 item bonus to Intimidation checks.",
        "level": 4,
        "bulk": "L",
        "price": 8500,
        "traits": [
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn mask",
        "effects": [
            {
                "affected": "Intimidation",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Demon Mask",
                "source": "01adbda8-9131-11ea-bb37-0242ac130002",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "The mask casts a fear spell with a DC of 20.",
                "castSpells": [
                    {
                        "name": "Fear"
                    }
                ],
                "traits": [
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Handwraps of Mighty Blows",
        "id": "89c3c5a5-8e09-11ea-9fab-e92c63c14723",
        "desc": "As you invest these embroidered strips of cloth, you must meditate and slowly wrap them around your hands. These handwraps have weapon runes etched into them to give your unarmed attacks the benefits of those runes, making your unarmed attacks work like magic weapons. For example, +1 striking handwraps of mighty blows would give you a +1 item bonus to attack rolls with your unarmed attacks and increase the damage of your unarmed attacks from one weapon die to two (normally 2d4 instead of 1d4, but if your fists have a different weapon damage die or you have other unarmed attacks, use two of that die size instead).\n\nYou can upgrade, add, and transfer runes to and from the handwraps just as you would for a weapon, and you can attach talismans to the handwraps. Treat the handwraps as melee weapons of the brawling group with light Bulk for these purposes. Property runes apply only when they would be applicable to the unarmed attack you're using. For example, a property that must be applied to a slashing weapon wouldn't function when you attacked with a fist, but you would gain its benefits if you attacked with a claw or some other slashing unarmed attack.",
        "level": 4,
        "price": 10000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn gloves",
        "isHandwrapsOfMightyBlows": true,
        "moddable": true,
        "potencyRune": 1,
        "strikingRune": 1
    },
    {
        "name": "Healer's Gloves",
        "id": "69f36f9e-bf6c-4878-9d80-206e960e7d3a",
        "desc": "These clean, white gloves never show signs of blood, even when used to stitch up wounds or treat other ailments. They give you a +1 item bonus to Medicine checks.",
        "level": 4,
        "bulk": "L",
        "price": 8000,
        "traits": [
            "Invested",
            "Magical",
            "Necromancy"
        ],
        "usage": "worn gloves",
        "effects": [
            {
                "affected": "Medicine",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Healer's Gloves",
                "source": "69f36f9e-bf6c-4878-9d80-206e960e7d3a",
                "actions": "1A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "target": "ally",
                "desc": "You can soothe the wounds of a willing, living, adjacent creature, restoring |dice=2d6 + 7| 2d6+7 Hit Points to that creature. This is a positive healing effect. You can't harm undead with this healing.",
                "traits": [
                    "Invested",
                    "Magical",
                    "Necromancy"
                ]
            }
        ]
    },
    {
        "name": "Hunter's Arrowhead",
        "id": "27f7e66c-fd8f-45c7-a61e-d10c5fd7ff67",
        "desc": "This arrowhead-shaped charm is not meant to be affixed to an arrow, but instead to be carried in a pocket or inside of a quiver. A hunter's arrowhead is etched with images sacred to the elven god Ketephys. If you carry one on your person, you are infused with great skill at hunting, and gain a +1 item bonus to Survival skill checks and attack rolls against any creature you've currently designated as your prey for the Hunt Prey ranger ability (note that the bonus to attack rolls is an item bonus, and therefore not cumulative with an item bonus from a magic weapon). A hunter's arrowhead is also a religious symbol of Ketephys.",
        "sourceBook": "Pathfinder #145: Hellknight Hill",
        "level": 4,
        "price": 8000,
        "traits": [
            "Rare",
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "You gain a +1 item bonus to Survival skill checks and attack rolls against any creature you've currently designated as your prey for the Hunt Prey ranger ability (note that the bonus to attack rolls is an item bonus, and therefore not cumulative with an item bonus from a magic weapon).",
                "showon": "Survival, Attacks",
                "effects": [
                    {
                        "affected": "Survival",
                        "type": "item",
                        "value": "1"
                    },
                    {
                        "affected": "Attack Rolls",
                        "type": "item",
                        "value": 1
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Hunter's Arrowhead",
                "source": "27f7e66c-fd8f-45c7-a61e-d10c5fd7ff67",
                "actions": "Reaction",
                "activationType": "Command",
                "frequency": "once per day",
                "cooldown": 144000,
                "trigger": "You would miss with an attack made with a bow.",
                "desc": "You get a +2 circumstance bonus to your attack roll. This can turn a miss into a hit.",
                "traits": [
                    "Rare",
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Hunter's Brooch",
        "id": "a04e08dc-f8eb-424b-a944-df97b52e2808",
        "desc": "While wearing this silver religious symbol of Erastil, you can cast the disrupt undead cantrip as an innate divine spell.",
        "sourceBook": "Pathfinder #164: Hands of the Devil",
        "level": 4,
        "bulk": "L",
        "price": 8000,
        "traits": [
            "Unique",
            "Divine",
            "Invested",
            "Positive",
            "Transmutation"
        ],
        "usage": "worn",
        "activities": [
            {
                "name": "Hunter's Brooch",
                "source": "a04e08dc-f8eb-424b-a944-df97b52e2808",
                "actions": "3A",
                "activationType": "Command, Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "By touching a weapon you wield to the symbol and uttering a plea for Erastil's steadying hand, you grant that weapon the deadly d12 trait. Against undead, the weapon instead gains the fatal d12 trait. This blessing lasts for 1 minute, until you score a critical hit with the weapon, or until you aren't wielding the weapon.",
                "gainConditions": [
                    {
                        "duration": 100,
                        "name": "Hunter's Brooch",
                        "source": "Hunter's Brooch"
                    }
                ],
                "traits": [
                    "Unique",
                    "Divine",
                    "Invested",
                    "Positive",
                    "Transmutation"
                ]
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Divine",
                "spells": [
                    {
                        "locked": true,
                        "name": "Disrupt Undead"
                    }
                ]
            }
        ]
    },
    {
        "name": "Lifting Belt",
        "id": "89c3ecb3-8e09-11ea-9fab-e92c63c14723",
        "desc": "This wide leather belt grants you a +1 item bonus to Athletics checks and increases the amount you can easily carry. You can carry Bulk equal to 6 + your Strength modifier before becoming encumbered, and you can hold and carry a total Bulk up to 11 + your Strength modifier.",
        "level": 4,
        "bulk": "L",
        "price": 8000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn belt",
        "effects": [
            {
                "affected": "Athletics",
                "type": "item",
                "value": 1
            },
            {
                "affected": "Encumbered Limit",
                "type": "item",
                "value": 1
            },
            {
                "affected": "Max Bulk",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Lifting Belt",
                "source": "89c3ecb3-8e09-11ea-9fab-e92c63c14723",
                "actions": "2A",
                "activationType": "Interact",
                "target": "object",
                "desc": "You lift an object of up to 8 Bulk as though it were weightless. This requires two hands, and if the object is locked or otherwise held in place, you can attempt to Force it Open using Athletics as part of this activation. The object still has its full weight and Bulk for all other purposes - you just ignore that weight. The effect lasts until the end of your next turn.",
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Shining Wayfinder",
        "id": "b828f7cd-91b5-438b-81db-39a7380618e4",
        "desc": "A shining wayfinder is a polished silver compass blessed by the power of benevolent deities. It has the usual functions of a wayfinder, except instead of an activation to cast light, the shining wayfinder has the following two activations.",
        "access": "Member of the Pathfinder Society.",
        "sourceBook": "Character Guide",
        "level": 4,
        "price": 10000,
        "traits": [
            "Uncommon",
            "Abjuration",
            "Divination",
            "Evocation",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isWayfinder": 1,
        "activities": [
            {
                "name": "Shining Wayfinder: Guidance",
                "source": "b828f7cd-91b5-438b-81db-39a7380618e4",
                "actions": "2A",
                "activationType": "Command, Interact",
                "target": "self",
                "desc": "You hold the wayfinder and ask for guidance. The wayfinder casts guidance on you.",
                "castSpells": [
                    {
                        "name": "Guidance",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Abjuration",
                    "Divination",
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            },
            {
                "name": "Shining Wayfinder: Bless",
                "source": "b828f7cd-91b5-438b-81db-39a7380618e4",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You call upon the wayfinder's divine blessings for yourself and your allies. The wayfinder casts bless, with an emanation centered on itself. Once per turn, you can use a single action, which has the concentrate trait, to increase the emanation's radius by 5 feet.",
                "castSpells": [
                    {
                        "name": "Bless"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Abjuration",
                    "Divination",
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Sleeves of Storage",
        "id": "2c679278-f02a-480b-a571-0303cea9b798",
        "desc": "This loose robe has wide, voluminous sleeves that each contain an extradimensional space. These spaces each function as a bag of holding that can hold up to 5 Bulk of items (for a total of 10 Bulk), though no individual item can be of more than 1 Bulk; the sleeves grow slightly heavy as you reach maximum capacity. You can add or remove an item from a sleeve with a single hand free as an Interact action.\n\nIf a sleeve is completely empty, you can place your own familiar into that extradimensional space. It can survive comfortably in your sleeve for up to 1 hour, after which it begins to suffocate. While in your sleeve, it can't be affected or targeted by any effects, but you don't benefit from any master abilities. A familiar can exit the sleeve of its own volition with a single action that has the manipulate and move traits. You can't place any other creature into your sleeves, nor can you place your familiar in a sleeve if it's larger than Tiny. If your familiar is in your sleeve, you can't place any items in the sleeve.",
        "sourceBook": "Advanced Player's Guide",
        "level": 4,
        "bulk": "L",
        "price": 10000,
        "traits": [
            "Conjuration",
            "Extradimensional",
            "Invested",
            "Magical"
        ],
        "usage": "worn garment",
        "gainInventory": [
            {
                "bulkLimit": 5,
                "bulkReduction": 5
            },
            {
                "bulkLimit": 5,
                "bulkReduction": 5
            }
        ]
    },
    {
        "name": "Talisman Cord (Lesser)",
        "id": "8aa8a772-e754-4f47-b178-96b916fb2792",
        "desc": "This thin leather cord bears delicate runic markings and threads through an item that can bear affixed talismans. When you Affix a Talisman to that item, you can thread the talisman onto the cord, activating the cord's preserving effects. The cord is attuned to a particular school of magic, chosen when the cord was created. It gains the corresponding trait for that school. When you activate a talisman threaded through a cord with the same magic school trait that's also the cord's level or lower, attempt a |dice=1d20| DC 16 flat check. On a success, that talisman is not consumed and can be used again.",
        "access": "Member of the Pathfinder Society.",
        "sourceBook": "Pathfinder Society Guide",
        "level": 4,
        "price": 8500,
        "traits": [
            "Uncommon",
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isTalismanCord": 1,
        "data": [
            {
                "name": "Attuned magic school",
                "show": false,
                "value": "no school attuned"
            },
            {
                "name": "Second attuned magic school",
                "show": false,
                "value": "no school attuned"
            },
            {
                "name": "Third attuned magic school",
                "show": false,
                "value": "no school attuned"
            }
        ]
    },
    {
        "name": "Wayfinder of Rescue",
        "id": "fb77b315-4561-4fbd-8b2f-b437025fce16",
        "desc": "As a standard wayfinder, but once per day you can activate it to cast heal on a creature other than yourself, using either the one-action or two-action version of heal as a 1st-level spell.",
        "sourceBook": "Pathfinder Society Scenario #1-03: Escaping the Grave",
        "level": 4,
        "price": 8000,
        "traits": [
            "Uncommon",
            "Evocation",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isWayfinder": 1,
        "activities": [
            {
                "name": "Wayfinder of Rescue",
                "source": "fb77b315-4561-4fbd-8b2f-b437025fce16",
                "actions": "1A",
                "activationType": "Command",
                "desc": "The wayfinder is targeted by a 1st-level light spell.",
                "castSpells": [
                    {
                        "level": 1,
                        "name": "Light"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            },
            {
                "name": "Wayfinder of Rescue: Heal",
                "source": "fb77b315-4561-4fbd-8b2f-b437025fce16",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "Once per day, you can activate the wayfinder of rescue to cast heal on a creature other than yourself, using either the one-action or two-action version of heal as a 1st-level spell.",
                "castSpells": [
                    {
                        "name": "Heal",
                        "target": "ally"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Aeon Stone (Agate Ellipsoid)",
        "id": "06e89689-ef79-4e69-a7ab-a90361066254",
        "desc": "This aeon stone allows you to cast 2nd-level augury as a divine innate spell once per day.\n\nThe resonant power causes the augury spell from the aeon stone to always succeed at the DC 6 flat check to give an answer other than \"nothing.\"",
        "access": "Member of the Pathfinder Society.",
        "level": 5,
        "price": 13000,
        "traits": [
            "Uncommon",
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "The resonant power causes the augury spell from the aeon stone to always succeed at the DC 6 flat check to give an answer other than \"nothing.\"",
                "showon": "Augury",
                "resonant": true
            }
        ],
        "gainSpells": [
            {
                "cooldown": 144000,
                "frequency": "once per day",
                "level": 2,
                "tradition": "Divine",
                "spells": [
                    {
                        "locked": true,
                        "name": "Augury"
                    }
                ]
            }
        ]
    },
    {
        "name": "Boots of Elvenkind",
        "id": "65665afb-bfd6-465a-b897-f57e83624036",
        "desc": "These tall, pointed boots are made from soft, supple black or green leather and are decorated with trim and buckles of gold. When worn, the boots allow you to move more nimbly, granting you a +1 item bonus to Acrobatics checks.",
        "level": 5,
        "bulk": "L",
        "price": 14500,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn shoes",
        "effects": [
            {
                "affected": "Acrobatics",
                "type": "item",
                "value": 1
            },
            {
                "affected": "Cloak of Elvenkind Charges",
                "setValue": 2
            },
            {
                "affected": "Cloak of Elvenkind (Greater) Charges",
                "setValue": 2
            }
        ],
        "activities": [
            {
                "name": "Boots of Elvenkind",
                "source": "65665afb-bfd6-465a-b897-f57e83624036",
                "actions": "Free",
                "activationType": "Envision",
                "frequency": "once per hour",
                "cooldown": 6000,
                "desc": "Until the end of your turn, you ignore difficult terrain when moving on the ground. If you're wearing a cloak of elvenkind, you also gain a +5-foot status bonus to your land Speed until the end of your turn.",
                "gainConditions": [
                    {
                        "duration": 5,
                        "name": "Boots of Elvenkind",
                        "source": "Boots of Elvenkind"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Diplomat's Badge",
        "id": "7c575172-b080-442b-813d-6743400e52ec",
        "desc": "When displayed prominently, this brass badge makes creatures find you more agreeable. You gain a +1 item bonus to Diplomacy checks.",
        "level": 5,
        "price": 12500,
        "traits": [
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Diplomacy",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Diplomat's Badge",
                "source": "7c575172-b080-442b-813d-6743400e52ec",
                "actions": "1A",
                "activationType": "Recall Knowledge",
                "frequency": "once per day.",
                "cooldown": 144000,
                "desc": "Attempt a DC 20 check to Recall Knowledge about people of a human ethnicity, a non-human ancestry, or some other type of creature. (The GM determines what your options are.) If you succeed, the badge's bonus increases to +2 for Diplomacy checks with creatures of that group for the rest of the day.",
                "gainConditions": [
                    {
                        "duration": -5,
                        "name": "Diplomat's Badge",
                        "source": "Diplomat's Badge"
                    }
                ]
            }
        ]
    },
    {
        "name": "Goggles of Night",
        "id": "6dfd996e-a954-49ca-bd65-57f823f53d89",
        "desc": "The opaque crystal lenses of these sleek goggles do not obscure vision, but rather enhance it. While wearing the goggles, you gain a +1 item bonus to Perception checks involving sight.",
        "level": 5,
        "price": 15000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "While wearing the goggles, you gain a +1 item bonus to Perception checks involving sight.",
                "showon": "Perception",
                "effects": [
                    {
                        "affected": "Perception",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Goggles of Night",
                "source": "6dfd996e-a954-49ca-bd65-57f823f53d89",
                "actions": "1A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "Rotating the lenses 90 degrees, you gain darkvision for 1 hour.",
                "gainConditions": [
                    {
                        "duration": 6000,
                        "hideChoices": [
                            true
                        ],
                        "name": "Goggles of Night",
                        "source": "Goggles of Night"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Necklace of Fireballs I",
        "id": "5ab265b1-5321-4bb1-9102-53aa03b012f8",
        "desc": "This string of beads appears to be a hemp string with lustrous red beads of various sizes hanging from it. When activated, it briefly appears in its true form: a golden chain with golden spheres attached by fine threads.\n\nNumerous varieties of the necklace of fireballs exist. Each has a different basic Reflex save DC and includes a combination of spheres dealing different amounts of damage, as listed for each type below. When all the beads are gone, the necklace becomes a non-magical hemp string.",
        "level": 5,
        "price": 4400,
        "subType": "I",
        "subTypeDesc": "One 6d6, two 4d6 (DC 21)",
        "traits": [
            "Evocation",
            "Invested",
            "Magical"
        ],
        "activities": [
            {
                "name": "Necklace of Fireballs I: 6d6, DC 21",
                "source": "5ab265b1-5321-4bb1-9102-53aa03b012f8",
                "actions": "1A",
                "activationType": "Interact",
                "charges": 1,
                "desc": "You detach a sphere from the necklace, causing it to glow with orange light. After you activate a sphere, if you or anyone else hurls it (an Interact action), it detonates as a fireball where it lands. Your toss can place the center of the fireball anywhere within 70 feet, though at the GM's discretion you might need to make an attack roll if the throw is unusually challenging. If no one hurls the sphere by the start of your next turn, it turns into a non-magical red bead.",
                "showSpells": [
                    "Fireball"
                ],
                "traits": [
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            },
            {
                "name": "Necklace of Fireballs I: 4d6, DC 21",
                "source": "5ab265b1-5321-4bb1-9102-53aa03b012f8",
                "actions": "1A",
                "activationType": "Interact",
                "charges": 2,
                "desc": "You detach a sphere from the necklace, causing it to glow with orange light. After you activate a sphere, if you or anyone else hurls it (an Interact action), it detonates as a fireball where it lands. Your toss can place the center of the fireball anywhere within 70 feet, though at the GM's discretion you might need to make an attack roll if the throw is unusually challenging. If no one hurls the sphere by the start of your next turn, it turns into a non-magical red bead.",
                "showSpells": [
                    "Fireball"
                ],
                "traits": [
                    "Evocation",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Clandestine Cloak",
        "id": "b403bd95-ae81-40b3-a246-aa178f4d4aea",
        "desc": "When you pull up the hood of this nondescript gray cloak (an Interact action), you become drab and uninteresting, gaining a +1 item bonus to Stealth checks and to Deception checks to Impersonate a forgettable background character, such as a servant, but also taking a -1 item penalty to Diplomacy and Intimidation checks.",
        "level": 6,
        "bulk": "L",
        "price": 23000,
        "traits": [
            "Uncommon",
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "activities": [
            {
                "name": "Clandestine Cloak",
                "source": "b403bd95-ae81-40b3-a246-aa178f4d4aea",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "target": "self",
                "desc": "You pull the cloak's hood up and gain the benefits of nondetection for 1 hour or until you pull the hood back down, whichever comes first.",
                "castSpells": [
                    {
                        "name": "Nondetection",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Illusion",
                    "Invested",
                    "Magical"
                ],
                "maxDuration": 6000
            },
            {
                "name": "Clandestine Cloak: Pull Up Hood",
                "source": "b403bd95-ae81-40b3-a246-aa178f4d4aea",
                "actions": "1A",
                "activationType": "Interact",
                "toggle": true,
                "desc": "When you pull up the hood of this nondescript gray cloak (an Interact action), you become drab and uninteresting, gaining a +1 item bonus to Stealth checks and to Deception checks to Impersonate a forgettable background character, such as a servant, but also taking a -1 item penalty to Diplomacy and Intimidation checks.",
                "gainConditions": [
                    {
                        "name": "Clandestine Cloak"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Acid)",
        "id": "183b8611-da90-4a2d-a2ed-19a434a1f8ba",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 6,
        "price": 24500,
        "subType": "Acid",
        "subTypeDesc": "The ring grant resistance 5 against acid damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Acid Resistance",
                "value": 5
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Cold)",
        "id": "12f84e34-2192-479e-8077-507b04fd8d89",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 6,
        "price": 24500,
        "subType": "Cold",
        "subTypeDesc": "The ring grant resistance 5 against cold damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Cold Resistance",
                "value": 5
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Electricity)",
        "id": "0b079ba2-b01a-436c-ac64-a2b52865812f",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 6,
        "price": 24500,
        "subType": "Electricity",
        "subTypeDesc": "The ring grant resistance 5 against electricity damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Electricity Resistance",
                "value": 5
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Fire)",
        "id": "524f8fcf-8e33-42df-9444-4299d5e9f06f",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 6,
        "price": 24500,
        "subType": "Fire",
        "subTypeDesc": "The ring grant resistance 5 against fire damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Fire Resistance",
                "value": 5
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Sonic)",
        "id": "95600cdc-03ca-4c3d-87e4-b823e7714cb9",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 6,
        "price": 24500,
        "subType": "Sonic",
        "subTypeDesc": "The ring grant resistance 5 against sonic damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Sonic Resistance",
                "value": 5
            }
        ]
    },
    {
        "name": "Ring of the Ram",
        "id": "08cedfef-2357-41fc-921b-23f1bdbc1208",
        "desc": "This heavy iron ring is shaped to look like the head of a ram, with curling horns.",
        "level": 6,
        "price": 22000,
        "traits": [
            "Evocation",
            "Force",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "activities": [
            {
                "name": "Ring of the Ram",
                "source": "08cedfef-2357-41fc-921b-23f1bdbc1208",
                "actions": "1A or more",
                "activationType": "Interact",
                "frequency": "once per minute",
                "cooldown": 100,
                "target": "other",
                "desc": "A ram-shaped blast of force slams into one foe that you can see within 60 feet. The number of actions you spend to Activate this Item (from 1 to 3) determines the intensity of the force. The blow deals |dice=2d6 Force| 2d6 force damage per action spent and pushes the target 5 feet per action spent. The target must attempt a DC 22 Fortitude save.",
                "traits": [
                    "Evocation",
                    "Force",
                    "Invested",
                    "Magical"
                ],
                "critsuccess": "The target is unaffected.",
                "success": "The target takes half damage and is pushed half the distance.",
                "failure": "The target takes full damage and is pushed the full distance.",
                "critfailure": "The target takes double damage and is pushed twice the distance."
            }
        ]
    },
    {
        "name": "Aeon Stone (Clear Spindle)",
        "id": "046845de-4cb0-411a-9f6e-85a669e5e12b",
        "desc": "You don't need to eat or drink while this aeon stone is invested by you. This aeon stone doesn't function until it has been worn continuously for a week and invested each day therein. If it's invested by someone else, this interval starts over.\n\nThe resonant power allows you to cast air bubble as a primal innate spell once per day.",
        "level": 7,
        "price": 32500,
        "traits": [
            "Uncommon",
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn",
        "isAeonStone": true,
        "hints": [
            {
                "desc": "You don't need to eat or drink while the clear spindle aeon stone is invested by you. This aeon stone doesn't function until it has been worn continuously for a week and invested each day therein. If it's invested by someone else, this interval starts over.",
                "showon": "Health"
            }
        ],
        "gainSpells": [
            {
                "cooldown": 144000,
                "frequency": "once per day",
                "level": 1,
                "resonant": true,
                "tradition": "Primal",
                "spells": [
                    {
                        "locked": true,
                        "name": "Air Bubble"
                    }
                ]
            }
        ]
    },
    {
        "name": "Cloak of Elvenkind",
        "id": "b0a0fc41-b6cc-4dba-870c-efdd0468e448",
        "desc": "This cloak is deep green with a voluminous hood, embroidered with gold trim and symbols significant in elven culture. The cloak allows you to cast the ghost sound cantrip as an arcane innate spell. When you adjust the cloak's clasp (an Interact action), the cloak transforms to match the environment around you and muffles your sounds, granting you a +1 item bonus to Stealth checks.",
        "level": 7,
        "bulk": "L",
        "price": 36000,
        "traits": [
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "effects": [
            {
                "affected": "Stealth",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Cloak of Elvenkind",
                "source": "b0a0fc41-b6cc-4dba-870c-efdd0468e448",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "target": "self",
                "desc": "You draw the hood up and gain the effects of invisibility, with the spell's normal duration or until you pull the hood back down, whichever comes first. If you're also wearing boots of elvenkind, you can activate this ability twice per day.",
                "castSpells": [
                    {
                        "name": "Invisibility",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical"
                ],
                "maxDuration": 1000
            },
            {
                "name": "Cloak of Elvenkind: Adjust Clasp",
                "source": "b0a0fc41-b6cc-4dba-870c-efdd0468e448",
                "actions": "1A",
                "activationType": "Interact",
                "toggle": true,
                "desc": "When you adjust the cloak's clasp, the cloak transforms to match the environment around you and muffles your sounds, granting you a +1 item bonus to Stealth checks.",
                "gainConditions": [
                    {
                        "duration": -1,
                        "name": "Cloak of Elvenkind"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Arcane",
                "spells": [
                    {
                        "locked": true,
                        "name": "Ghost Sound"
                    }
                ]
            }
        ]
    },
    {
        "name": "Gloves of Storing",
        "id": "07119308-8e70-429c-bcce-60adae2d0f81",
        "desc": "An item can be stored inside these supple leather gloves, held in an extradimensional space. When an item is inside the glove, an image of the item appears as a simple, stitched pattern on the back of each glove. Many gloves of storing are found with an item already inside.",
        "level": 7,
        "price": 34000,
        "traits": [
            "Uncommon",
            "Extradimensional",
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn gloves",
        "activities": [
            {
                "name": "Gloves of Storing: Store",
                "source": "07119308-8e70-429c-bcce-60adae2d0f81",
                "actions": "1A",
                "activationType": "Interact",
                "target": "object",
                "requirements": "No item is stored in the gloves",
                "desc": "One item you're holding with a Bulk of 1 or less vanishes into the gloves' extradimensional space.",
                "traits": [
                    "Uncommon",
                    "Extradimensional",
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "inputRequired": "Manually move an item to the gloves' container."
            },
            {
                "name": "Gloves of Storing: Retrieve",
                "source": "07119308-8e70-429c-bcce-60adae2d0f81",
                "actions": "Free",
                "activationType": "Interact",
                "cooldown": 100,
                "target": "object",
                "requirements": "An item is stored in the gloves, and you have a free hand",
                "desc": "The item stored in the gloves appears in your hand. The gloves can't be activated again for 1 minute.",
                "traits": [
                    "Uncommon",
                    "Extradimensional",
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "inputRequired": "Manually move an item from the gloves' container to your main inventory and equip it as needed."
            }
        ],
        "gainInventory": [
            {
                "bulkLimit": 1,
                "bulkReduction": 1
            }
        ]
    },
    {
        "name": "Horseshoes of Speed",
        "id": "a55f6c9e-9a05-11ea-bb37-0242ac130002",
        "desc": "When you affix these simple iron horseshoes to the hooves of an ordinary horse or a quadrupedal animal companion and the animal companion invests them, that creature gains a +5-foot item bonus to its land Speed and a +2 item bonus to Athletics checks to High Jump and Long Jump. In addition, when it Leaps, it can move 5 feet farther if jumping horizontally or 3 feet higher if jumping vertically.",
        "level": 7,
        "bulk": "1",
        "price": 34000,
        "traits": [
            "Companion",
            "Invested",
            "Primal",
            "Transmutation"
        ],
        "usage": "worn horseshoes",
        "hints": [
            {
                "desc": "Your animal companion gains a +2 item bonus to Athletics checks to High Jump and Long Jump. When it Leaps, it can move 5 feet farther if jumping horizontally or 3 feet higher if jumping vertically.",
                "showon": "Athletics",
                "effects": [
                    {
                        "affected": "Athletics",
                        "type": "item",
                        "value": "2"
                    }
                ]
            }
        ],
        "effects": [
            {
                "affected": "Land Speed",
                "type": "item",
                "value": 5
            }
        ]
    },
    {
        "name": "Ring of Sustenance",
        "id": "89c3ecbc-8e09-11ea-9fab-e92c63c14723",
        "desc": "This polished wooden ring constantly refreshes your body and mind. You don't need to eat or drink while wearing it, and you need only 2 hours of sleep per day to gain the benefits of 8 hours of sleep. A ring of sustenance doesn't function until it's been worn and invested continuously for a week. Removing it resets this interval.",
        "level": 7,
        "price": 32500,
        "traits": [
            "Uncommon",
            "Conjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "You don't need to eat or drink while wearing the Ring of Sustenance, and you need only 2 hours of sleep per day to gain the benefits of 8 hours of sleep. A ring of sustenance doesn't function until it's been worn and invested continuously for a week. Removing it resets this interval.",
                "showon": "Health"
            }
        ]
    },
    {
        "name": "Slippers of Spider Climbing",
        "id": "89c3ecbf-8e09-11ea-9fab-e92c63c14723",
        "desc": "These soft slippers are made of fine gray silk. If the slippers are left unattended for a while, they tend to attract spiders that nest inside.",
        "level": 7,
        "bulk": "L",
        "price": 32500,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn shoes",
        "activities": [
            {
                "name": "Slippers of Spider Climbing",
                "source": "89c3ecbf-8e09-11ea-9fab-e92c63c14723",
                "actions": "1A",
                "activationType": "Command",
                "frequency": "once per hour",
                "cooldown": 6000,
                "desc": "Tiny, hairlike tendrils extend from the slippers' soles, allowing you to walk on vertical surfaces or even to move upside down along ceilings. For 1 minute, you gain a 20-foot climb Speed and you don't need to use your hands to Climb. However, the slippers require decent traction for you to walk on a wall, so they provide no benefit when you're moving across greased, icy, or oiled surfaces.",
                "gainConditions": [
                    {
                        "duration": 100,
                        "name": "Slippers of Spider Climbing",
                        "source": "Slippers of Spider Climbing"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Collar of Inconspicuousness",
        "id": "a55f7068-9a05-11ea-bb37-0242ac130002",
        "desc": "This leather collar's worn and almost threadbare look belies its magical nature. When your companion wears and invests the collar, it gains the ability to change its appearance from that of a ferocious animal into a more inconspicuous form.",
        "level": 8,
        "bulk": "1",
        "price": 47500,
        "traits": [
            "Companion",
            "Invested",
            "Primal",
            "Transmutation"
        ],
        "usage": "worn collar",
        "activities": [
            {
                "name": "Pest Form",
                "source": "a55f7068-9a05-11ea-bb37-0242ac130002",
                "actions": "1A",
                "activationType": "Envision",
                "toggle": true,
                "desc": "You touch your animal companion to transform it into a nonthreatening Tiny creature of the same family or a similar creature (for instance, a house cat instead of a tiger, or a puppy instead of a wolf). This has the effects of 2nd level pest form. The effect lasts until you Dismiss it.",
                "castSpells": [
                    {
                        "duration": -1,
                        "hideChoices": [
                            "Pest Form"
                        ],
                        "level": 2,
                        "name": "Pest Form",
                        "overrideChoices": [
                            {
                                "choice": "Non-Flying",
                                "condition": "Pest Form"
                            }
                        ]
                    }
                ],
                "traits": [
                    "Companion",
                    "Invested",
                    "Primal",
                    "Transmutation"
                ],
                "exclusiveActivityID": 1,
                "inputRequired": "Use this activation if the companion can't fly."
            },
            {
                "name": "Pest Form (Flying)",
                "source": "a55f7068-9a05-11ea-bb37-0242ac130002",
                "actions": "1A",
                "activationType": "Envision",
                "toggle": true,
                "desc": "You touch your animal companion to transform it into a nonthreatening Tiny flying creature of the same family or a similar creature. This has the effects of 4th level pest form. The effect lasts until you Dismiss it.",
                "castSpells": [
                    {
                        "duration": -1,
                        "hideChoices": [
                            "Pest Form"
                        ],
                        "level": 4,
                        "name": "Pest Form",
                        "overrideChoices": [
                            {
                                "choice": "Flying",
                                "condition": "Pest Form"
                            }
                        ]
                    }
                ],
                "traits": [
                    "Companion",
                    "Invested",
                    "Primal",
                    "Transmutation"
                ],
                "exclusiveActivityID": 1,
                "inputRequired": "Use this activation if the companion can fly."
            }
        ]
    },
    {
        "name": "Armbands of Athleticism",
        "id": "83ad0d05-f2bb-4f60-bc27-a87e6565631b",
        "desc": "Skilled awl work has imprinted images of a muscled weightlifter into these tiered leather bands, which grant you enhanced stamina and skill when performing athletic exercises. While fastened to your upper arms, the armbands give you a +2 item bonus to Athletics checks. In addition, whenever you use an action to Climb or Swim and you succeed at the Athletics check, add a +5-foot item bonus to the distance you move.",
        "level": 9,
        "bulk": "L",
        "price": 64500,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn armbands",
        "hints": [
            {
                "desc": "Whenever you use an action to Climb or Swim and you succeed at the Athletics check, add a +5-foot item bonus to the distance you move.",
                "showon": "Athletics"
            }
        ],
        "effects": [
            {
                "affected": "Athletics",
                "type": "item",
                "value": 2
            }
        ]
    },
    {
        "name": "Bracers of Missile Deflection (Greater)",
        "id": "b34042cb-3303-4a1a-8aca-94b92fc48583",
        "desc": "These bracers are made from plates of durable mithral and gleam like the summer sun.",
        "level": 9,
        "bulk": "L",
        "price": 650000,
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn bracers",
        "activities": [
            {
                "name": "Bracers of Missile Deflection (Greater)",
                "source": "b34042cb-3303-4a1a-8aca-94b92fc48583",
                "actions": "Reaction",
                "activationType": "Interact",
                "frequency": "once every 10 minutes",
                "cooldown": 1000,
                "trigger": "A ranged weapon attack hits you but doesn't critically hit",
                "requirements": "You are aware of the attack and not flat-footed",
                "desc": "The bracers send the missile off-course. You gain a +2 circumstance bonus to AC against the triggering attack. If this would cause the attack to be a failure, the attack misses you.",
                "traits": [
                    "Abjuration",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Collar of Empathy",
        "id": "a55f7176-9a05-11ea-bb37-0242ac130002",
        "desc": "This ornate collar of intertwined leather strips of contrasting colors is paired with a bracelet of a similar construction. When you wear and invest the bracelet and your companion wears and invests the collar, you gain a stronger connection to each other. You and your companion can always sense each others' emotional states and basic physical wants and needs.",
        "level": 9,
        "bulk": "1",
        "price": 60000,
        "traits": [
            "Companion",
            "Divination",
            "Invested",
            "Primal"
        ],
        "usage": "worn collar",
        "gainItems": [
            {
                "name": "Bracelet of Empathy",
                "type": "wornitems"
            }
        ]
    },
    {
        "name": "Bracelet of Empathy",
        "id": "def56a5a-92b9-4edb-94a1-1379f2acd1c1",
        "desc": "This ornate bracelet of intertwined leather strips of contrasting colors comes with the Collar of Empathy. When you wear and invest the bracelet and your companion wears and invests the collar, you gain a stronger connection to each other. You and your companion can always sense each others' emotional states and basic physical wants and needs.",
        "level": 9,
        "hide": true,
        "traits": [
            "Divination",
            "Invested",
            "Primal"
        ],
        "usage": "worn bracelet",
        "activities": [
            {
                "name": "Bracelet of Empathy",
                "source": "def56a5a-92b9-4edb-94a1-1379f2acd1c1",
                "actions": "2A",
                "activationType": "Interact",
                "toggle": true,
                "desc": "You perceive through your animal companion's senses instead of your own. You can Sustain the Activation. You are unaware of your own surroundings for as long as you are using your animal companion's senses. In addition to the obvious use when you are separated from your companion, this ability might allow you to notice sounds, scents, and other stimuli that your companion's senses register but yours alone don't.",
                "gainConditions": [
                    {
                        "duration": -1,
                        "name": "Collar of Empathy",
                        "source": "Bracelet of Empathy"
                    }
                ],
                "traits": [
                    "Divination",
                    "Invested",
                    "Primal"
                ]
            }
        ]
    },
    {
        "name": "Coyote Cloak (Greater)",
        "id": "da870b3d-9d59-4476-85c8-fa0ea2d8b9e2",
        "desc": "This dusty coat is made of mangy brown-and-gray coyote fur. You gain a +1 item bonus to Survival checks. If you critically succeed at your Survival check to Subsist, you can feed twice as many additional creatures.",
        "level": 9,
        "price": 65000,
        "subType": "Greater",
        "subTypeDesc": "The cloak grants a +2 item bonus, and if you critically succeed at a Survival check to Subsist, you can feed four times as many additional creatures.",
        "traits": [
            "Divination",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "hints": [
            {
                "desc": "If you critically succeed at your Survival check to Subsist, you can feed four times as many additional creatures.",
                "showon": "Survival"
            }
        ],
        "effects": [
            {
                "affected": "Survival",
                "type": "item",
                "value": 2
            }
        ]
    },
    {
        "name": "Healer's Gloves (Greater)",
        "id": "b3447aa0-062d-4660-bc13-4996eff4b0e7",
        "desc": "These clean, white gloves never show signs of blood, even when used to stitch up wounds or treat other ailments. They give you a +1 item bonus to Medicine checks.",
        "level": 9,
        "bulk": "L",
        "price": 70000,
        "subType": "Greater",
        "subTypeDesc": "The gloves provide a +2 bonus and restore 4d6+15 Hit Points.",
        "traits": [
            "Invested",
            "Magical",
            "Necromancy"
        ],
        "usage": "worn gloves",
        "effects": [
            {
                "affected": "Medicine",
                "type": "item",
                "value": 2
            }
        ],
        "activities": [
            {
                "name": "Healer's Gloves (Greater)",
                "source": "b3447aa0-062d-4660-bc13-4996eff4b0e7",
                "actions": "1A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "target": "ally",
                "desc": "You can soothe the wounds of a willing, living, adjacent creature, restoring |dice=4d6 + 15| 4d6+15 Hit Points to that creature. This is a positive healing effect. You can't harm undead with this healing.",
                "traits": [
                    "Invested",
                    "Magical",
                    "Necromancy"
                ]
            }
        ]
    },
    {
        "name": "Messenger's Ring",
        "id": "462510ac-d2fc-4f29-aa7c-dcc7272ebfcf",
        "desc": "This silver signet ring changes to match the insignia of a lord or organization you serve (or your own face, if you serve no one else). It grants you a +2 item bonus to Diplomacy checks and lets you cast message as an arcane innate spell at will.",
        "level": 9,
        "price": 70000,
        "traits": [
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Diplomacy",
                "type": "item",
                "value": 2
            }
        ],
        "activities": [
            {
                "name": "Messenger's Ring",
                "source": "462510ac-d2fc-4f29-aa7c-dcc7272ebfcf",
                "actions": "1 minute",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "The ring casts animal messenger to your specification. The animal is a magical creature that springs from the ring, and its appearance suits the iconography or heraldry of the lord or organization represented by the ring.",
                "castSpells": [
                    {
                        "name": "Animal Messenger"
                    }
                ],
                "traits": [
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Arcane",
                "spells": [
                    {
                        "locked": true,
                        "name": "Message"
                    }
                ]
            }
        ]
    },
    {
        "name": "Barding of the Zephyr",
        "id": "89c3c5a8-8e09-11ea-9fab-e92c63c14723",
        "desc": "This light barding is covered in stylized wind motifs. When you suit up your animal companion, the barding adjusts to fit your animal companion regardless of its shape.\n\nWhen your companion falls, wind picks it up from below; it gains the effects of feather fall.",
        "level": 10,
        "bulk": "L",
        "price": 90000,
        "traits": [
            "Companion",
            "Invested",
            "Primal",
            "Transmutation"
        ],
        "usage": "worn barding",
        "activities": [
            {
                "name": "Barding of the Zephyr",
                "source": "89c3c5a8-8e09-11ea-9fab-e92c63c14723",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You trace a finger along the wind motifs on the barding, granting your companion wearing the barding a fly Speed of 30 feet for 10 minutes. Even if the companion doesn't have the mount special ability, it can still Fly while being ridden.",
                "gainConditions": [
                    {
                        "duration": 1000,
                        "name": "Barding of the Zephyr",
                        "source": "Barding of the Zephyr"
                    }
                ],
                "traits": [
                    "Companion",
                    "Invested",
                    "Primal",
                    "Transmutation"
                ]
            },
            {
                "name": "Barding of the Zephyr: Feather Fall",
                "source": "89c3c5a8-8e09-11ea-9fab-e92c63c14723",
                "actions": "Free",
                "activationType": "Automatic",
                "desc": "When your companion falls, wind picks it up from below; it gains the effects of feather fall.",
                "castSpells": [
                    {
                        "name": "Feather Fall"
                    }
                ],
                "traits": [
                    "Companion",
                    "Invested",
                    "Primal",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Cape of the Mountebank",
        "id": "ac9ec2cf-e9aa-413e-905e-4ef2dfb78c33",
        "desc": "This bright red-and-gold cape is often interlaced with glittery threads and serves as a distraction. While wearing the cape, you gain a +2 item bonus to Deception checks.",
        "level": 10,
        "bulk": "L",
        "price": 98000,
        "traits": [
            "Uncommon",
            "Conjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "activities": [
            {
                "name": "Cape of the Mountebank",
                "source": "ac9ec2cf-e9aa-413e-905e-4ef2dfb78c33",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "target": "self",
                "desc": "You cast dimension door. The space you leave and the one you appear in are filled with puffs of smoke that make anyone within concealed until they leave the smoke or the end of your next turn, at which point the smoke dissipates. Strong winds immediately disperse the smoke.",
                "castSpells": [
                    {
                        "name": "Dimension Door"
                    }
                ],
                "gainConditions": [
                    {
                        "name": "Cape of the Mountebank"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Conjuration",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Clandestine Cloak (Greater)",
        "id": "9acbe7d9-081e-4058-9329-4b5dfe8e448c",
        "desc": "When you pull up the hood of this nondescript gray cloak (an Interact action), you become drab and uninteresting, gaining a +1 item bonus to Stealth checks and to Deception checks to Impersonate a forgettable background character, such as a servant, but also taking a -1 item penalty to Diplomacy and Intimidation checks.",
        "level": 10,
        "bulk": "L",
        "price": 90000,
        "subType": "Greater",
        "subTypeDesc": "The item bonus is +2, and when you activate the cloak, you gain the benefits of 5th-level nondetection for 8 hours.",
        "traits": [
            "Uncommon",
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "activities": [
            {
                "name": "Clandestine Cloak (Greater)",
                "source": "9acbe7d9-081e-4058-9329-4b5dfe8e448c",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "target": "self",
                "desc": "You pull the cloak's hood up and gain the benefits of 5th-level nondetection for 8 hours or until you pull the hood back down, whichever comes first.",
                "castSpells": [
                    {
                        "duration": 48000,
                        "level": 5,
                        "name": "Nondetection",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Illusion",
                    "Invested",
                    "Magical"
                ],
                "maxDuration": 48000
            },
            {
                "name": "Clandestine Cloak (Greater): Pull Up Hood",
                "source": "9acbe7d9-081e-4058-9329-4b5dfe8e448c",
                "actions": "1A",
                "activationType": "Interact",
                "toggle": true,
                "desc": "When you pull up the hood of this nondescript gray cloak (an Interact action), you become drab and uninteresting, gaining a +2 item bonus to Stealth checks and to Deception checks to Impersonate a forgettable background character, such as a servant, but also taking a -1 item penalty to Diplomacy and Intimidation checks.",
                "gainConditions": [
                    {
                        "name": "Clandestine Cloak (Greater)"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Cloak of the Bat",
        "id": "95366e4c-5b77-47c2-9deb-411dc18534d4",
        "desc": "Sewn from several long strips of luxurious brown and black silk, this cloak grants you a +2 item bonus to Stealth checks as well as to Acrobatics checks to Maneuver in Flight. You can also use your feet to hang from any surface that can support your weight, without requiring any check, though you still must attempt Athletics checks to Climb in order to move around while inverted.",
        "level": 10,
        "bulk": "L",
        "price": 95000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn cloak",
        "hints": [
            {
                "desc": "The cloak grants you a +2 item bonus to Acrobatics checks to Maneuver in Flight. You can also use your feet to hang from any surface that can support your weight, without requiring any check, though you still must attempt Athletics checks to Climb in order to move around while inverted.",
                "showon": "Acrobatics, Movement",
                "effects": [
                    {
                        "affected": "Acrobatics",
                        "type": "item",
                        "value": "2"
                    }
                ]
            }
        ],
        "effects": [
            {
                "affected": "Stealth",
                "type": "item",
                "value": 2
            }
        ],
        "activities": [
            {
                "name": "Cloak of the Bat: Bat Wings",
                "source": "95366e4c-5b77-47c2-9deb-411dc18534d4",
                "actions": "2A",
                "activationType": "Command, Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You can either transform the cloak into bat-like wings that grant you a fly Speed of 30 feet for 10 minutes, or have the cloak turn you into a bat by casting a 4th-level pest form spell on you.",
                "gainConditions": [
                    {
                        "duration": 1000,
                        "name": "Cloak of the Bat",
                        "source": "Cloak of the Bat"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "sharedChargesID": 1
            },
            {
                "name": "Cloak of the Bat: Bat Form",
                "source": "95366e4c-5b77-47c2-9deb-411dc18534d4",
                "actions": "2A",
                "activationType": "Command, Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "target": "self",
                "desc": "You can either transform the cloak into bat-like wings that grant you a fly Speed of 30 feet for 10 minutes, or have the cloak turn you into a bat by casting a 4th-level pest form spell on you.",
                "castSpells": [
                    {
                        "level": 4,
                        "name": "Pest Form",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "sharedChargesID": 1
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Acid, Greater)",
        "id": "806cb90e-d915-47ff-b049-d1a9cd625107",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 10,
        "price": 97500,
        "subType": "Acid, Greater",
        "subTypeDesc": "The ring grant resistance 10 against acid damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Acid Resistance",
                "value": 10
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Cold, Greater)",
        "id": "0dbb3f58-41be-4b0c-9da6-ac853877fe57",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 10,
        "price": 97500,
        "subType": "Cold, Greater",
        "subTypeDesc": "The ring grant resistance 10 against cold damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Cold Resistance",
                "value": 10
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Electricity, Greater)",
        "id": "5722eead-6f13-434f-a792-8e6384e5265d",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 10,
        "price": 97500,
        "subType": "Electricity, Greater",
        "subTypeDesc": "The ring grant resistance 10 against electricity damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Electricity Resistance",
                "value": 10
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Fire, Greater)",
        "id": "87c0a3b2-0a28-4f6e-822b-3a70c393c962",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 10,
        "price": 97500,
        "subType": "Fire, Greater",
        "subTypeDesc": "The ring grant resistance 10 against fire damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Fire Resistance",
                "value": 10
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Sonic, Greater)",
        "id": "970d5882-2c86-40fb-9d55-3d98bd829020",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 10,
        "price": 97500,
        "subType": "Sonic, Greater",
        "subTypeDesc": "The ring grant resistance 10 against sonic damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Sonic Resistance",
                "value": 10
            }
        ]
    },
    {
        "name": "Ring of Lies",
        "id": "0de44cf9-5fa2-4baa-8275-c1fa71868761",
        "desc": "This plain silver ring has an almost oily sheen. While wearing the ring, you gain a +2 item bonus to Deception checks.",
        "level": 10,
        "price": 85000,
        "traits": [
            "Uncommon",
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Deception",
                "type": "item",
                "value": "2"
            }
        ],
        "activities": [
            {
                "name": "Ring of Lies",
                "source": "0de44cf9-5fa2-4baa-8275-c1fa71868761",
                "actions": "2A",
                "activationType": "Interact",
                "desc": "Snapping your fingers on the hand that wears the ring causes the ring to cast glibness on you with no visual manifestations of a spell being cast.",
                "castSpells": [
                    {
                        "name": "Glibness"
                    }
                ],
                "traits": [
                    "Uncommon",
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    },
    {
        "name": "Winged Boots",
        "id": "b45d0723-ade2-4ffe-a220-5bfaaa66b890",
        "desc": "Made from soft leather, with delicate white wings attached to the heel, these boots are ensorcelled with powerful air magic. Whenever you fall while wearing these boots, the boots automatically cast feather fall on you. This benefit can't trigger again for 10 minutes.",
        "level": 10,
        "bulk": "L",
        "price": 85000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn shoes",
        "activities": [
            {
                "name": "Winged Boots: Feather Fall",
                "source": "b45d0723-ade2-4ffe-a220-5bfaaa66b890",
                "cooldown": 1000,
                "target": "self",
                "desc": "Whenever you fall while wearing these boots, the boots automatically cast feather fall on you. This benefit can't trigger again for 10 minutes.",
                "castSpells": [
                    {
                        "name": "Feather Fall",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "inputRequired": "Activate the item when you fall."
            },
            {
                "name": "Winged Boots",
                "source": "b45d0723-ade2-4ffe-a220-5bfaaa66b890",
                "actions": "2A",
                "activationType": "Command, Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You speak a command word and click the boots' heels together to cause the wings to animate and flap rapidly, granting you a fly Speed of 30 feet for 10 minutes.",
                "gainConditions": [
                    {
                        "duration": 1000,
                        "name": "Winged Boots"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Crafter's Eyepiece (Greater)",
        "id": "19cde2df-4421-4d01-a898-51d57d41787c",
        "desc": "This rugged metal eyepiece etched with square patterns is designed to be worn over a single eye. Twisting the lens reveals a faint three-dimensional outline of an item you plan to build or repair, with helpful labels on the component parts. While worn, this eyepiece gives you a +1 item bonus to Crafting checks. When you Repair an item, increase the Hit Points restored by 15 per proficiency rank instead of 10.",
        "level": 11,
        "price": 12000,
        "subType": "Greater",
        "subTypeDesc": "The eyepiece grants a +2 item bonus and can be activated.",
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "When you Repair an item, increase the Hit Points restored by 15 per proficiency rank instead of 10.",
                "showon": "Crafting"
            }
        ],
        "effects": [
            {
                "affected": "Crafting",
                "type": "item",
                "value": 2
            }
        ],
        "activities": [
            {
                "name": "Crafter's Eyepiece (Greater)",
                "source": "19cde2df-4421-4d01-a898-51d57d41787c",
                "actions": "1 minute",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "desc": "You calibrate the eyepiece to have it cast a 5th-level creation spell over the course of 1 minute to construct a temporary item.",
                "castSpells": [
                    {
                        "level": 5,
                        "name": "Creation"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Necromancy"
                ]
            }
        ]
    },
    {
        "name": "Boots of Elvenkind (Greater)",
        "id": "c17fe719-2d55-4a0f-b74d-a90508aea9da",
        "desc": "These tall, pointed boots are made from soft, supple black or green leather and are decorated with trim and buckles of gold. When worn, the boots allow you to move more nimbly, granting you a +1 item bonus to Acrobatics checks.",
        "level": 11,
        "bulk": "L",
        "price": 125000,
        "subType": "Greater",
        "subTypeDesc": "The boots grant a +2 bonus. If you're also wearing a cloak of elvenkind, greater boots of elvenkind constantly grant the effects of pass without trace (DC 30) in forest environments.",
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn shoes",
        "hints": [
            {
                "desc": "If you're also wearing a cloak of elvenkind, greater boots of elvenkind constantly grant the effects of pass without trace (DC 30) in forest environments. In that case, the DC of checks to Track you in forests gains a +4 status bonus or is 30, whichever results in a higher DC.",
                "showon": "Movement",
                "effects": [
                    {
                        "affected": "Survival",
                        "type": "status",
                        "value": "Skill('Survival') > 26 ? 4 : 0"
                    },
                    {
                        "affected": "Survival",
                        "setValue": "Skill('Survival') > 26 ? null : 30"
                    }
                ]
            }
        ],
        "effects": [
            {
                "affected": "Acrobatics",
                "type": "item",
                "value": 2
            },
            {
                "affected": "Cloak of Elvenkind Charges",
                "setValue": 2
            },
            {
                "affected": "Cloak of Elvenkind (Greater) Charges",
                "setValue": 2
            }
        ],
        "activities": [
            {
                "name": "Boots of Elvenkind (Greater)",
                "source": "c17fe719-2d55-4a0f-b74d-a90508aea9da",
                "actions": "Free",
                "activationType": "Envision",
                "frequency": "once per hour",
                "cooldown": 6000,
                "desc": "Until the end of your turn, you ignore difficult terrain when moving on the ground. If you're wearing a cloak of elvenkind, you also gain a +5-foot status bonus to your land Speed until the end of your turn.",
                "gainConditions": [
                    {
                        "duration": 5,
                        "name": "Boots of Elvenkind",
                        "source": "Boots of Elvenkind"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Doubling Rings (Greater)",
        "id": "138be671-c974-48ab-a280-c30e9556eb79",
        "desc": "This item consists of two magically linked rings: an intricate, gleaming golden ring with a square-cut ruby, and a thick, plain iron ring. When you wield a melee weapon in the hand wearing the golden ring, the weapon's fundamental runes are replicated onto any melee weapon you wield in the hand wearing the iron ring. (The fundamental runes are weapon potency and striking, which add an item bonus to attack rolls and extra weapon damage dice, respectively.) Any fundamental runes on the weapon in the hand wearing the iron ring are suppressed.\n\nThe replication functions only if you wear both rings, and it ends as soon as you cease wielding a melee weapon in one of your hands. Consequently, the benefit doesn't apply to thrown attacks or if you're holding a weapon but not wielding it (such as holding in one hand a weapon that requires two hands to wield).",
        "level": 11,
        "price": 130000,
        "subType": "Greater",
        "subTypeDesc": "The rings also replicate property runes from the weapon in the gold-ringed hand, so long as the weapon in the iron-ringed hand meets all the prerequisites for a given rune and is not a specific weapon. The weapon in the iron-ringed hand gains the benefits of those runes. All its own runes are suppressed. When you invest the rings, you can elect for the rings to transfer only fundamental runes, in which case they function as standard doubling rings.",
        "traits": [
            "Evocation",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "isDoublingRings": "Doubling Rings (Greater)",
        "data": [
            {
                "name": "gold",
                "show": false
            },
            {
                "name": "iron",
                "show": false
            },
            {
                "name": "propertyRunes",
                "show": false,
                "value": "false"
            }
        ]
    },
    {
        "name": "Goggles of Night (Greater)",
        "id": "b1af94db-6e0b-492f-ba0c-788c3c00d4e5",
        "desc": "The opaque crystal lenses of these sleek goggles do not obscure vision, but rather enhance it. While wearing the goggles, you gain a +1 item bonus to Perception checks involving sight.",
        "level": 11,
        "price": 125000,
        "subType": "Greater",
        "subTypeDesc": "The item bonus is +2, and the darkvision lasts until you rotate the lenses back or the item is no longer invested by you, whichever comes first.",
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "While wearing the goggles, you gain a +2 item bonus to Perception checks involving sight.",
                "showon": "Perception",
                "effects": [
                    {
                        "affected": "Perception",
                        "type": "item",
                        "value": "2"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Goggles of Night (Greater)",
                "source": "b1af94db-6e0b-492f-ba0c-788c3c00d4e5",
                "actions": "1A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "desc": "Rotating the lenses 90 degrees, you gain darkvision until you rotate the lenses back or the item is no longer invested by you, whichever comes first.",
                "gainConditions": [
                    {
                        "choice": "Greater",
                        "duration": -1,
                        "hideChoices": [
                            true
                        ],
                        "name": "Goggles of Night",
                        "source": "Goggles of Night"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    },
    {
        "name": "Cloak of Elvenkind (Greater)",
        "id": "df38a8cc-49f9-41d2-97b8-101a5cf020be",
        "desc": "This cloak is deep green with a voluminous hood, embroidered with gold trim and symbols significant in elven culture. The cloak allows you to cast the ghost sound cantrip as an arcane innate spell. When you adjust the cloak's clasp (an Interact action), the cloak transforms to match the environment around you and muffles your sounds, granting you a +1 item bonus to Stealth checks.",
        "level": 12,
        "bulk": "L",
        "price": 175000,
        "subType": "Greater",
        "subTypeDesc": "The cloak grants a +2 item bonus, and the effects of 4th-level invisibility. If you're also wearing boots of elvenkind, the greater cloak of elvenkind allows you to Sneak in forest environments even when creatures are currently observing you.",
        "traits": [
            "Illusion",
            "Invested",
            "Magical"
        ],
        "usage": "worn cloak",
        "hints": [
            {
                "desc": "If you are wearing boots of elvenkind, the greater cloak of elvenkind allows you to Sneak in forest environments even when creatures are currently observing you.",
                "showon": "Stealth"
            }
        ],
        "effects": [
            {
                "affected": "Stealth",
                "type": "item",
                "value": 1
            }
        ],
        "activities": [
            {
                "name": "Cloak of Elvenkind (Greater)",
                "source": "df38a8cc-49f9-41d2-97b8-101a5cf020be",
                "actions": "2A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "target": "self",
                "desc": "You draw the hood up and gain the effects of 4th-level invisibility, with the spell's normal duration or until you pull the hood back down, whichever comes first. If you're also wearing boots of elvenkind, you can activate this ability twice per day.",
                "castSpells": [
                    {
                        "duration": 100,
                        "level": 4,
                        "name": "Invisibility",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical"
                ],
                "maxDuration": 100
            },
            {
                "name": "Cloak of Elvenkind (Greater): Adjust Clasp",
                "source": "df38a8cc-49f9-41d2-97b8-101a5cf020be",
                "actions": "1A",
                "activationType": "Interact",
                "toggle": true,
                "desc": "When you adjust the cloak's clasp, the cloak transforms to match the environment around you and muffles your sounds, granting you a +2 item bonus to Stealth checks.",
                "gainConditions": [
                    {
                        "duration": -1,
                        "name": "Cloak of Elvenkind (Greater)"
                    }
                ],
                "traits": [
                    "Illusion",
                    "Invested",
                    "Magical"
                ]
            }
        ],
        "gainSpells": [
            {
                "frequency": "at will",
                "level": 0,
                "tradition": "Arcane",
                "spells": [
                    {
                        "locked": true,
                        "name": "Ghost Sound"
                    }
                ]
            }
        ]
    },
    {
        "name": "Handwraps of Mighty Blows",
        "id": "89c3c5ae-8e09-11ea-9fab-e92c63c14723",
        "desc": "As you invest these embroidered strips of cloth, you must meditate and slowly wrap them around your hands. These handwraps have weapon runes etched into them to give your unarmed attacks the benefits of those runes, making your unarmed attacks work like magic weapons. For example, +1 striking handwraps of mighty blows would give you a +1 item bonus to attack rolls with your unarmed attacks and increase the damage of your unarmed attacks from one weapon die to two (normally 2d4 instead of 1d4, but if your fists have a different weapon damage die or you have other unarmed attacks, use two of that die size instead).\n\nYou can upgrade, add, and transfer runes to and from the handwraps just as you would for a weapon, and you can attach talismans to the handwraps. Treat the handwraps as melee weapons of the brawling group with light Bulk for these purposes. Property runes apply only when they would be applicable to the unarmed attack you're using. For example, a property that must be applied to a slashing weapon wouldn't function when you attacked with a fist, but you would gain its benefits if you attacked with a claw or some other slashing unarmed attack.",
        "level": 12,
        "price": 200000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn gloves",
        "isHandwrapsOfMightyBlows": true,
        "moddable": true,
        "potencyRune": 2,
        "strikingRune": 2
    },
    {
        "name": "Ring of the Ram (Greater)",
        "id": "d47bf271-881a-461d-adb0-cb90e733b173",
        "desc": "This heavy iron ring is shaped to look like the head of a ram, with curling horns.",
        "level": 13,
        "price": 270000,
        "subType": "Greater",
        "subTypeDesc": "The ring deals 3d6 force damage per action spent, and the save DC is 32. When you activate the ring using 3 actions, you can disperse the force into multiple magical rams, targeting all creatures in a 30-foot cone instead of one target within 60 feet.",
        "traits": [
            "Evocation",
            "Force",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "activities": [
            {
                "name": "Ring of the Ram (Greater)",
                "source": "d47bf271-881a-461d-adb0-cb90e733b173",
                "actions": "1A or more",
                "activationType": "Interact",
                "frequency": "once per minute",
                "cooldown": 100,
                "target": "other",
                "desc": "A ram-shaped blast of force slams into one foe that you can see within 60 feet. The number of actions you spend to Activate this Item (from 1 to 3) determines the intensity of the force. The blow deals |dice=3d6 Force| 3d6 force damage per action spent and pushes the target 5 feet per action spent. The target must attempt a DC 32 Fortitude save. When you activate the ring using 3 actions, you can disperse the force into multiple magical rams, targeting all creatures in a 30-foot cone instead of one target within 60 feet.",
                "traits": [
                    "Evocation",
                    "Force",
                    "Invested",
                    "Magical"
                ],
                "critsuccess": "The target is unaffected.",
                "success": "The target takes half damage and is pushed half the distance.",
                "failure": "The target takes full damage and is pushed the full distance.",
                "critfailure": "The target takes double damage and is pushed twice the distance."
            }
        ]
    },
    {
        "name": "Horseshoes of Speed (Greater)",
        "id": "a55f74b4-9a05-11ea-bb37-0242ac130002",
        "desc": "When you affix these simple iron horseshoes to the hooves of an ordinary horse or a quadrupedal animal companion and the animal companion invests them, that creature gains a +5-foot item bonus to its land Speed and a +2 item bonus to Athletics checks to High Jump and Long Jump. In addition, when it Leaps, it can move 5 feet farther if jumping horizontally or 3 feet higher if jumping vertically.",
        "level": 14,
        "bulk": "1",
        "price": 425000,
        "subType": "Greater",
        "subTypeDesc": "The bonus to Speed is +10 feet, and the bonus to Athletics checks is +3.",
        "traits": [
            "Companion",
            "Invested",
            "Primal",
            "Transmutation"
        ],
        "usage": "worn horseshoes",
        "hints": [
            {
                "desc": "Your animal companion gains a +3 item bonus to Athletics checks to High Jump and Long Jump. When it Leaps, it can move 5 feet farther if jumping horizontally or 3 feet higher if jumping vertically.",
                "showon": "Athletics",
                "effects": [
                    {
                        "affected": "Athletics",
                        "type": "item",
                        "value": "3"
                    }
                ]
            }
        ],
        "effects": [
            {
                "affected": "Land Speed",
                "type": "item",
                "value": 10
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Acid, Major)",
        "id": "c423fb02-a4dd-4fcf-8b15-70d46d719b60",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 14,
        "price": 440000,
        "subType": "Acid, Major",
        "subTypeDesc": "The ring grant resistance 15 against acid damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Acid Resistance",
                "value": 15
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Cold, Major)",
        "id": "95398fbc-2f7f-4de5-adf2-a3da9413ab95",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 14,
        "price": 440000,
        "subType": "Cold, Major",
        "subTypeDesc": "The ring grant resistance 15 against cold damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Cold Resistance",
                "value": 15
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Electricity, Major)",
        "id": "c4727cc4-28b5-4d7a-b4ea-854b97de2542",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 14,
        "price": 440000,
        "subType": "Electricity, Major",
        "subTypeDesc": "The ring grant resistance 15 against electricity damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Electricity Resistance",
                "value": 15
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Fire, Major)",
        "id": "99b02a8a-b3ce-44ee-be45-8cfcf1a2835b",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 14,
        "price": 440000,
        "subType": "Fire, Major",
        "subTypeDesc": "The ring grant resistance 15 against fire damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Fire Resistance",
                "value": 15
            }
        ]
    },
    {
        "name": "Ring of Energy Resistance (Sonic, Major)",
        "id": "5144f481-8875-436e-ad42-48b53ac93e08",
        "desc": "This ring grants you resistance 5 against one type of energy damage: acid, cold, electricity, fire, or sonic. Each ring is crafted to protect against a particular type of energy damage, and its design usually embodies the type of energy it protects the wearer from in some way. For instance, a ring of fire resistance might be capped with a ruby, whereas a ring of cold resistance features a sapphire instead.",
        "level": 14,
        "price": 440000,
        "subType": "Sonic, Major",
        "subTypeDesc": "The ring grant resistance 15 against sonic damage.",
        "traits": [
            "Abjuration",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "effects": [
            {
                "affected": "Sonic Resistance",
                "value": 15
            }
        ]
    },
    {
        "name": "Handwraps of Mighty Blows",
        "id": "89c3c5b1-8e09-11ea-9fab-e92c63c14723",
        "desc": "As you invest these embroidered strips of cloth, you must meditate and slowly wrap them around your hands. These handwraps have weapon runes etched into them to give your unarmed attacks the benefits of those runes, making your unarmed attacks work like magic weapons. For example, +1 striking handwraps of mighty blows would give you a +1 item bonus to attack rolls with your unarmed attacks and increase the damage of your unarmed attacks from one weapon die to two (normally 2d4 instead of 1d4, but if your fists have a different weapon damage die or you have other unarmed attacks, use two of that die size instead).\n\nYou can upgrade, add, and transfer runes to and from the handwraps just as you would for a weapon, and you can attach talismans to the handwraps. Treat the handwraps as melee weapons of the brawling group with light Bulk for these purposes. Property runes apply only when they would be applicable to the unarmed attack you're using. For example, a property that must be applied to a slashing weapon wouldn't function when you attacked with a fist, but you would gain its benefits if you attacked with a claw or some other slashing unarmed attack.",
        "level": 16,
        "price": 1000000,
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn gloves",
        "isHandwrapsOfMightyBlows": true,
        "moddable": true,
        "potencyRune": 3,
        "strikingRune": 2
    },
    {
        "name": "Armbands of Athleticism (Greater)",
        "id": "02546135-7000-40b4-8cc0-cac0200bc812",
        "desc": "Skilled awl work has imprinted images of a muscled weightlifter into these tiered leather bands, which grant you enhanced stamina and skill when performing athletic exercises. While fastened to your upper arms, the armbands give you a +2 item bonus to Athletics checks. In addition, whenever you use an action to Climb or Swim and you succeed at the Athletics check, add a +5-foot item bonus to the distance you move.",
        "level": 17,
        "bulk": "L",
        "price": 130000,
        "subType": "Greater",
        "subTypeDesc": "The bonus to Athletics checks is +3, and the bonus to a successful check to Climb or Swim is +10 feet.",
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn armbands",
        "hints": [
            {
                "desc": "Whenever you use an action to Climb or Swim and you succeed at the Athletics check, add a +10-foot item bonus to the distance you move.",
                "showon": "Athletics"
            }
        ],
        "effects": [
            {
                "affected": "Athletics",
                "type": "item",
                "value": 3
            }
        ]
    },
    {
        "name": "Cloak of the Bat (Greater)",
        "id": "e85d2d73-fedf-4855-ab58-fcf143a45ba2",
        "desc": "Sewn from several long strips of luxurious brown and black silk, this cloak grants you a +2 item bonus to Stealth checks as well as to Acrobatics checks to Maneuver in Flight. You can also use your feet to hang from any surface that can support your weight, without requiring any check, though you still must attempt Athletics checks to Climb in order to move around while inverted.",
        "level": 17,
        "bulk": "L",
        "price": 1300000,
        "subType": "Greater",
        "subTypeDesc": "The item bonus is +3, and you can activate the cloak any number of times per day.",
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn cloak",
        "hints": [
            {
                "desc": "The cloak grants you a +3 item bonus to Acrobatics checks to Maneuver in Flight. You can also use your feet to hang from any surface that can support your weight, without requiring any check, though you still must attempt Athletics checks to Climb in order to move around while inverted.",
                "showon": "Acrobatics, Movement",
                "effects": [
                    {
                        "affected": "Acrobatics",
                        "type": "item",
                        "value": "3"
                    }
                ]
            }
        ],
        "effects": [
            {
                "affected": "Stealth",
                "type": "item",
                "value": 3
            }
        ],
        "activities": [
            {
                "name": "Cloak of the Bat (Greater): Bat Wings",
                "source": "e85d2d73-fedf-4855-ab58-fcf143a45ba2",
                "actions": "2A",
                "activationType": "Command, Interact",
                "desc": "You can either transform the cloak into bat-like wings that grant you a fly Speed of 30 feet for 10 minutes, or have the cloak turn you into a bat by casting a 4th-level pest form spell on you.",
                "gainConditions": [
                    {
                        "duration": 1000,
                        "name": "Cloak of the Bat",
                        "source": "Cloak of the Bat"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "sharedChargesID": 1
            },
            {
                "name": "Cloak of the Bat (Greater): Bat Form",
                "source": "e85d2d73-fedf-4855-ab58-fcf143a45ba2",
                "actions": "2A",
                "activationType": "Command, Interact",
                "target": "self",
                "desc": "You can either transform the cloak into bat-like wings that grant you a fly Speed of 30 feet for 10 minutes, or have the cloak turn you into a bat by casting a 4th-level pest form spell on you.",
                "castSpells": [
                    {
                        "level": 4,
                        "name": "Pest Form",
                        "target": "self"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ],
                "sharedChargesID": 1
            }
        ]
    },
    {
        "name": "Goggles of Night (Major)",
        "id": "c320dd0c-347a-4d66-8ad8-5fb0a6571bc4",
        "desc": "The opaque crystal lenses of these sleek goggles do not obscure vision, but rather enhance it. While wearing the goggles, you gain a +1 item bonus to Perception checks involving sight.",
        "level": 18,
        "price": 2000000,
        "subType": "Major",
        "subTypeDesc": "The item bonus is +3, and the goggles grant greater darkvision, which lasts until you rotate the lenses back or the item is no longer invested by you, whichever comes first.",
        "traits": [
            "Invested",
            "Magical",
            "Transmutation"
        ],
        "usage": "worn eyepiece",
        "hints": [
            {
                "desc": "While wearing the goggles, you gain a +3 item bonus to Perception checks involving sight.",
                "showon": "Perception",
                "effects": [
                    {
                        "affected": "Acrobatics",
                        "type": "item",
                        "value": "3"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Goggles of Night (Major)",
                "source": "c320dd0c-347a-4d66-8ad8-5fb0a6571bc4",
                "actions": "1A",
                "activationType": "Interact",
                "frequency": "once per day",
                "cooldown": 144000,
                "toggle": true,
                "desc": "Rotating the lenses 90 degrees, you gain greater darkvision until you rotate the lenses back or the item is no longer invested by you, whichever comes first.",
                "gainConditions": [
                    {
                        "duration": -1,
                        "name": "Goggles of Night (Major)",
                        "source": "Goggles of Night (Major)"
                    }
                ],
                "traits": [
                    "Invested",
                    "Magical",
                    "Transmutation"
                ]
            }
        ]
    }
]