[
    {
        "name": "Hunter's Arrowhead",
        "id": "27f7e66c-fd8f-45c7-a61e-d10c5fd7ff67",
        "desc": "This arrowhead-shaped charm is not meant to be affixed to an arrow, but instead to be carried in a pocket or inside of a quiver. A hunter's arrowhead is etched with images sacred to the elven god Ketephys. If you carry one on your person, you are infused with great skill at hunting, and gain a +1 item bonus to Survival skill checks and attack rolls against any creature you've currently designated as your prey for the Hunt Prey ranger ability (note that the bonus to attack rolls is an item bonus, and therefore not cumulative with an item bonus from a magic weapon). A hunter's arrowhead is also a religious symbol of Ketephys.",
        "_extensionFileName": "pathfinder145",
        "sourceBook": "Pathfinder #145: Hellknight Hill",
        "level": 4,
        "price": 8000,
        "traits": [
            "Rare",
            "Enchantment",
            "Invested",
            "Magical"
        ],
        "usage": "worn",
        "hints": [
            {
                "desc": "You gain a +1 item bonus to Survival skill checks and attack rolls against any creature you've currently designated as your prey for the Hunt Prey ranger ability (note that the bonus to attack rolls is an item bonus, and therefore not cumulative with an item bonus from a magic weapon).",
                "showon": "Survival, Attacks",
                "effects": [
                    {
                        "affected": "Survival",
                        "type": "item",
                        "value": "1"
                    },
                    {
                        "affected": "Attack Rolls",
                        "type": "item",
                        "value": "1"
                    }
                ]
            }
        ],
        "activities": [
            {
                "name": "Hunter's Arrowhead",
                "actions": "Reaction",
                "activationType": "Command",
                "frequency": "once per day",
                "cooldown": 144000,
                "trigger": "You would miss with an attack made with a bow",
                "desc": "You get a +2 circumstance bonus to your attack roll. This can turn a miss into a hit.",
                "traits": [
                    "Rare",
                    "Enchantment",
                    "Invested",
                    "Magical"
                ]
            }
        ]
    }
]
