[
    {
        "name": "Vulpine Pounce",
        "actions": "3A",
        "requirements": "You are in humanoid or fox form.",
        "inputRequired": "Dismiss humanoid form or animal form when you use Vulpine Pounce.",
        "desc": "You change into your Kitsune form and pounce on your enemy in one swift motion. Stride twice and dismiss humanoid form or animal form, changing to your Kitsune form during the charge. If you end your movement within melee reach of at least one enemy, you can make two melee Strikes. Apply your multiple attack penalty to the strikes normally. You can use Vulpine Pounce while Burrowing, Climbing, Flying or Swimming instead of Striding if you have the corresponding movement type.",
        "traits": [
            "Flourish"
        ]
    },
    {
        "name": "Gregarious Kitsune",
        "actions": "Reaction",
        "trigger": "You critically fail a Diplomacy check.",
        "desc": "When tempers flare, you quickly catch your mistake and attempt to smoothen things over with honeyed words. Reroll the triggering Diplomacy check, using the second result."
    },
    {
        "name": "Kitsune Human Form",
        "actions": "2A",
        "toggle": true,
        "desc": "You can change to your human form at will. This works like a 2nd level humanoid form spell, except that there is only one form you can take, and the spell is permanent until dismissed.\n\nYou cannot use your jaws attack in human form.",
        "hints": [
            {
                "desc": "You cannot use your jaws attack in human form.",
                "showon": "Attacks"
            }
        ],
        "castSpells": [
            {
                "name": "Humanoid Form",
                "level": 2,
                "duration": -1,
                "_className": "SpellCast"
            }
        ]
    },
    {
        "name": "Kitsune Fox Shape",
        "actions": "2A",
        "toggle": true,
        "desc": "You have a magical connection to your animal kin. You choose the form of a small fox which is static and cannot be changed. You change into your chosen form. This works like a 2nd level animal form spell, except that you can only be a canine in the chosen fox form.\n\nIf you have the Fast Shifter feat, it applies to your fox shape as well.",
        "castSpells": [
            {
                "name": "Animal Form",
                "level": 2,
                "duration": -2,
                "_className": "SpellCast"
            }
        ]
    }
]